[
    {
      "id": "4ca744df-5a54-4dc7-9f54-8dc571dbfbdb",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/4ca744df-5a54-4dc7-9f54-8dc571dbfbdb",
      "created_at": "Tue Mar 16 03:08:28 UTC 2021",
      "company": "You Need A Budget (YNAB)",
      "company_url": "https://www.youneedabudget.com/",
      "location": "Remote",
      "title": "Humbly Confident Senior iOS Developer ",
      "description": "<p><strong>About Us and Why We’re Hiring</strong></p>\n<p>We build “You Need a Budget,” the best budgeting software and education resources around. (Those in the know call us YNAB, which is pronounced “why-nab.”) For more than a decade, people have been buying YNAB and then telling their friends what a difference it has made in their lives. <a href=\"https://www.google.com/search?q=ynab\">Google us</a>, or read some of our <a href=\"https://apps.apple.com/us/app/ynab-you-need-a-budget/id1010865877\">reviews on the app store</a>, and you’ll see what we mean. We love building something that has a huge positive impact on people’s lives.</p>\n<p>YNAB is growing, and so is our product team. We’re a software ecosystem that includes apps for web, iPhone, iPad, Apple Watch, and Android phones. We have some big plans for our iOS app, and that’s where you come in!</p>\n<p>We have one overarching requirement when it comes to joining our team: our <a href=\"https://docs.google.com/document/d/16hufsixsrv1j2jZkWUgQmeKpNfQRsacnnK2xTVwO0ew/edit\">Cultural Manifesto</a> has to really click with you. If you’re nodding emphatically while reading this, you’ll probably fit right in!</p>\n<p>Of course, we have some firm requirements too. You must have at least five years of professional software development experience, and a minimum of four years spent writing iOS apps.</p>\n<p>But first, let’s talk about life at YNAB, and then we’ll go into detail about what we’re looking for.</p>\n<p><strong>Who You’d Be Working With</strong></p>\n<p>Our developer team is about 25 people strong, and we frequently operate in cross-functional teams, so you’ll get to work with awesome people from all different roles in the company.</p>\n<p>Regardless of their varied interests, all of our developers have one thing in common: They are a joy to work with. You won’t find heated arguments and raised voices here. We save our competitive spirit for YNAB’s external competitors (or the occasional lively board game session), but internally we build up our teammates and celebrate their successes. We all love to program and solve problems in creative ways, and we regularly take time to geek out and show each other something cool we built or found to make our lives easier.</p>\n<p>And of course, as a developer, you’ll work closely with our amazing designers. They have the awards (including at least one actual Emmy®) to prove they’re good at designing stuff. More importantly, they welcome feedback and suggestions during the development process and are happy to tweak an interaction if you tell them it will save you significant development effort.</p>\n<p><strong>How You’ll Work at YNAB</strong></p>\n<p>We strive hard to make working at YNAB a unique and fantastic experience (we’ve even been named <a href=\"https://fortune.com/best-small-workplaces/you-need-a-budget/\">Fortune’s #1 Best Small Company to Work For</a>). We have a team full of truly exceptional people—the kind you’ll be excited to work with. Here’s how we operate:</p>\n<p><strong>Responsibility and Empowerment</strong></p>\n<p>We appreciate, respect, and trust the expertise and judgment of our developers. We empower them to do what they think is right.</p>\n<p>We also work collaboratively. We continuously seek the right amount of structure and unity necessary to maximize productivity. Where it makes sense, we designate someone to make a call.</p>\n<p>Even though our developers are right a lot, it's okay to make mistakes here. Exploration and calculated risks are vital to velocity and growth. We freely admit when we're wrong. If something doesn't go as expected, we learn, bounce back, and make corrections.</p>\n<p>You won't be alone; others will be there to help, review, reassure, and back you up. We own our processes and collective outcomes as a team.</p>\n<p><strong>Live Where You Want</strong></p>\n<p>We’re a distributed team, so you can live and work wherever you want, as long as it’s somewhere between the Pacific Time Zone (UTC-8) and the Central European Time Zone (UTC+1). Proximity doesn’t influence productivity. Just make sure you have a reliable internet connection.</p>\n<p><strong>No Crazy Hours</strong></p>\n<p>We want everyone to have a full life outside of YNAB. We seldom work more than 40 hours per week. There have been rare occasions where things got a little crazy, and people logged some extra hours. But then they took additional time off to balance it all out. We work hard and smart, but we’re in this for the long haul; there’s no need to go crazy on the hours.</p>\n<p><strong>Take Vacation (Seriously)</strong></p>\n<p>We want you to take vacation. In fact, we have a minimum vacation policy of three weeks per year. Five weeks feels about right (plus two extra weeks for Holiday break). It’s important to get plenty of downtime and get out and do something. We’ll look forward to seeing pictures of your adventures in our #office_wall Slack channel.</p>\n<p><strong>The YNAB Retreat</strong></p>\n<p>When the pandemic isn’t keeping us from traveling, we get the teams together once a year to catch up on spreadsheets and powerpoints in a Best Western conference room. Just kidding. So far, we’ve done <a href=\"https://www.youtube.com/watch?v=8Fs1TN-jrDI&amp;t\">Costa Rica</a>, a <a href=\"https://www.youneedabudget.com/if-you-feel-guilty-spending-money-youre-doing-it-wrong/\">gigantic cabin</a> in the mountains, a beach house in the Outer Banks, a ranch in Montana, and most recently, <a href=\"https://www.youtube.com/watch?v=js5pNTDKiZE&amp;feature=youtu.be\">Laguna Beach</a>. We do really fun things at these retreats, but the highlight is inevitably just being together and having a blast.</p>\n<p><strong>Up Your Game</strong></p>\n<p>We’re serious about helping you improve your craft. We budget for it (hey-o!). Think conferences, Lynda/Skillshare subscriptions, books, and dedicated time away from work to learn something new. We love to see our people grow.</p>\n<p><strong>International is Absolutely Okay</strong></p>\n<p>If you are Stateside, we’ll set you up as a W2 employee. If you’re international, you’ll be set up as a contractor. We are already spread across the world: Switzerland, Scotland, Mexico, Brazil, Argentina, Germany, Canada, and all over the United States.</p>\n<p><strong>Benefits</strong></p>\n<p>We offer excellent health, dental, and vision insurance for our US employees, where we cover 100% of the premium for you and your family. (No need to check your vision, you read that right, 100%. Although if you did need to check your vision, we’ve got you covered!)</p>\n<p>We also have a Traditional and Roth 401k option. YNAB matches your contributions, up to six percent of your paycheck. Matches vest immediately. (Are you a personal finance junkie like our founder Jesse? He set up YNAB’s 401k to have the lowest fee structure possible, where all plan costs are paid by YNAB, not your retirement nest egg. The investment funds available are fantastic, passively-managed, ultra low-cost index funds. You’re not a PF junkie? Trust us, it’s awesome.)</p>\n<p><strong>Competitive Compensation</strong></p>\n<p>We use a leading compensation data provider to set competitive and well-defined pay ranges for all of our positions. Your pay is the same no matter where you live, and our goal is to pay at or above the market rate in the United States. We consider raises every year and have a bonus plan based on profitability, which you’re in on from day one. YNAB wins, you win. That kind of thing.</p>\n<p><strong>Other Tidbits</strong></p>\n<ul>\n<li>Once you start, we DEMAND (in a friendly, ALL CAPS IS YELLING way) that you fill out your “Bucket List” spreadsheet with 50 items. (That’s harder than it sounds!)</li>\n<li>The bucket list really helps in deciding what we should give you for your birthday and the holidays.</li>\n<li>We’re all adults. There’s no need to punch a clock or ask for permission to take off early one afternoon to go see the doctor. We look at what you accomplish, not how long you sit (have you tried standing?) in front of a computer.</li>\n<li>We want you firing on all cylinders so we’ll set you up with a top-of-the-line computer and phone and will replace them regularly.</li>\n<li>Did we mention we make a huge, positive difference in people’s lives?</li>\n</ul>\n<p>If this sounds like your ideal environment, read on because now we want to talk about you. You will play a big part in building something easy and joyful to use that helps millions of people discover budgeting as an essential financial and life-planning tool. <em>You will change lives.</em></p>\n<p><strong>You, Our New Senior iOS Developer</strong></p>\n<p>You're a software developer with over five years of professional, full-time experience. You spent at least four of those years working with iOS. You know how to write easy-to-maintain software while still keeping an eye on the roadmap.</p>\n<p>You'll help us write and maintain features in our iOS/iPadOS/watchOS app.</p>\n<p>We have a native Swift/Objective-C implementation for the app infrastructure and user interface code. We are migrating our codebase over time from Objective-C to Swift, with all new development in Swift.</p>\n<p>We use a shared library written in TypeScript for things common across platforms, such as interfacing with our Rails/Postgres server and much of our business logic. We use SQLite for local storage.</p>\n<p>As an iOS developer here, you don’t have to be an expert in TypeScript or SQL, but being curious about how things work on that layer will help.</p>\n<p><strong>You’re our person if:</strong></p>\n<ul>\n<li>You are an excellent, senior developer that can adapt to new languages quickly.</li>\n<li>You write code that is easy for other programmers and your future self to understand and use.</li>\n<li>You have deep experience with Swift and are comfortable with Objective-C.</li>\n<li>You have played an essential role in building, shipping, and supporting at least one significant iOS app.</li>\n<li>You have excellent debugging skills. You know how to find problems and how to build apps so that problems are discoverable in the first place.</li>\n<li>You have an understanding of algorithms and data structures beyond arrays and “for loops.” That doesn’t mean you have to be a computer science PhD or even that you have to know “Big O” notation, but you should know when to use a Dictionary/Map, and why finding an element in a sorted array is faster than finding an element in an unsorted array.</li>\n<li>You aren’t (necessarily) a security specialist, but you know enough to be protective of customer data and privacy.</li>\n<li>You already use and love YNAB. (Not a requirement, but we’ll give you bonus points for this one.)</li>\n</ul>\n<p><strong>Diversity</strong></p>\n<p>YNAB is an equal opportunity employer. We believe a diversity of backgrounds, beliefs, abilities, and experiences is critical to our success. We are passionate about creating a welcoming, supportive, and collaborative environment for all employees. All are encouraged to apply as we continue to grow a smart, experienced, and diverse team that loves working together to build something that matters.</p>\n<p><strong>How to Apply</strong></p>\n<p><strong>Apply by 11:59PM on March 28th, 2021.</strong> Firm. It’s a real deadline.</p>\n<p>Write a cover letter and attach it as a PDF. In your cover letter:</p>\n<ul>\n<li>\n<p>Introduce yourself, tell us why this position is of interest to you, and why you would be a great fit. This portion of the cover letter should be less than a page and a half.</p>\n</li>\n<li>\n<p>On a separate page of your cover letter, please answer the following questions. Each response should be about a paragraph in length:</p>\n<ul>\n<li>What criteria do you look for when searching for your next company or position?</li>\n<li>What are your favorite and least favorite parts of your current job?</li>\n<li>Tell us about a time when you had to learn something new to excel at your job.</li>\n<li>Please tell us about apps or anything you’ve built that makes you look good, and describe your role in those projects. (Include links if applicable.)</li>\n<li>Briefly (no more than a few sentences) describe a proud “debugging” moment you had, where you found and fixed a bug.</li>\n<li>If you were interviewing a prospective developer for this position, what would be a good interview question to ask to find out if a candidate really knew their stuff?</li>\n</ul>\n</li>\n<li>\n<p>Complete this short coding test in your language of choice and include a link to your results in your cover letter. This shouldn’t take more than 30 minutes or so: <a href=\"https://www.interviewzen.com/apply/PVNGB2\">https://www.interviewzen.com/apply/PVNGB2</a></p>\n<ul>\n<li>Swift isn’t directly supported yet in that simple Interview Zen code editor, but you can choose plain “Text” as the language and write in Swift anyway if you like.</li>\n</ul>\n</li>\n</ul>\n<p>If you have a prepared resume, attach it in PDF form. If you don’t have a resume because you aren’t even sure you’re looking to change jobs, that’s fine! In that case, please just include an informal list of your work and education history or a link to your LinkedIn profile.\nPlease send all attachments as PDFs.</p>\n<p>P.S.  If this position isn’t right for you at this time, but you know someone else who might be interested, we’d really appreciate it if you passed this along!</p>\n",
      "how_to_apply": "<p><a href=\"https://ynab.recruiterbox.com/jobs/fk0u7tc\">https://ynab.recruiterbox.com/jobs/fk0u7tc</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjZjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ab6573768561d1943a43b1ec5775a465ccb31ca1/YNAB_wordmark_blue-LG.png"
    },
    {
      "id": "96200331-22ec-4f7c-9ef5-ebcae89e03af",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/96200331-22ec-4f7c-9ef5-ebcae89e03af",
      "created_at": "Tue Mar 16 01:25:21 UTC 2021",
      "company": "SweetRush",
      "company_url": "https://www.sweetrush.com/",
      "location": "Remote",
      "title": "Senior Creative Front End Web Developer",
      "description": "<p><strong>SweetRush has an exciting opportunity for an experienced creative front-end developer (full stack is also acceptable) with an eye for graphic and UX design!</strong></p>\n<p><strong>ABOUT THE ROLE:</strong></p>\n<p>This is an important role on the Engineering and Development department’s Course Development team, and you will be reporting directly to the Course Development team lead.</p>\n<p>Historically, the developers most successful in this role contribute to multiple projects at the same time; show a willingness to improve existing techniques, frameworks, and templates; and come up with innovations of their own. You will succeed if you truly enjoy active collaboration with your colleagues and don’t mind stepping in when your help is required.</p>\n<p>This is a remote position and a great opportunity to work from home. Candidates from all geographic locations are welcome to apply; however, our development team is mostly based in North and Latin America, and you should be willing to work during our business hours.</p>\n<p><strong>REQUIRED SKILLS:</strong></p>\n<p>Front end</p>\n<ul>\n<li>\n<p>7+ years as a front-end or full stack developer in a creative environment</p>\n</li>\n<li>\n<p>Expert-level JavaScript skills—Vanilla JS expertise is as important as the knowledge of frameworks and libraries</p>\n</li>\n<li>\n<p>High level of competency in HTML5 and CSS3</p>\n</li>\n<li>\n<p>Familiarity with one or more frameworks, preferably React and Node.js</p>\n</li>\n<li>\n<p>While React is the most commonly used framework at the moment, your proven ability to quickly harness unfamiliar technology is more important than an intimate knowledge of any of the given frameworks.</p>\n</li>\n<li>\n<p>Most importantly - you can look at just about any cool effect, interaction, animation, parallax, website on the web, and say - Even if I can’t do this now, I want to try!</p>\n</li>\n<li>\n<p>Understanding of responsive design and mobile-first principles</p>\n</li>\n<li>\n<p>Soft skills and generic productivity tools</p>\n</li>\n<li>\n<p>Ability to clearly communicate in English</p>\n</li>\n<li>\n<p>English verbal communication skills are an absolute must because the position requires frequent interaction with peers and clients.</p>\n</li>\n<li>\n<p>Experience with version control systems such as Git or Subversion</p>\n</li>\n<li>\n<p>Experience working in a team development environment or demonstrating a capacity to do so</p>\n</li>\n<li>\n<p>Enjoy learning and experimenting, open to new ideas</p>\n</li>\n</ul>\n<p><strong>YOU WILL IMPRESS EVERYONE IF YOU:</strong></p>\n<ul>\n<li>Have built a learning simulation</li>\n<li>Have experience with mobile app development and distribution</li>\n<li>Have experience with graphic and UX design</li>\n<li>Know anything about Adapt Framework</li>\n</ul>\n<p><strong>YOU MAY BE EXPECTED TO:</strong></p>\n<ul>\n<li>Complete a test assignment</li>\n<li>Be interviewed by a number of highly judgmental yet supremely talented future colleagues</li>\n</ul>\n<p><strong>THE ESSENCE OF THE JOB</strong></p>\n<p>OK, now that you’ve made it through all the obligatory language, you may be wondering what this position is really all about. Therefore, please read the rest of this job description carefully!</p>\n<p>It all boils down to your ability to make a simple claim: I can do it!</p>\n<p>If we show you an interactive website with intricate animations, a complicated menu system, and multiple interdependencies, you should state: I can do it!</p>\n<p>If we need to harness a complex web-based gaming engine and use it for the first time to build a learning simulation, you should confidently assert: I can do it!</p>\n<p>If we need to produce a large volume of digital training materials in a record short period of time, you should answer: I can do it!</p>\n<p>And if we need an adventurous engineer to lead the team in the creation of a system that is completely different from everything we have done before, we’re most definitely looking for the loud I can do it!</p>\n<p>And even more importantly, you must want to do it.</p>\n<p>SweetRush is a team of winners. These are not empty words. Just check out our impressive industry trophy shelf, which includes this recent success: <a href=\"https://www.sweetrush.com/sweetrush-wins-16-awards-brandon-hall-awards-2020\">https://www.sweetrush.com/sweetrush-wins-16-awards-brandon-hall-awards-2020</a>.</p>\n<p>As a winner, you will always want the ball. Want to do better. Want to be more creative and efficient. Join us, and let's see if we can win even more by working together!</p>\n<p>This is a work-from-home opportunity! We are 100% virtual, and all communications occur over digital channels (Skype/Web Share/email), apart from infrequent on-site meetings. Occasional travel may be required.</p>\n<p><strong>IF THE ABOVE DESCRIBES YOUR INTERESTS AND EXPERIENCE, PLEASE SUBMIT A CURRENT RESUME AND YOUR SALARY REQUIREMENTS. WE LOOK FORWARD TO MEETING YOU!</strong></p>\n<p><em>Please note: We're all about remote work and have collaborators based all around the world; however, SweetRush is a US-based company, and English is our primary language. If you'd like to be considered for this opportunity, please submit your resume in English.</em></p>\n",
      "how_to_apply": "<p>Please submit your application through the following link:</p>\n<p><a href=\"https://www.sweetrush.com/join-us/\">https://www.sweetrush.com/join-us/</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcm1jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9ca1b3c2e98a6d61379628a0b2309d50c4c16ff6/SR%20logo.png"
    },
    {
      "id": "d3fcb173-7088-4110-8abd-df8bc76610c9",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/d3fcb173-7088-4110-8abd-df8bc76610c9",
      "created_at": "Mon Mar 15 22:25:12 UTC 2021",
      "company": "Gamdom.com",
      "company_url": "http:",
      "location": "Canada",
      "title": "Senior Backend Engineer (Node.js)",
      "description": "<p>We are looking for some creative, proactive professionals. Gamdom consists of a team of great young professionals, we are continuously looking to improve and to innovate. Are you a Backend, or Full stack developer with experience with node? Or do you know someone who is currently looking for their dream job? Any valuable information to help us find IT-professionals will be rewarded!</p>\n<p>What We’d Like to See</p>\n<p>✔️ Experience with TypeScript and Node.js/SQL a must.\n✔️ Being able to communicate in English.\n✔️ Flexibility is second nature for you.\n✔️ Ability to write clean code that avoids bugs. Quality matters to us!\n✔️ Being able to see the larger picture. Don't just add code until the feature works - understand how your changes influence the overall architecture and respect the intents of your team members!</p>\n<p>What We’re Offering</p>\n<p>➕ A chance to work on one of the most popular gaming themed gambling websites\n➕ Be part of a young, motivated, and fun team of young professionals\n➕ A competitive salary\n➕ An opportunity to work on different features\n➕ Work remotely from home, you will be able to choose your own worktimes and days\n➕ Weekly stand-ups and individual meetings to help you grow and keep you motivated\n➕ Exciting technologies to work with: TypeScript, React, Mobx, PostgreSQL, NodeJS, Socket.io, Redis.</p>\n<p>Interested? Apply now!</p>\n<p>Please send your application to <a href=\"mailto:Jobs@gamdom.com\">Jobs@gamdom.com</a> or directly at this job offer! In your application, just write a few sentences about yourself, your motivation, and why you would be a good fit for Gamdom.</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:Felix@gamdom.com\">Felix@gamdom.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcStjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f1e50b660e33b469d44f3e0056bfb0dbc3ec1826/photo5945096832545830307.jpg"
    },
    {
      "id": "e1b99fbb-5687-46a5-86e8-3dedd0bf20fb",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/e1b99fbb-5687-46a5-86e8-3dedd0bf20fb",
      "created_at": "Mon Mar 15 21:02:28 UTC 2021",
      "company": "TED Conferences",
      "company_url": "http://ted.com",
      "location": "Remote",
      "title": "Software Engineer - React Native",
      "description": "<p><strong>POSITION OVERVIEW</strong></p>\n<p>TED creates, produces and distributes audio and video media (most famously TED Talks) to millions of people around the world. As a Software Engineer working with React Native, you will be responsible for the development of mobile apps which deliver TED content to millions of people around the world. You will collaborate with a team of top-tier developers, designers and product owners to take new features and products from conception to production.</p>\n<p><strong>QUALIFICATIONS / SKILLS</strong></p>\n<ul>\n<li>4+ years of professional experience in software development.</li>\n<li>Expert-level knowledge of:\nJavaScript in frontend environments\nReact Native\nTypeScript\nReact best practices and patterns (hooks, functional components, state management, etc)</li>\n<li>Strong knowledge of:\nHTML, CSS and other web front-end technologies.</li>\n<li>Integrating with remote services asynchronously via REST, GraphQL, etc.</li>\n<li>Collaborating with teams via GitHub using pull requests and version control best-practices.</li>\n<li>Preferred experience with:\nNative iOS and/or Android development and tool chains\nFirebase\nVideo streaming technologies\nReact in the browser\n-Absolutely must be a self-starter whose default mode is action and persistence.</li>\n<li>Proactive, positive communication and a team-first attitude are paramount.</li>\n<li>Must be a ferocious debugger who is unfazed by complex toolchains, immature SDKs and emerging technologies.</li>\n<li>Values cross-functional collaboration</li>\n<li>Values a diverse workplace</li>\n<li>Familiarity with git and version control best practices</li>\n<li>Familiarity with Unix command line and best practices</li>\n</ul>\n<p><strong>RESPONSIBILITIES</strong></p>\n<ul>\n<li>Develop high-performing apps that stream TED’s media to millions of people</li>\n<li>Develop conference technology apps that facilitate first-class conference experiences both in-person and remotely</li>\n<li>Experiment with new technologies and share discoveries with the team</li>\n<li>Foster growth and support other engineers through constructive, collaborative code reviews</li>\n<li>Clearly communicate technical constraints and opportunities with stakeholders</li>\n<li>Willingness to contribute however possible to ensure overall effectiveness of position</li>\n<li>Other duties and special projects as may be assigned from time to time</li>\n<li>Travel: Upon request / as needed</li>\n</ul>\n<p><strong>BENEFITS</strong></p>\n<ul>\n<li>Full health benefits (medical, dental, vision) 100% paid by TED for employees</li>\n<li>Paid family leave</li>\n<li>Work-life balance encouraged (TED closes for a 2-week summer break and 1-week winter break plus you're eligible for additional paid time off)</li>\n<li>Free OneMedical and SpringHealth membership for you and your dependents to address physical and mental well-being</li>\n<li>401k with match</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://tedconferencesllc.applytojob.com/apply/sN9G1uTqYX/Software-Engineer-React-Native\">https://tedconferencesllc.applytojob.com/apply/sN9G1uTqYX/Software-Engineer-React-Native</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d8ca02cf387708b76c65ad372bc79523ecad20a1/logo.png"
    },
    {
      "id": "18ff1ba5-a5cf-4927-becc-f41f61939832",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/18ff1ba5-a5cf-4927-becc-f41f61939832",
      "created_at": "Mon Mar 15 21:00:49 UTC 2021",
      "company": "ChainSafe Systems ",
      "company_url": "http:",
      "location": "Remote and/or Toronto",
      "title": "Rust, Golang, Typescript, Solidity Devs",
      "description": "<p>ChainSafe Systems is currently seeking <strong>Rust, Golang, Typescript, and Solidity Developers</strong> to join our Engineering team.</p>\n<p>ChainSafe Systems is a blockchain R&amp;D firm on a mission to realize the potential of Web3 infrastructure through sustainable, open-source development. Our vision is to create a world with organizations that empower people to build and innovate through blockchain agnostic tools and other distributed technologies.</p>\n<p>We are global leaders in the industry, unique in our work across multiple blockchain ecosystems, and currently are pioneering Ethereum, Ethereum Classic, Cosmos, Polkadot and Filecoin technology. We are actively pursuing the development of our own product suite, having recently released <a href=\"https://files.chainsafe.io/\">Files</a>, which allows users to upload and store files on IPFS and Filecoin with the goal of furthering development to provide a decentralized alternative to cloud storage.</p>\n<p>ChainSafe is a unique company in a unique space, growing quickly and building a global reputation in this nascent space. Beyond offering experience across every major blockchain space to our team, we provide an open, inclusive, and supportive environment where we help folks reach their full potential as a human and as a professional.</p>\n<p><strong>Here’s what you might want to know before reading on:</strong></p>\n<ul>\n<li>Our stack is progressive and open-source and includes Go, Rust, and TypeScript.</li>\n<li>We spearhead ecosystem projects like Lodestar, Web3.js, Forest, Gossamer and Ethermint.</li>\n<li>We are global, remote-friendly, and open to contractors (who can commit to a minimum of 35 hours a week). For those local to Toronto, our casual, open-concept office in Chinatown has meeting rooms, lounge areas, and space to pull up a chair.</li>\n</ul>\n<p>Culture fit and alignment to our core values are extremely important to us. We are fueled by an immense intellectual curiosity of what technology can do and the impact it can have. You will thrive here if you are intensely driven by tackling technical challenges that no one else has solved yet and are inspired by the possibility of building the next generation of web infrastructure and decentralized systems.</p>\n<p><strong>Why join us</strong></p>\n<p>Founded by Developers for Developers, we foster an Agile environment where tasks are assigned based not just on what you know but what you want to learn. We offer fast opportunities for personal growth, mentorship, professional development funding, tons of autonomy and responsibility, a results-driven environment, close collaboration with an international team, exposure to a wide array of ecosystems and trailblazing technologies, and flexible work hours.</p>\n<p>At ChainSafe, we are a compassionate group of builders and makers, working to bring our ideas to life. You’ll be part of a team that believes in the vital importance of community and contributing to advance humanity with open-source and decentralized technology.</p>\n<p><strong><a href=\"https://chainsafe.io/corevalues\">We care deeply about our values and look for these in every team member:</a></strong> A dedication to self-improvement and professional development; a commitment to community and collaboration; a drive for accountability, diligence, and autonomy; and above fostering a place of acceptance, friendliness, and compassion.</p>\n<p><strong>Tell us who you are and learn more about us</strong></p>\n<p>If you are ready to join us, assemble your highlights (GitHub, portfolio, LinkedIn) and show us your best work. Get ready to have incredible conversations with passionate developers like yourself. For our team’s project highlights, explore our <a href=\"https://discord.com/invite/xSAwrnCWcg\">Discord</a>, <a href=\"https://github.com/chainsafe\">GitHub</a>, and <a href=\"https://chainsafe.io/projects\">website</a>.</p>\n<p><strong>We welcome your fresh perspectives and ideas</strong></p>\n<p>At ChainSafe, diversity and inclusion is more than a statement; equality and accessibility are guiding principles embedded in who we are - and why we do what we do. Our leadership is committed to continuously improving their own level of education to make the fairest and inclusive hiring and performance decisions from an informed perspective. We recognize the benefits of a diverse team and aspire to embed respect for all people into our culture, values, and day-to-day practices.</p>\n<p><strong>Sound like a good fit for you? Please apply at <a href=\"mailto:careers@chainsafe.io\">careers@chainsafe.io</a></strong></p>\n",
      "how_to_apply": "<p><a href=\"mailto:careers@chainsafe.io\">careers@chainsafe.io</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f322d792bfbec63e02cbdb5d4c97c5beac5c3cdb/ChainSafe_Logo.png"
    },
    {
      "id": "c59fc233-c026-4243-90df-f846aad5802f",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/c59fc233-c026-4243-90df-f846aad5802f",
      "created_at": "Mon Mar 15 20:59:25 UTC 2021",
      "company": "TED Conferences",
      "company_url": "http://ted.com",
      "location": "Remote",
      "title": "Senior Software Engineer - JavaScript",
      "description": "<p><strong>POSITION OVERVIEW</strong></p>\n<p>TED creates, produces and distributes audio and video media (most famously TED Talks) to millions of people around the world. As a Senior Software Engineer, you will be responsible for the development of backend systems which deliver TED content to millions of people worldwide. You will collaborate with developers and product owners to take new features and products from conception to production.</p>\n<p><strong>QUALIFICATIONS / SKILLS</strong></p>\n<ul>\n<li>5+ years of professional experience in software development.</li>\n<li>Expert-level knowledge of:\nJavaScript /TypeScript in NodeJS\nMySQL and RDS technologies\nDistributed system design and architecture\nAWS infrastructure</li>\n<li>Proficiency with:\nGraphQL API design and development\nHTML, CSS and other web front-end technologies.\nGit and version control best practices\nUnix command line\nDocker</li>\n<li>It’s a plus to have experience with:\nEmail delivery systems and deliverability\nJob queues and worker processes\nReact\nNext.js\nApollo Server\nRuby on Rails</li>\n<li>An insatiable curiosity for technology and software development.</li>\n<li>Absolutely must be a self-starter whose default mode is action and persistence.</li>\n<li>Proactive, positive communication and a team-first attitude are paramount.</li>\n<li>Must be a ferocious debugger who is unfazed by complex toolchains, immature SDKs and emerging technologies.</li>\n<li>Values cross-functional collaboration</li>\n<li>Values a diverse workplace</li>\n</ul>\n<p><strong>RESPONSIBILITIES</strong></p>\n<ul>\n<li>Develop web services that drive user engagement across TED’s ecosystem.</li>\n<li>Architect software using well-established design patterns and best practices.</li>\n<li>Experiment with new technologies and share discoveries with the team</li>\n<li>Foster growth and support other engineers through constructive, collaborative code reviews</li>\n<li>Clearly communicate technical constraints and opportunities with stakeholders</li>\n<li>Willingness to contribute however possible to ensure overall effectiveness of position</li>\n<li>Other duties and special projects as may be assigned from time to time</li>\n<li>Travel: Upon request / as needed</li>\n</ul>\n<p><strong>BENEFITS</strong></p>\n<ul>\n<li>Full health benefits (medical, dental, vision) 100% paid by TED for employees</li>\n<li>Paid family leave</li>\n<li>Work-life balance encouraged (TED closes for a 2-week summer break and 1-week winter break plus you're eligible for additional paid time off)</li>\n<li>Free OneMedical and SpringHealth membership for you and your dependents to address physical and mental well-being</li>\n<li>401k with match</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://tedconferencesllc.applytojob.com/apply/w8GLBhtxG5/Senior-Software-Engineer-JavaScript\">https://tedconferencesllc.applytojob.com/apply/w8GLBhtxG5/Senior-Software-Engineer-JavaScript</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVNjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0a6ea360411699cfe597085b3f260bccaa402e98/logo.png"
    },
    {
      "id": "44e9f9b8-61bb-4db7-b551-7fa8a5e56a1a",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/44e9f9b8-61bb-4db7-b551-7fa8a5e56a1a",
      "created_at": "Mon Mar 15 20:56:56 UTC 2021",
      "company": "TED Conferences",
      "company_url": "http://ted.com",
      "location": "Remote",
      "title": "Senior Software Engineer - Mobile",
      "description": "<p><strong>POSITION OVERVIEW</strong></p>\n<p>TED creates, produces and distributes audio and video media (most famously TED Talks) to millions of people around the world. As a Senior Software Engineer, you will be responsible for the development of mobile apps and their accompanying backend systems which deliver TED content to a diverse landscape of people using myriad devices. You will work directly with designers, developers and product owners to take new features and products from conception to production.</p>\n<p><strong>QUALIFICATIONS / SKILLS</strong></p>\n<ul>\n<li>4+ years of professional experience in software development.</li>\n<li>Expert-level knowledge of Javascript in both frontend and backend applications.</li>\n<li>Strong knowledge of HTML, CSS and other web front-end technologies.</li>\n<li>Experience with React, Ruby on Rails, MySQL, git, version control best practices, and the Unix command line.</li>\n<li>It’s a plus to have experience with React Native, native iOS and Android development, AWS and/or Firebase, and video streaming technologies</li>\n<li>An insatiable curiosity for technology, software and IoT.</li>\n<li>Must be a self-starter who will stop at nothing to clear blockers and ship products.</li>\n<li>Must be a ferocious debugger who is unfazed by complex toolchains, immature SDKs and emerging technologies.</li>\n<li>Values cross-functional collaboration</li>\n<li>Values a diverse workplace</li>\n</ul>\n<p><strong>RESPONSIBILITIES</strong></p>\n<ul>\n<li>Develop the apps that stream TED’s media to millions of users</li>\n<li>Develop conference technology apps that facilitate first-class conference experiences both in-person and remotely</li>\n<li>Develop and maintain the backend systems that support the apps, with an eye towards performance and scale.</li>\n<li>Experiment with new technologies and share discoveries with the team</li>\n<li>Foster growth and support other engineers through constructive, collaborative code reviews</li>\n<li>Clearly communicate technical constraints and opportunities with stakeholders</li>\n<li>Willingness to contribute however possible to ensure overall effectiveness of position</li>\n<li>Other duties and special projects as may be assigned from time to time</li>\n<li>Travel: Upon request / as needed</li>\n</ul>\n<p><strong>BENEFITS</strong></p>\n<ul>\n<li>Full health benefits (medical, dental, vision) 100% paid by TED for employees</li>\n<li>Paid family leave</li>\n<li>Work-life balance encouraged (TED closes for a 2-week summer break and 1-week winter break plus you're eligible for additional paid time off)</li>\n<li>Free OneMedical and SpringHealth membership for you and your dependents to address physical and mental well-being</li>\n<li>401k with match</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://tedconferencesllc.applytojob.com/apply/OBE9Tvozdc/Senior-Software-Engineer-Mobile\">https://tedconferencesllc.applytojob.com/apply/OBE9Tvozdc/Senior-Software-Engineer-Mobile</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fe5d88b7c955266687c596b859d60c5872682ff5/logo.png"
    },
    {
      "id": "7f4cae42-e5fd-4a43-8834-5c6da3b7b964",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/7f4cae42-e5fd-4a43-8834-5c6da3b7b964",
      "created_at": "Mon Mar 15 19:00:42 UTC 2021",
      "company": "Tower",
      "company_url": "https://www.git-tower.com",
      "location": "Remote",
      "title": "Content Marketing Developer",
      "description": "<p>We're looking for a <strong>Content Marketing Developer</strong> to join our team. You’ll have the chance to work in many different areas, on websites that are viewed by hundreds of thousands of developers and designers every month.</p>\n<ul>\n<li>\n<p><strong>Learning Content:</strong> We love to learn new things. That's why we love to help our users and community learn new things, too. Our <a href=\"https://www.git-tower.com/learn/\">learning content</a> on Git and lots of other development topics is read by over half a million people every month. This allows you to learn lots of new things - and teach them to our community at the same time! The content you produce can take many forms (blog + guest posts, tutorials, videos, webinars…) and be about any topic that’s interesting for our community.</p>\n</li>\n<li>\n<p><strong>Growth Marketing:</strong> Besides creating new content, we also work hard to make our existing content more successful: email automations, SEO, A/B tests, performance improvements, professional popup campaigns, and countless little improvements help us optimize our projects and content all the time.</p>\n</li>\n<li>\n<p><strong>Tech &amp; Tools:</strong> We’re using a broad, modern collection of tools for our marketing: you’ll find Google Analytics, ActiveCampaign, Ahrefs, OptinMonster, and many more in your tool belt.</p>\n</li>\n<li>\n<p><strong>Website Development:</strong> We have a multitude of cool web projects that evolve quickly: the <a href=\"https://www.git-tower.com/\">Tower website</a> and <a href=\"https://www.git-tower.com/blog\">blog</a>, our <a href=\"https://www.git-tower.com/learn\">learning platform</a>, the <a href=\"https://www.git-tower.com/help\">Tower online help</a>, and <a href=\"https://www.git-tower.com/blog/history-of-macos/\">many</a> <a href=\"https://www.git-tower.com/blog/tech-animals/\">special</a> <a href=\"https://www.git-tower.com/blog/developer-manifesto/\">projects</a>. You'll work with static-site generators and lots of modern Sass / CSS, Javascript, and Ruby.</p>\n</li>\n</ul>\n<h1><strong>Skills &amp; Requirements</strong></h1>\n<ul>\n<li>3+ years experience in web development</li>\n<li>Fluent in English</li>\n<li>Advanced knowledge of Git and version control</li>\n<li>Experience with HTML5, CSS / Sass, JavaScript</li>\n<li>Experience with at least one programming language (PHP, Ruby, Go, JavaScript, Swift…)</li>\n<li>You are a good and mindful communicator</li>\n<li>You are open to learn our toolchain (e.g. GitHub, Heroku, Zendesk, ActiveCampaign, Postmark and their APIs)</li>\n</ul>\n<h1><strong>You</strong></h1>\n<ul>\n<li>very reliable &amp; thorough: you accept responsibility for your own work and its quality</li>\n<li>hungry to be part of a team that creates things that matter</li>\n<li>self-motivated and capable of working remotely</li>\n<li>open to discussions and a mindful communicator</li>\n<li>willing to be part of a team &amp; yet able to work independently</li>\n<li>paying attention to detail</li>\n<li>open-minded and respectful – regarding people, technologies and projects</li>\n<li>happy to become part of a small, international team of friendly &amp; skilled professionals</li>\n</ul>\n<h1><strong>About us</strong></h1>\n<p>Learn more <a href=\"https://www.git-tower.com/company/jobs/\">about us</a> and <a href=\"https://www.git-tower.com/blog/how-we-work/\">how we work</a>. We'are looking forward to hearing from you!</p>\n",
      "how_to_apply": "<p>Please apply via <a href=\"https://www.git-tower.com/company/jobs\">https://www.git-tower.com/company/jobs</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcG1jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b0349c87f00cba7490638e045dc431aaf612ea28/tower-dock-icon_transparent@2x.png"
    },
    {
      "id": "9226d83b-e35c-4dc8-abf3-44bdd1934904",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9226d83b-e35c-4dc8-abf3-44bdd1934904",
      "created_at": "Mon Mar 15 18:50:55 UTC 2021",
      "company": "Senorics GmbH",
      "company_url": "http://www.senorics.com",
      "location": "Dresden ",
      "title": "(Senior) Software Engineer",
      "description": "<p>Senorics is a start-up from Dresden, Germany, founded in 2017. Our vision is to make NIR spectroscopy an integral part of daily life, accessible for everyone. This is only possible with our team, consisting of a steadily growing number of people, all experts in their field.</p>\n<p>In order to help our customers worldwide to use our sensor devices to their full potential, we are hiring experienced software developers for different fields. You get the opportunity to become a part of our highly motivated and experienced startup-team. We provide a vibrant atmosphere and the perfect conditions to develop yourself and your career.</p>\n<p>The Tasks</p>\n<ul>\n<li>Developing AWS based backends for our end-customer software applications</li>\n<li>Developing SpringBoot based middleware for internal data processing</li>\n<li>Developing cross-platform frontends for our end-customers for mobile and desktop applications</li>\n</ul>\n<p>Your Profile</p>\n<ul>\n<li>B.Sc. in Computer Science, Natural Science, Engineering or equivalent experience</li>\n<li>At least 3+ years of experience in software engineering</li>\n<li>Hands-on experience with Java Script, respectively AWS</li>\n<li>Experience in agile practices and software development tools</li>\n<li>Fluent English, working knowledge of software development practices and technologies</li>\n<li>Strong verbal and written communications skills</li>\n<li>Team player</li>\n</ul>\n<p>What We Offer: Exciting insights into our technology, flat hierarchies, self-reliant work with flexible working hours and mobile working, steep learning curves as well as fun and start-up atmosphere.</p>\n",
      "how_to_apply": "<p>Please view and apply via jobs.senorics.com</p>\n<p>Send us your CV and give us your motivation, thanks!</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFdjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--41d0aadaf0492d8904c99220dd5c9b0026dfb8a5/senorics_long_RGB.jpg"
    },
    {
      "id": "6d3ce9dc-864f-4a00-8a08-d1dee72d6ece",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6d3ce9dc-864f-4a00-8a08-d1dee72d6ece",
      "created_at": "Mon Mar 15 17:29:00 UTC 2021",
      "company": "Marketcircle",
      "company_url": "https://www.marketcircle.com/",
      "location": "US - Remote",
      "title": "Senior Software Developer (Apple Platforms)",
      "description": "<p>Want to work remotely? Want to make an impact by working for a small company that values autonomy and working collaboratively in a team to solve challenging problems? Love learning new technology? Then you'll fit right into the Marketcircle Team!</p>\n<p>We are looking for someone who excels at software design, execution, coaching others for the development of our Daylite apps. As part of this role you will be a key individual contributor to building Daylite for macOS and iOS.</p>\n<p>To ensure success as a Senior Software Developer for Apple Platforms, you should have an extensive track record of shipping apps for macOS and/or iOS and have experience working with AppKit and UIKit, Objective-C and Swift. Bonus points for experience with SwiftUI.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>\n<p>Software design and development of new functionality in Daylite for macOS and iOS</p>\n</li>\n<li>\n<p>Maintaining and improving the software quality of Daylite</p>\n</li>\n<li>\n<p>Writing and maintaining reliable Objective-C and Swift code</p>\n</li>\n<li>\n<p>Supporting and coaching up developers</p>\n</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>\n<p>Have 8+ years of development experience</p>\n</li>\n<li>\n<p>Extensive experience building macOS and/or iOS apps</p>\n</li>\n<li>\n<p>Bachelor’s degree in Computer Science, Computer Engineering or related field</p>\n</li>\n<li>\n<p>Proficiency with code versioning tools: Git, GitHub</p>\n</li>\n<li>\n<p>Familiarity with MVC, declarative programming, relational databases, REST APIs, and testing tools</p>\n</li>\n<li>\n<p>Are comfortable working remotely (100% remote work environment, but located within Canada or US) as well as being comfortable working both independently and collaboratively</p>\n</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://jobs.lever.co/marketcircle/3e5f06e0-2cb3-4bf9-829b-b08b4da032ee\">https://jobs.lever.co/marketcircle/3e5f06e0-2cb3-4bf9-829b-b08b4da032ee</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcE9jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c0e1437a7f2d48f861df7a78ce98f9a85d3e1e2e/MarketcircleLogotypeBlack.png"
    },
    {
      "id": "6df201fb-57e7-4a53-9a35-6878ac8d5522",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6df201fb-57e7-4a53-9a35-6878ac8d5522",
      "created_at": "Mon Mar 15 17:26:37 UTC 2021",
      "company": "Per Angusta",
      "company_url": "http://http",
      "location": "Villeurbanne, France - Remote possible",
      "title": " Senior Ruby on Rails Developer",
      "description": "<p>About Per Angusta</p>\n<p>We are developing two SaaS solutions, one dedicated to Procurement Performance Management and the other intended to support procurement strategies for large and international companies. The solution already has 11,000 users in more than 100 countries.</p>\n<p>Our team is composed of 22 people based in France, USA, UK, and Germany. Working remotely is not a problem at Per Angusta.</p>\n<p>Our company is constantly taking on new challenges and our latest fund-raising efforts have allowed us to accelerate our international growth, achieve our ambitious objectives, and maintain the satisfaction of our users.</p>\n<p>We plan to double our workforce this year! We need builders and seniors’ profiles.</p>\n<p>Job Description</p>\n<p>Our technical team\nWe are an enthusiastic team with 10 passionate engineers, composed of one Product Owner, one Front-end / UX, six full- stack developers, and two back-end developers. We plan to double that number.</p>\n<p>Our technical challenges are:</p>\n<p>We are currently undergoing in a certification process which has an impact on technical requirements, such as structure and security protocols.  \nInternational growth impacts our daily work and sales approach as we work to accommodate global needs and standards. \nWe have a fast-growing team with the need to constantly develop and upgrade our skills, and be flexible to meet new and varying challenges.  \nFind more information on our approaches, methods and technical stack : <a href=\"https://www.per-angusta.com/en/our-engineering-team/\">https://www.per-angusta.com/en/our-engineering-team/</a></p>\n<p>Your mission</p>\n<p>The Lead ROR Developer reports directly to the CTO and has a high level of autonomy. You are the driving force behind developments and technical choices.</p>\n<p>You share skills and knowledge with other developers, lead them to engage in thoughtful action, and review their code using best practices and pedagogy. You continue to develop our best practices, documentation, tools, and provide an encouraging environment to support our juniors to progress and become our future seniors.</p>\n<p>You should be able to find vulnerabilities in code you don’t own and able to make effective decisions about managing technical debt when relevant.</p>\n<p>A Lead ROR Developer makes sure the test suite is green and its coverage is maintained, all while deploying daily in all environments from staging to production.</p>\n<p>You are responsible for individual efficiency. You should feel comfortable with fast developments, such as proofs of concept, but also support the development of final products to quickly create value and support the efforts of sales</p>\n<p>You will work hand in hand with our PO to develop new features, new projects and enforce our project management tools and methods.</p>\n<p>Preferred Experience</p>\n<p>Your skills\nLead ROR Developers will share our four4 values:</p>\n<ul>\n<li>Be bold in technical solutions and innovation.,  </li>\n<li>Be passionate about our company and the work we do.,  </li>\n<li>Be an authentic contributor.  </li>\n<li>Be a team player.</li>\n</ul>\n<p>We don’t focus on educational background., We are seeking enthusiastic people with technical savvy and a creative approach solving problems.</p>\n<p>This position requires strong experience in Ruby on Rails development with specific application in a SaaS software company.</p>\n<p>The following describes a lead ROR Developer:</p>\n<ul>\n<li>Programing a high quality of code is important to you.  </li>\n<li>You are involved in the Ruby on Rails community.  </li>\n<li>You like sharing knowledge and are actively working to expand your knowledge every day.  </li>\n<li>You enjoy writing public blog posts with the support of the tech team to demonstrate your commitment, expertise, and to share your experiences.  </li>\n</ul>\n<p>Some of our developers also teach in schools or speak at conferences to share what they have learned. We encourage all team members to do the same.</p>\n<p>*Life is made of opportunity *\nDo you feel like your profile doesn’t match this description, but you suspect we could make things great together? Send us an application anyway!</p>\n<p>Our interview process</p>\n<ul>\n<li>First Call with talent acquisition to precise your wishes, RH stuff and have a short team presentation</li>\n<li>First interview with member of the technical team to learn about the team and discover if we align in our expectations of work and company culture.</li>\n<li>Second interview with our Head of Technology to discuss technical constraints in further detail, the vision of our company, and your role on the team.</li>\n<li>Finally, you’ll have the opportunity to speak with our CEO, Pierre Lapree, and talk about Per Angusta’s global strategy.\nThis process can potentially be done quickly, within 1-2 weeks, depending on availability. We are efficient when possible, but we don't rush. Every proposal is thoughtful!</li>\n</ul>\n<p>Additional Information\nContract Type: Full-Time\nStart Date: 02 May 2021\nLocation: Villeurbanne, France (69100)\nExperience: &gt; 5 years\nPossible full remote</p>\n",
      "how_to_apply": "<p>Just send an email to <a href=\"mailto:charlotte.bennetot@per-angusta.com\">charlotte.bennetot@per-angusta.com</a>!</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEdjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6f5cf4029518004fd0f38b0682c70a95b285ab5c/Per%20Angusta%20logo.jpg"
    },
    {
      "id": "2bbd8791-4e73-42b8-a311-ae726c942c75",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/2bbd8791-4e73-42b8-a311-ae726c942c75",
      "created_at": "Mon Mar 15 17:25:59 UTC 2021",
      "company": "Marketcircle",
      "company_url": "https://www.marketcircle.com/",
      "location": "US- Remote",
      "title": "Sr. Backend Developer",
      "description": "<p>Want to work remotely? Want to make an impact by working for a small company that values autonomy and working collaboratively in a team to solve challenging problems? Love learning new technology? Then you'll fit right into the Marketcircle Team!</p>\n<p>Marketcircle is looking for some Sr. Backend Software Developers. Join as a key member of our team responsible for building and supporting the services and infrastructure for the Daylite CRM Platform.</p>\n<p><strong>Qualified candidates:</strong></p>\n<ul>\n<li>\n<p>Have 8+ years of experience</p>\n</li>\n<li>\n<p>Hold a B.Sc Computer Science or B.Eng Software, or equivalent work experience.</p>\n</li>\n<li>\n<p>Experienced using Postgres, Rails (Ruby), Django (Python), Kubernetes, nginx, Redis, Kafka,</p>\n</li>\n<li>\n<p>HashiCorp Suite, Graylog, Sinatra, Prometheus, istio, grafana, CalDAV &amp; CardDav, AWS, and Elasticsearch</p>\n</li>\n<li>\n<p>Are comfortable working remotely (100% remote work environment) as well as being comfortable working both independently and collaboratively.</p>\n</li>\n</ul>\n<p><strong>Bonus points for:</strong></p>\n<ul>\n<li>\n<p>Experience with infrastructure management tools (like Puppet, Ansible or Chef)</p>\n</li>\n<li>\n<p>Experience with cloud infrastructure providers (like AWS, Google Cloud, Microsoft Azure or DigitalOcean)</p>\n</li>\n<li>\n<p>Knowing your way around the network stack, from HTTP to TCP to IP and have a solid understanding\nof security (TLS/ IPSec/Firewalls)</p>\n</li>\n</ul>\n<p><strong>Things you might be working on:</strong></p>\n<ul>\n<li>\n<p>RESTful interfaces to persist data for our client apps</p>\n</li>\n<li>\n<p>Authentication and payment backends</p>\n</li>\n<li>\n<p>PostgreSQL database(s) with custom extensions</p>\n</li>\n<li>\n<p>Elasticsearch indexing and search</p>\n</li>\n</ul>\n<p>Note: there will be occasional on-call duties.</p>\n<p>Marketcircle Inc. is a fun and distributed tech company. We believe in the power of Kaizen, teamwork, creativity, ownership, and empathy. By embodying these core values we know we impact the lives of our customers, and each other.</p>\n<p>Our mission is to empower small business worldwide which drives us to develop a native macOS and iOS app that helps thousands create organization of what would otherwise be chaos.</p>\n",
      "how_to_apply": "<p><a href=\"https://jobs.lever.co/marketcircle/42848e2d-cb30-46cf-96d6-0a8c0e0a21ff\">https://jobs.lever.co/marketcircle/42848e2d-cb30-46cf-96d6-0a8c0e0a21ff</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbytjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--879a1c862a3d5e3b76a1fae145451b9bd2f1b4d7/MarketcircleLogotypeBlack.png"
    },
    {
      "id": "b65fa76e-c33c-4bee-abd1-701c0b357ad2",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/b65fa76e-c33c-4bee-abd1-701c0b357ad2",
      "created_at": "Mon Mar 15 15:35:17 UTC 2021",
      "company": "ownCloud GmbH",
      "company_url": "https://www.owncloud.com",
      "location": "Nuremberg, Remote",
      "title": "Android Software Developer",
      "description": "<p>ownCloud is an open-source file sharing software designed and built to give businesses and individuals control over their data and sovereign workspaces. With a team of more than 70 people, we develop the ownCloud server, the sync clients, our mobile apps and the web interface to enable secure and effective file collaboration across companies, organizations, administrations, institutions and families. We also implement customized solutions for enterprises and directly manage and maintain ownCloud instances. With over 100 million users worldwide, ownCloud is the market-leading open-source software for content collaboration.</p>\n<p>As an Android developer with the ownCloud Engineering team, you will help build and improve our open-source enterprise-grade mobile applications. The ownCloud mobile apps for Android and iOS are an increasingly important part of the ownCloud experience – a sovereign file platform that makes it easy and secure for users to access, manage and share their data.</p>\n<h2>Your responsibilities</h2>\n<ul>\n<li>You develop and improve an existing premium app for the Android mobile platform that enables users to store, sync and share their data. You design and implement of new features. You extend and debug the existing open source code base of the ownCloud Android App.</li>\n<li>You will be working in a group with other Android developers and in a larger team of other engineers that work on the iOS App and the Desktop Client. Together with the other engineering teams, your team ensures that ownCloud delivers a consitent and helpful experience to out more than 100 million users around the world.</li>\n<li>Your development workflow will be based on git, review processes and continuous integration.</li>\n<li>You will act as an open source player that shows an open, cooperative and responsive attitude to internal, external and enterprise communities.</li>\n<li>You will participate in the release process and carry out code maintenance.</li>\n</ul>\n<h2>Your core competencies</h2>\n<ul>\n<li>You have a degree in engineering or computer science, or any other IT related education, and ideally three years of work experience.</li>\n<li>You have actively programmed Android mobile apps for more than one year.</li>\n<li>You are well-versed in Android-specific functions for security, performance and enterprise use, for example Android for Work, MDM/EMM configuration (Appconfig.org), Scoped Storage and other enterprise-relevant features of the Android platform.</li>\n<li>You love to learn about new Android features and watch Android Dev space closely.</li>\n<li>You enjoy proposing your design ideas for architecture and GUI to the team.</li>\n<li>You take the responsiblity for parts of the software stack.</li>\n<li>You like to work in teams and are comfortable with modern workflows.</li>\n<li>Your written and spoken English allows for effective communication.</li>\n<li>Being an experienced open source contributor is a big plus</li>\n</ul>\n<h2>Culture of work</h2>\n<ul>\n<li>As a remote-equal comany with distributed teams, we believe that not everyone’s most productive workspace is the office. You can work remotely. If you prefer to work in an office, we maintain ours in Nuremberg, Bavaria</li>\n<li>We are hackers, coders and nerds. We have a contagious passion and inner enthusiasm for our work and our role</li>\n<li>We are constantly on the hunt for new solutions, unexpected connections and unforeseen possibilities. We are open to new experiences, explore new ideas and uncover even the last hack and trick along the way</li>\n<li>We believe that we are only as good as our next project. We encourage a culture of flat hierarchies, with great opportunities to move things forward. We build on flexibility and a sense of openness to change</li>\n<li>Being part of the ownCloud team is like joining a tribe. Meet us occasionally after work for a burger or billards. Or, in the current environment, a socially distanced beer in BigBlueButton</li>\n<li>ownCloud is open-source and community driven. It’s the people who make this place to what it is. Join our quest to give businesses and individuals control over their data!</li>\n</ul>\n<p>We are looking forward to getting to know you! Send your resume to <a href=\"mailto:work@owncloud.com\">work@owncloud.com</a>, and tell us why you’d like to work for ownCloud.</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:work@owncloud.com\">work@owncloud.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3VjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dea9bb71b193b0bae307b7668245d665f41b9007/owncloud_logo-420.png"
    },
    {
      "id": "8be02cee-e2f8-4821-8870-c74c521ff675",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/8be02cee-e2f8-4821-8870-c74c521ff675",
      "created_at": "Mon Mar 15 15:28:05 UTC 2021",
      "company": "ownCloud GmbH",
      "company_url": "https://www.owncloud.com",
      "location": "Nuremberg, Remote",
      "title": "Desktop Software Developer C++/Qt",
      "description": "<p>ownCloud is an open-source file sharing software designed and built to give businesses and individuals control over their data. With a team of more than 70 people, we develop the ownCloud server, the sync clients, our mobile apps and the web interface to enable secure and effective file collaboration across companies, organizations, administrations, institutions and families. We also implement customized solutions for enterprises and directly manage and maintain ownCloud instances. With over 100 million users worldwide, ownCloud is the market-leading open-source software for content collaboration.</p>\n<p>As a C++ developer with the ownCloud Engineering team, you will help build and improve our open-source enterprise-grade file synchronization software. The ownCloud Desktop Client is cross-platform open source software for Windows, macOS and Linux, using the Qt class library extensively.</p>\n<p>To make best use of the features specific to the operating systems, we are also using native APIs where needed, for example for file access or virtual files.</p>\n<h2>Your responsibilities</h2>\n<ul>\n<li>You design and review new approaches to building a great ownCloud experience on all relevant desktop systems.</li>\n<li>You code new features, improve existing ones and fix bugs.</li>\n<li>You support the testing strategy by implementing tests on various levels.</li>\n<li>You set up test environments to analyze complex http based protocol flows.</li>\n<li>You collaborate with other client developers, ie. for mobile apps, to find consistent solutions.</li>\n<li>You embrace our git-based development workflow and help review software.</li>\n<li>You participate in the software lifecycle with testing, releasing and maintaining.</li>\n</ul>\n<h2>Your core competencies</h2>\n<ul>\n<li>You have a degree in engineering or computer science, or any other IT related education, and ideally three years of work experience.</li>\n<li>You have actively developed with C, C++ 11 or higher and ideally Qt.</li>\n<li>You have worked in teams that provide production-grade software.</li>\n<li>You bring a cross-platform mindset.</li>\n<li>You are familiar with the Windows C++ API.</li>\n<li>You like to work in teams and are comfortable with modern workflows.</li>\n<li>Your written and spoken English allows for effective communication.</li>\n<li>Being an experienced open source contributor is a big plus</li>\n</ul>\n<h2>Culture of work</h2>\n<ul>\n<li>As a remote-equal company with distributed teams, we believe that not everyone’s most productive workspace is the office. You can work remotely. If you prefer to work in an office, we maintain ours in Nuremberg, Bavaria</li>\n<li>We are hackers, coders and nerds. We have a contagious passion and inner enthusiasm for our work and our role</li>\n<li>We are constantly on the hunt for new solutions, unexpected connections and unforeseen possibilities. We are open to new experiences, explore new ideas and uncover even the last hack and trick along the way</li>\n<li>We believe that we are only as good as our next project. We encourage a culture of flat hierarchies, with great opportunities to move things forward. We build on flexibility and a sense of openness to change</li>\n<li>Being part of the ownCloud team is like joining a tribe. Meet us occasionally after work for a burger or billards. Or, in the current environment, a socially distanced beer in BigBlueButton</li>\n<li>ownCloud is open-source and community driven. It’s the people who make this place to what it is. Join our quest to give businesses and individuals control over their data!</li>\n</ul>\n<p>We are looking forward to getting to know you! Send your resume to <a href=\"mailto:work@owncloud.com\">work@owncloud.com</a>, and tell us why you’d like to work for ownCloud.</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:work@owncloud.com\">work@owncloud.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb21jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d828436d6899efa166a94a30f364e6f4c10d3bc9/owncloud_logo-420.png"
    },
    {
      "id": "40b87bde-8e89-4f7a-bafb-b93133c062ac",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/40b87bde-8e89-4f7a-bafb-b93133c062ac",
      "created_at": "Mon Mar 15 09:26:01 UTC 2021",
      "company": "Consorsbank",
      "company_url": "https://vonq.io/30EaD18",
      "location": "Nürnberg",
      "title": "Mobile Developer iOS (w/m/d)",
      "description": "<p><strong>Für unseren Standort Nürnberg in Voll- oder Teilzeit</strong></p>\n<p>Gestalten Sie mit uns das Banking von Morgen! Denn wir bieten nicht nur modernes Online-Banking, sondern erleichtern mit selbst entwickelten Innovationen den Alltag unserer Kunden. Dabei hören wir zu und lassen die Kunden aktiv ihre Meinungen und Ideen beisteuern. Gestalten auch Sie mit – werden Sie Teil der Consorsbank und des starken Netzwerks von BNP Paribas.</p>\n<p><strong>Ihre Aufgaben:</strong></p>\n<ul>\n<li>Sie sind für die Implementierung unserer mobilen iOS App einschließlich deren Livenahme verantwortlich</li>\n<li>Sie arbeiten aktiv an Konzeption und Lösungsdesign innerhalb Ihres Entwicklungsteams mit</li>\n<li>Sie übernehmen die Pflege und Wartung unserer Bestandssysteme und unterstützen die Produktexperten und den Betrieb mit Ihrem Knowhow</li>\n<li>Sie sind mitverantwortlich für die Einhaltung von Architekturrichtlinien und Code-Qualität in diesem Bereich</li>\n<li>Sie tragen zur stetigen Qualitätsverbesserung mittels Testautomatisierung und der Umsetzung von Optimierungspotenzialen bei</li>\n<li>Sie übernehmen diese Aufgaben in einem agilen Softwareentwicklungsprozess, der sowohl selbständige Arbeitsweise als auch produktive Teamarbeit beinhaltet. Dabei haben Sie immer den Kunden und seine Bedürfnisse im Fokus</li>\n</ul>\n<p><strong>Ihr Profil:</strong></p>\n<ul>\n<li>Hochschulabschluss im Bereich IT oder vergleichbare Ausbildung mit langjähriger Erfahrung im Bereich der nativen iOS-Entwicklung</li>\n<li>Sie haben fundierte Kenntnisse in Swift, Objective C und sind vertraut mit Architektur-Patterns wie z.B. MVP/MVVM/VIPER</li>\n<li>Erfahrungen mit Core Data und SwiftUI wären von Vorteil</li>\n<li>Sie haben Kenntnisse in Webservices, REST, JSON, HTML</li>\n<li>CI / CD Pipelines und Reactive Programming sind kein Fremdwort für Sie</li>\n<li>Erfahrung in der Entwicklung von betriebswirtschaftlichen Anwendungen sind wünschenswert, wenn möglich im Banken- /Finanzumfeld</li>\n<li>Kreativität, Team- und Kommunikationsfähigkeit sowie Qualitätsbewusstsein</li>\n<li>Gute Deutschkenntnisse in Wort und Schrift</li>\n</ul>\n<p><strong>Was wir Ihnen bieten:</strong></p>\n<ul>\n<li>Ein hervorragendes Betriebsklima, kompetente Kollegen und Veranstaltungen, welche Zusammenarbeit und Kommunikation fördern</li>\n<li>Begegnung auf Augenhöhe in einer Du-Kultur</li>\n<li>Moderne Arbeitswelten an zentralen Standorten</li>\n<li>Betriebliches Gesundheitsmanagement mit vielfältigen Mitarbeiterangeboten rund um das Thema „Gesundheit“</li>\n<li>Gewinnbeteiligung: Sie profitieren direkt von unserem gemeinsamen Erfolg</li>\n<li>Betriebliche Altersvorsorge: Mit dem Testsieger BVV können Sie das Alter entspannt auf sich zukommen lassen</li>\n</ul>\n<p><strong>Dynamische Perspektiven in stabilem Umfeld</strong></p>\n<p>Die BNP Paribas Gruppe bietet in Deutschland ein einzigartiges Arbeitsumfeld: Unsere 12 Gesellschaften bilden gemeinsam eine lernende Organisation, in der unsere Mitarbeitenden ihr Wissen miteinander teilen und sich dafür einsetzen, dass unsere Kunden von diesem großen Erfahrungsschatz profitieren. Werden Sie Teil unseres Teams, und treiben Sie eine Welt im Wandel mit Ihren eigenen Ideen voran.</p>\n<p>Für Ihre Fragen ist Verena Blum unter 0911 3690 sowie per Mail: <a href=\"mailto:recruiting@consorsbank.de\">recruiting@consorsbank.de</a> für Sie da. Wir freuen uns auf Ihre Bewerbung als Mobile Developer iOS (w/m/d) mit Nennung Ihrer Gehaltsvorstellung, dem frühestmöglichen Eintrittstermin und relevanten Zeugnissen!</p>\n<p><a href=\"https://vonq.io/30EaD18\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/30EaD18\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1NjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--17276ce838332b37ef37bfc4eeba98d6964f61a3/consors.jpeg"
    },
    {
      "id": "46ab84b4-12dc-4a95-ab08-422428554dfc",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/46ab84b4-12dc-4a95-ab08-422428554dfc",
      "created_at": "Fri Oct 09 19:42:30 UTC 2020",
      "company": "Playco",
      "company_url": "http://www.play.co",
      "location": "Remote",
      "title": "Core/Backend Engineer",
      "description": "<p>Here at Playco, we make games that bring the world closer together through play.</p>\n<p>Our ideal teammates are thoughtful, humble, and passionate professionals who can both zoom into the details and zoom out to embrace the big picture. We are inspired by makers and tinkerers, who are unafraid to experiment with a healthy disregard for constraints. We hope you'll enrich our team with your enthusiasm and passion, both for games and for life.</p>\n<p>Our engineers are generally amazing at something and great at everything else. We write scalable serverless backend systems, JavaScript / TypeScript game APIs and tools, and whatever else it takes to make our game studios efficient at what they do best -- create games. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.</p>\n<p><strong>The Role</strong></p>\n<p>We’re looking for engineers who are excited about redefining the technology stack to build and operate games reaching millions of people. Playco’s instant play first approach means that traditional industry approaches to game engine design, client/server architecture, big data and analytics, and games as a service needs to be rethought and redone. When you join our team, you’ll be at the forefront of the technology stack to enable millions of gamers to play with their friends, instantly.</p>\n<ul>\n<li>Be a key member of a high performing software engineering team.</li>\n<li>Architect and code sophisticated client/server systems for instant gaming.</li>\n<li>Play a critical role in day-to-day coding, performance profiling, optimization, and general troubleshooting.</li>\n<li>Collaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.</li>\n<li>Learn from and mentor other engineers on your team.</li>\n<li>Take ownership of your projects to make them the best they can possibly be.</li>\n<li>Provide valuable input on the company’s long-term engineering roadmap and help identify areas of opportunity for improvement.</li>\n<li>Define the cutting edge of social gaming!</li>\n</ul>\n<p><strong>Some projects that we work on</strong></p>\n<ul>\n<li>Backend as a service platform for game studios that allows game developers to effortlessly add persistence and multiplayer features for their games.</li>\n<li>Synchronous multiplayer game hosting platform that scales horizontally to any load.</li>\n<li>Common analytics layer to that allows to capture data consistently across games.</li>\n<li>Integration with new and exciting platforms that run instant games.</li>\n<li>Custom tooling framework to allow developers to deploy custom-purpose tools that help games with live ops.</li>\n</ul>\n<p><strong>Desired Skills</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science or related field, or equivalent experience.</li>\n<li>3+ years of professional software engineering experience.</li>\n<li>Experience writing clean, testable, high-quality code and designing highly scalable systems in production.</li>\n<li>Solid familiarity with deployment on cloud environments (AWS, GCP, Azure, etc.).</li>\n<li>Strong Computer Science fundamentals in software systems design, algorithms, and data structures.</li>\n<li>Ability to interact with peers in a constructive and productive style.</li>\n<li>Familiarity with git, svn, or other VCS.</li>\n<li>Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.</li>\n<li>Strong team player with a positive attitude.</li>\n<li>We are a growing distributed team that embraces remote work. You must be capable of working in a fast-paced environment and multiple time zones.</li>\n</ul>\n<p><strong>Bonus</strong></p>\n<ul>\n<li>Expert knowledge of NodeJS and ES6 / TypeScript.</li>\n<li>DevOps experience -- setting up CI/CD environments, orchestrating deployments, creating monitoring dashboards, anything that makes the development process easier, more enjoyable and more accountable.</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://jobs.lever.co/playco/4cbca38a-563f-432f-978b-b41f1dabc66c?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">Apply Here</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2FMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb29d1ab0fec648aee52b0ad6e7ec0a0485551ca/Round_Logo1%20(1).png"
    },
    {
      "id": "c797eeb3-347d-411f-80fa-574d7f765585",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/c797eeb3-347d-411f-80fa-574d7f765585",
      "created_at": "Fri Mar 12 21:38:51 UTC 2021",
      "company": "Lifted Logic",
      "company_url": null,
      "location": "Kansas City",
      "title": "PHP Full-stack Web Developer",
      "description": "<p>Description:\nAs a PHP Full-stack Web Developer, your focus would be on building out interfaces, interactions, and functionality for custom websites and web apps. While the framework or CMS may change from project to project, one constant is our commitment to quality. We primarily build and maintain sites built on WordPress and Laravel, but we value every developer’s input on the best tools for the job. We understand that there is no one-size-fits-all solution, so figuring out the best tools for the job is something we take seriously.</p>\n<p>Essential Job Functions:\nUse modern technologies and tools to build frontend and backend web experiences, including e-commerce and application development.\nCollaborate with other developers on various projects.\nWork with designers and content strategists to determine style, interaction, and functional requirements for upcoming projects.\nTroubleshoot bugs and other issues on live sites.\nManage multiple projects at any one time.</p>\n<p>What We Use:\nPHP\nHTML/CSS\nJS / jQuery / Vue\nGrunt / Gulp / Webpack\nNode / NPM / Bower\nWordPress / Laravel</p>\n<p>Qualifications:\n3+ years of coding experience\nA strong working knowledge of frontend languages such as HTML, JavaScript, PHP and MySQL.\nExperience working with front-end JavaScript libraries (jQuery, Vue, etc) and style frameworks (Bootstrap, Bulma, etc).\nExperience working with PHP-based CMSes (WordPress, Drupal, etc) and Frameworks (Laravel, Symfony, etc).\nA keen eye for user interaction and flow.\nA good sense of code structure and modern development methodologies.\nCares about the code they write.\nCan communicate effectively about development topics with non-technical roles.\nHigh attention to detail.\nAnd of course, someone who is willing to learn and grow in development and explore new ideas.</p>\n",
      "how_to_apply": "<p>Pleas send your Github link to <a href=\"mailto:todd@liftedlogic.com\">todd@liftedlogic.com</a></p>\n",
      "company_logo": null
    },
    {
      "id": "6554f4fa-9e9f-4b96-9584-50bb74993e3d",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6554f4fa-9e9f-4b96-9584-50bb74993e3d",
      "created_at": "Fri Mar 12 16:17:55 UTC 2021",
      "company": "Pursuit",
      "company_url": "https://www.pursuit.org/",
      "location": "New York, NY **Currently remote**",
      "title": "Full Stack Web Development Instructor",
      "description": "<p><strong>About Pursuit</strong></p>\n<p>Pursuit is a social impact organization that creates transformation where it’s needed most. Through our intensive software developer training program, we teach high-need, high-potential adults the technical skills and industry smarts needed to get their first tech jobs, advance in their careers, and become the next generation of leaders in tech. In addition to training and career support, Pursuit’s innovative operating model combines partnerships with tech companies to retrain their blue-collar workers and social impact investments to re-envision funding for outcomes-based organizations.</p>\n<p><strong>About the Role</strong></p>\n<p>At Pursuit, all employees have the opportunity to make a profound, positive social impact. Our Web Instructors perhaps have the greatest direct impact on our program participants and we are hiring several instructors to support our program expansion. As an Instructor, you will manage a class of approximately 36 Fellows with no technical background to become job-ready over a 12-month period. Instructors will deliver technical curriculum, provide feedback to Fellows and create a positive learning environment. We are hiring instructors at all levels, from associate to lead instructor.</p>\n<p>Our office is located in Long Island City, NY but we are currently fully remote due to Coronavirus, including our classes, and will remain so for the entirety of 2021.</p>\n<p><strong>Cohorts have two schedules: Days (Monday - Friday 10:00 - 6:00) and Nights &amp; Weekends (Saturday &amp; Sunday 10:00 - 6:00; Monday - Wednesday 2:00 - 10:00pm)</strong></p>\n<p><strong>About You</strong></p>\n<ul>\n<li>You are passionate about teaching and mentoring, and have a strong connection to our mission</li>\n<li>You have demonstrated professional experience working with front end and back end javascript, for example Node.js, React/Redux, and Postgres</li>\n<li>You have a no-fail attitude and love working with a big cross-functional team</li>\n<li>You are compassionate and able to work with a broad range of students</li>\n</ul>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Deliver full-class instruction - currently remote over Zoom</li>\n<li>Lead small-group and one-on-one sessions for fellows in need of additional review</li>\n<li>Monitor chat and answer fellow questions</li>\n<li>Grade fellow work; offer robust written and verbal feedback to fellows</li>\n<li>Spearhead workshops and activities that respond to the needs of cohort</li>\n<li>Build and refine curriculum materials</li>\n<li>Assess individual Fellows and support forecasting efforts to meet org goals</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>2+ years experience in a technical instruction or technical role</li>\n<li>Demonstrated experience developing web applications using JavaScript and React</li>\n<li>Passion for teaching and mentorship</li>\n<li>Knowledge of our tech stack: Postgres - Express - React/Redux - Node.js, aka PERN</li>\n<li>Strong work ethic and reliability</li>\n</ul>\n<p><strong>Nice to have</strong>\nJest, Cypress, React Testing Library/Enzyme, and automation platforms such as CircleCI</p>\n<p>This is a <strong>full-time, salaried position with competitive compensation and a wide range of benefits.</strong> Our offerings include premium health, dental, and vision insurance, flexible paid time off, and robust 401k matching.</p>\n",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:talent@pursuit.org\">talent@pursuit.org</a> and please indicate which schedule you prefer.</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbk9jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7cd6a370030b45eb588a308118d8718893d5fe95/Pursuit%20Wordmark%20Black.jpg"
    },
    {
      "id": "4150a9c0-438e-47f3-8c38-f0436e51522c",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/4150a9c0-438e-47f3-8c38-f0436e51522c",
      "created_at": "Fri Mar 12 16:00:59 UTC 2021",
      "company": "CTI Clinical Trial and Consulting Services, Inc.",
      "company_url": null,
      "location": "Covington, KY & Raleigh, NC",
      "title": "Senior Developer",
      "description": "<p>Job Purpose / Summary:\nThe Senior Developer works with system owners to understand the business requirements of a system and is able to use various technologies to develop the supporting infrastructure and user interfaces.  This can involve working with data from a variety of sources and developing the most efficient methods to manage data flow.  The Senior Developer communicates with both internal and external clients during all phases of system development, working within agreed upon budget and timelines.  The Senior Developer is proficient with industry best practices for processes and development technologies, and serves as a resource and mentor to other developers.</p>\n<p>What You'll Do:\nWork with system owners to develop requirements and transform into a usable system within the systems development life cycle (SDLC) framework\nDevelop custom databases and user interfaces using standard web and database technologies such as Microsoft SQL, Microsoft SSRS, Microsoft C#, etc.\nDevelop extract, transform, and load (ETL) processes on complex data sets\nPrepare reports, tables, charts, and graphs using Tableau and Microsoft SSRS\nDevelopment work in systems such as Medidata suite, SharePoint, and Intacct\nWork with and support other developers to create and implement best practices for processes and systems; provide leadership to other developers\nCommunicate results within the organization and to clients\nFollow applicable Standard Operating Procedures (SOPs) and maintain appropriate project documentation\nPerform, track, and manage related project work as assigned\nIdentify areas for improvement and provides recommendations to address\nAdhere to requirements of 21 CFR Part 11 where applicable</p>\n<p>What You'll Bring:\nBachelor's Degree in Computer Science or related field\n5 years industry experience in related field\nExperience with Microsoft SQL Server, Microsoft SSRS, SQL, Microsoft C#, and Tableau</p>\n<p>Why CTI?:\nWe support career progression –  We have a structured mentoring program to provide the support you need to move forward\nWe value education and training – We provide tuition reimbursement, partner with universities and colleges to create programs in our field, and have a dedicated training department\nWe value our people - We have never had a layoff in our 20-year history, support a work-life balance, and have provided cash bonuses every year for the past decade\nOur culture is unparalleled – We've received multiple awards recognizing CTI as one of the best places to work in the greater Cincinnati area, as well as one of the top CROs in the industry\nWe think globally and act locally – We have a global philanthropic program supporting our team’s efforts to improve their local communities (click here to learn more about our “CTI Cares” program)\nWe are looking toward the future – We have had a consistent double-digit growth rate over the last decade, invest in cutting-edge technology, and pride ourselves on our average 95% annual retention rate (a recent report found that the average turnover for CROs in the US was 30%)\nOur work makes a difference – We focus our work on treatments for chronically and critically-ill patients, who are depending on us to bring these life-changing therapies to market</p>\n",
      "how_to_apply": "<p><a href=\"https://www.ctifacts.com/careers/join-the-cti-team?gnk=job&amp;gni=8a7885ac767274b60176f1e375d60e49&amp;gns=Industry+Website\">https://www.ctifacts.com/careers/join-the-cti-team?gnk=job&amp;gni=8a7885ac767274b60176f1e375d60e49&amp;gns=Industry+Website</a></p>\n",
      "company_logo": null
    },
    {
      "id": "ad662975-bab2-47a1-877f-486759533180",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/ad662975-bab2-47a1-877f-486759533180",
      "created_at": "Fri Mar 12 15:41:35 UTC 2021",
      "company": "arxes-tolina GmbH",
      "company_url": "https://smardigo.de/",
      "location": "Berlin",
      "title": "Senior Java Developer (m/w/d)",
      "description": "<p><strong>Für unseren Geschäftsbereich Software am Standort Siemensdamm in Berlin suchen wir Senior Java Entwickler (m/w/d)</strong></p>\n<p>arxes-tolina GmbH ist ein führender Anbieter von hochwertigen und praxisbewährten Lösungen und Services in den Bereichen IT, Software und Consulting. Dabei verbinden wir in unserem Portfolio das klassische IT-Systemhausgeschäft mit unseren eigenen Softwarelösungen zur Digitalisierung von Geschäftsprozessen. arxes-tolina GmbH verfügt über fast 30 Jahre Erfahrung bei der Entwicklung von intelligenten Softwarelösungen zum Automatisieren und Optimieren von Geschäftsprozessen, die kundenindividuell gestaltet und über Schnittstellen schnell und effizient in bestehende IT-Infrastrukturen integriert werden können.</p>\n<p>Mit unserer Low-Code-Plattform smardigo setzen wir auf eine einfache und schnelle digitale Transformation von Geschäftsprozessen mittels BPMN. In Kombination mit unserer Automatisierungsplattform Camino und unserem End-to-End verschlüsselten Austauschhub e-DEN bieten wir unseren Kunden somit eine Komplettlösung zur Digitalisierung von Geschäftsprozessen.</p>\n<p>Wir bieten unseren Kunden im Rahmen unseres Consulting-Services branchenübergreifendes Wissen in verschiedensten Fachbereichen, unter anderem durch langjährige Praxiserfahrung aus zahllosen erfolgreichen Kundenprojekten, an. So begleiten wir namenhafte Unternehmen und öffentliche Auftraggeber als Digitalisierungspartner auf ihrem Weg in ein zukunftsfähiges Geschäftsmodell.\nAls arxes-tolina Team verfolgen wir das Ziel einer der TOP Digitalisierungspartner in Deutschland zu sein und gemeinsam mit der neu gewonnenen Unterstützung der netgo group werden wir zum „Digital Gamechanger“.</p>\n<p><strong>Proud to be part of netgo group</strong></p>\n<p><strong>Als Senior Java Entwickler erwartet dich bei uns:</strong></p>\n<ul>\n<li>Agile Software-Entwicklung mit Scrum oder Kanban</li>\n<li>Spannende und abwechslungsreiche Projekte zur Unterstützung der digitalen Transformation</li>\n<li>Entwicklung von innovativen Lösungen mit modernen Web Technologien und nach dem Clean-Code-Prinzipien</li>\n<li>Unterstützung des Product Owners bei der Konzeption von Kundenanforderungen und technischen Umsetzung im Team</li>\n<li>Selbstorganisierte Teams mit einer flachen Hierarchie</li>\n<li>Kreatives Arbeiten und das Ausprobieren neuer Technologien</li>\n<li>Feedbackkultur auf Augenhöhe</li>\n</ul>\n<p><strong>Das wünschen wir von dir:</strong></p>\n<ul>\n<li>Du bringst mehrjährige Berufserfahrung als Softwareentwickler mit, idealerweise auch in Softwarearchitektur und -konzeption</li>\n<li>Du fühlst dich als Fullstack-Entwickler wohl (Frontend - SPA z.B. Angular, React, VueJS, Vaadin und/oder Backend - Java, Spring, JPA(Hibernate), SQL, Buildprozesse CD/CI)</li>\n<li>Du hast einen hohen Anspruch an Code-Qualität, Design und die Schaffung einer agilen Software-Architektur</li>\n<li>Du arbeitest dich schnell in neue Themen und Technologien ein</li>\n<li>Du hast Erfahrung mit agilen Softwareentwicklungsmethoden</li>\n<li>Du bringst dich mit deiner Kommunikationsfähigkeit ins Team bzw. beim Kunden ein</li>\n<li>Deine Deutschkenntnisse sind verhandlungssicher in Wort und Schrift</li>\n<li>Pluspunkte geben Erfahrung im Mentoring, Elastic-Stack und Docker</li>\n</ul>\n<p><strong>arxes-tolina bietet dir:</strong></p>\n<ul>\n<li>Einen Job in einem zukunftsweisenden und wachsenden Unternehmen</li>\n<li>Gestaltungsspielraum und hohe Einflussmöglichkeiten auf die eigene Arbeit für deine persönliche Entfaltung</li>\n<li>Eine angenehme offene und familiäre Arbeitsatmosphäre in unseren Teams sowie unternehmensübergreifend zwischen den Mitarbeiter*Innen.</li>\n<li>Ein Mentoringprogramm und ein Einarbeitungsplan für deinen gelungenen Einstieg</li>\n<li>Eine offene Kommunikationskultur, in der auch „der Elefant im Raum“ angesprochen werden kann</li>\n<li>Wir sorgen mit Weiterbildungsmöglichkeiten für deine persönliche und berufliche Entwicklung</li>\n<li>Betriebliche Altersvorsorge für dich und deine Familie</li>\n<li>Mit einem JobRad, unserem Remotework-Konzept sowie deiner flexiblen Arbeitszeitgestaltung steht deiner Work-Life-Balance nichts mehr im Weg!</li>\n<li>Du kommst mit dem öffentlichen Nahverkehr zur Arbeit? Dann nutze unseren BVG- Zuschuss!</li>\n<li>Einen Dienstwagen für deine Kundentermine und Familienausflüge</li>\n</ul>\n<p><strong>Fühlst Du dich der Herausforderung gewachsen? Dann schick uns deinen Lebenslauf!</strong></p>\n<p>Ansprechpartner: Felix Schwarz\nTelefonnummer: 030 264745 337</p>\n",
      "how_to_apply": "<p>Email your CV to <a href=\"mailto:felix.schwarz@arxes-tolina.de\">felix.schwarz@arxes-tolina.de</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXVjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--22fd138e123dee60d94613e260f3168f63c4751b/MicrosoftTeams-image.png"
    },
    {
      "id": "afb5f880-8368-4d6b-9904-082b56da6772",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/afb5f880-8368-4d6b-9904-082b56da6772",
      "created_at": "Fri Mar 12 14:19:00 UTC 2021",
      "company": "Smart Pricer GmbH ",
      "company_url": "http://www.smart-pricer.com",
      "location": "Berlin ",
      "title": "Backend Developer - (m/f/d)",
      "description": "<p>Smart Pricer is the leading ticket pricing company in Europe. We offer pricing services in the areas of sports, entertainment and ski resorts and are proud to work with partners such as FC Bayern Munich, DFB, Hertha BSC, Sölden ski resort, Zermatt Bergbahnen and many more. Our work is characterized by entrepreneurial thinking, effective transaction management and innovative solutions. We owe our success as one of the world's leading specialists in our field not least to a distinctly team-oriented approach.</p>\n<p>Together we want to grow further and are therefore looking for a</p>\n<p>Backend Developer - (m/f/d)</p>\n<p>to support us as soon as possible.</p>\n<p>With us, you are part of a committed and motivated team that rethinks the way pricing is done with a lot of enthusiasm and drive from Berlin. If you want to take on responsibility from day one and drive our mission forward with your own ideas, then your application is just right with us.</p>\n<p>Your Responsibilities:</p>\n<ul>\n<li>Within the first three months, you will familiarize yourself with our existing services (you have access to documentations and team members)</li>\n<li>You will lead and own the development of our back-end pricing services incl. the design and deployment of APIs to run our services</li>\n<li>Your responsibilities will range - from rapidly building prototypes in product discovery phase, to delivering reliable quality products in delivery phase, to developing our tech architecture further ensuring functionality, scalability, reliability and security (a hands-on mind-set and strategic oversight are essential for this)</li>\n<li>You will define the technical requirements of the company in detail and set up all required processes</li>\n<li>In 6-9 month time you will start to build and manage a small technical team of A-players (including software engineers, data scientists)</li>\n<li>Together with the founders you and your team will continuously iterate our product by developing hypotheses, validating them (e.g. through user research and tests) and shipping new features</li>\n<li>You own the operative KPIs tech and will be the voice of tech in all strategic decisions</li>\n<li>You oversee the monitoring of our live pricing services</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Software Developer with a degree in a technical related field such as Computer Science, Bio/Informations or similar</li>\n<li>You have at least 3 years experience working in Software Development</li>\n<li>You are skilled in several backend languages (Go, Ruby) and in working with and deploying cloud services in a Unix environment</li>\n<li>Optionally you have some frontend experience in TypeScript and CoffeeScript as well as some data analytics background in Python</li>\n<li>You combine a strong hands-on-attitude (and are happy to develop and maintain code yourself) with strategic thinking and an entrepreneurial mindset</li>\n<li>You have a high focus on customer needs and contribute your best knowledge and experience about technology, products and processes</li>\n<li>You are interested in pricing, data mining, ML</li>\n<li>You are characterized by a sovereign appearance as well as good presentation and communication skills</li>\n<li>You are fluent in English and German</li>\n</ul>\n<p>What We Offer:</p>\n<ul>\n<li>A friendly and respectful team with a family work culture</li>\n<li>A great workplace in Berlin Mitte with a part-time remote work option</li>\n<li>The chance to take over a large area of expertise very quickly and to make a steep entry into a management position</li>\n<li>An attractive compensation package</li>\n<li>Flexible working hours</li>\n<li>A secure employment relationship</li>\n<li>Meaning - our work has direct impact on sports and entertainment pricing across all of Europe</li>\n</ul>\n",
      "how_to_apply": "<p>We are happy to receiving your application by e-mail, stating your desired salary and earliest possible starting date, at: <a href=\"mailto:miriam.weber@smart-pricer.com\">miriam.weber@smart-pricer.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--74a56e5e88ac7195798fd6d2d553cec130e90f9e/Smart%20Pricer%20Logo.jpg"
    },
    {
      "id": "50e7a6e5-cfc9-415e-a681-2eec2f631d3b",
      "type": "Part Time",
      "url": "https://jobs.github.com/positions/50e7a6e5-cfc9-415e-a681-2eec2f631d3b",
      "created_at": "Fri Mar 12 13:56:42 UTC 2021",
      "company": "Hallo Welt Systeme UG (haftungsbeschränkt)",
      "company_url": "http://volla.online",
      "location": "Germany",
      "title": "Android System Developer for the Volla Phone",
      "description": "<p>We are a young German company based in Remscheid, which started with private equity and two successful crowd funding projects and offers you a perspective for the future.</p>\n<p>We want to make an innovative alternative to Google and Apple available for everyone, that ensures our freedom through simplicity and privacy protection. It implements a new approach of user interface and user experience.</p>\n<p>You would work with a small international Team and growing community from all over the world. You are free to work in your home office with an agreed availability of 1, 2 or 3 days per week for three month with a perspective to extend the contract.</p>\n<p>Your tasks:</p>\n<ul>\n<li>Maintenance and improvement of Volla OS</li>\n<li>Enabling regular system updates and patches of AOSP upstream project</li>\n<li>Custom patches for security and privacy protection</li>\n<li>Maintenance and improvement of custom system app integration</li>\n<li>Integrating network traffic control</li>\n</ul>\n<p>You should have the following skills:</p>\n<ul>\n<li>Experience with the development of custom ROMs based on AOSP</li>\n<li>Experience with Android Board Support Packages</li>\n<li>Experience with Continuous Integration, preferably GitLab</li>\n<li>Knowledge in hardware adaptation of Android</li>\n<li>knowledge in Android Studio and Android Tools</li>\n<li>Knowledge in open source projects and platforms like GitHub</li>\n</ul>\n<p>Interested? We look forward to receiving your application with CV and references!</p>\n",
      "how_to_apply": "<p><a href=\"mailto:jobs@volla.online\">jobs@volla.online</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVNjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--647918d0d162d445c63fdde7b3fb28a4604fcbf6/Logo%20for%20Device.png"
    },
    {
      "id": "84416907-e6ce-43f7-9a1d-351818c076dc",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/84416907-e6ce-43f7-9a1d-351818c076dc",
      "created_at": "Fri Mar 12 13:37:22 UTC 2021",
      "company": "ORTEC ",
      "company_url": "https://ortec.com",
      "location": "Zoetermeer",
      "title": "DevOps Engineer",
      "description": "<p>As a <strong>DevOps engineer</strong> at ORTEC, one of your main goals is to empower our 130+ software developers around the globe with regards to our software development tools. This means maintenance on existing tools and R&amp;D and implementation of new systems &amp; tools supporting our product transition to the cloud (Azure)</p>\n<p>Our team of DevOps - and System engineers is the spinning wheel in the software and product development unit. As a <strong>DevOps engineer</strong> you work on technical projects.</p>\n<p>The team maintains, improves, migrates, and supports all the development systems and tooling that are needed to keep the software and product development empowered and productive. The team is responsible for a versatile portfolio like:</p>\n<ul>\n<li>Continuous integration and Continuous deployment environment (Jenkins, Azure DevOps, Team city)</li>\n<li>Version control system (Perforce &amp; Git)</li>\n<li>Test case management software (Testrail)</li>\n<li>NuGet repository management (Nexus)</li>\n<li>Issue and project software (Jira, Azure DevOps)</li>\n<li>Virtual Machines (vSphere and HyperV) for software &amp; test engineers with the required tooling to do the job!\nAnd more…</li>\n</ul>\n<p>The team is growing towards a team of four to five DevOps - and System engineers. It is also responsible for all integrations between the systems &amp; tools. Next to that, the system engineers maintain and develop all automation to deploy and update the systems &amp; tools.</p>\n<p>It is important that you embrace the “DevOps” culture. If people have questions or want support and advice regarding (cloud) infrastructure, automation or the best tooling for the job, you are the “go to” person. We also monitor that the software is automatically build, tested and deployed in the cloud using our continuous integration and continuous delivery pipelines. You work close together with the IT department and you keep aligned with other internal stakeholders.</p>\n<h2>Who you are</h2>\n<ul>\n<li>You embrace the DevOps culture</li>\n<li>Automating is your second nature</li>\n<li>You have knowledge of Virtualization, PowerShell and Windows Server Platform</li>\n<li>You can learn quickly to understand Jira, Perforce, Git, etc.</li>\n<li>You have a relevant bachelor’s degree</li>\n<li>You like to consult others, but also to do the work yourself</li>\n<li>You have 2+ years of relevant working experience</li>\n<li>Willingness to take part in on-call duties to support our customers 24/7 (approx. 8 weeks per year).You will be generously compensated</li>\n</ul>\n<h2>What we offer</h2>\n<p>We are a small, relatively new growing team and with that you will find a ‘start-up’-atmosphere which gives you ample opportunity to explore, learn and grow, and make it your team.</p>\n<ul>\n<li>Entrance to the most passionate powerhouse in applied mathematics</li>\n<li>Join our movement and improve the world</li>\n<li>Enjoy an open, kind and fun culture</li>\n<li>NS Business Card 100%, NS Business Card, lease opportunity or commuting allowance: it’s your choice</li>\n<li>Mobility allowance of 3% of your base salary</li>\n<li>25 annual leave days, additional days from the age of 35</li>\n<li>Result related remuneration</li>\n<li>Active employee association for fun activities with colleagues and content driven Young ORTEC for you to join</li>\n<li>We help you to #stayhealthy, to #stayeffective and to #stayconnected: we organize online activities such as pub quizzes, online sports events, social calls with colleagues, and much more</li>\n<li>Year-end bonus equal to a full month’s pay</li>\n<li>We believe in commitment: your permanent contract will be waiting for you</li>\n</ul>\n<h2>What to expect</h2>\n<p>We will help you to thrive in your field of expertise. We offer development programs, tailored to your individual needs and function requirements, including opportunities to attend courses and seminars. We offer challenging, practical hands-on experience with opportunities to work abroad. We operate in a flat organizational structure that keeps communication lines short. The atmosphere is open, informal, cooperative and positive. We employ over 1000 people in the Netherlands (HQ), Belgium, Germany, France, the U.K., Romania, Italy, the U.S., Australia, Brazil, Poland, Denmark and Singapore. Visit our website <a href=\"http://www.ortec.com\">www.ortec.com</a> to learn more about our solutions and clients’ experiences.</p>\n<p>Please do not use this vacancy as an acquisition opportunity.</p>\n<p><strong>Interested?</strong></p>\n<p>Apply now via the <strong>application form</strong></p>\n<p><a href=\"https://vonq.io/3rEupFy\">Click here for the application form!</a></p>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/3rEupFy\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbCtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9c2c222f6ca6056210264a039dc35d35a6ce8e91/ortec.jpeg"
    },
    {
      "id": "77402588-6286-4aa3-b8c5-988f8dcbbba3",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/77402588-6286-4aa3-b8c5-988f8dcbbba3",
      "created_at": "Fri Mar 12 12:07:48 UTC 2021",
      "company": "DONE! Berlin",
      "company_url": "https://doneberlin.com",
      "location": "Berlin",
      "title": "Fullstack Developer (m/f/d) @Footprint in Berlin",
      "description": "<p>We are DONE! Berlin, an international consultancy specializing in helping fast-growing companies of all sizes to navigate the ever-changing world of work. Among other things, we help our clients attract the best talent to their companies.</p>\n<p>Our client Footprint Technologies GmbH is a young, ambitious start-up located in Berlin. The company's mission is to develop a technology that allows online shoppers to easily and accurately measure their feet at home in order to always find the perfect fitting shoe. With this solution, online retailers will reduce their returns, costs and emissions. In product development Footprint consistently places the user and data insights at the center of all activities and decisions.</p>\n<p>To help Footprint achieve its mission, we are looking for a talented Fullstack developer (m/f/d). You’re a smart person with a strong drive and keen to work in a collaborative culture? Great! Because we want you to take the initiative to move Footprint forward by bringing in your own ideas.</p>\n<p><strong>Tasks</strong></p>\n<ul>\n<li>Develop multi-platform web frontends for mobile and desktop</li>\n<li>Conceptualize, implement and maintain user-facing features for Footprint's products</li>\n<li>Design and develop backend APIs</li>\n<li>Develop reusable libraries</li>\n<li>Optimize the applications for performance and responsiveness</li>\n<li>Support maintaining CI/CD pipelines and databases in the cloud</li>\n<li>Develop web frontend applications when needed</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Ideally a completed degree in Computer Science, Software Engineering or related field</li>\n<li>Around 5 years of experience in developing web applications in cloud, ideally using node.js/ nest.js and Typescript</li>\n<li>Proven experience in developing frontend projects, ideally using React and Typescript/ JavaScript with HTML5 and CSS</li>\n<li>Good understanding of Test-driven development (TDD), CI/CD pipelines, DevOps principles and MS-Azure</li>\n<li>Having fun in solving complex problems</li>\n<li>Good level of English (C1 Level minimum)</li>\n</ul>\n<p><em>Nice to Have</em></p>\n<ul>\n<li>Experience with Kubernetes and Docker</li>\n<li>Experience in using Grafana and Sentry (or similar)</li>\n<li>Experience in developing with C# and Go for cloud applications</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>Being transparent is the best way for Footprint to find solutions and grow together. The team pursues a culture where they frankly address anything that concerns them or affects their work. They bring in a rich combination of skillsets and individual strengths, making them a powerful team.</p>\n<ul>\n<li>Steep learning curve by working independently in your own field within Footprint's fabulous development team</li>\n<li>Opportunity to further develop your experience by certified trainings when required</li>\n<li>Maximum freedom and trust in terms of your working time, location and holidays</li>\n<li>Guidance and coaching whenever needed as well as support in finding the right mentors from our broad network of experts</li>\n<li>Fair and transparent compensation model</li>\n<li>And yes - fresh fruits and unlimited coffee are guaranteed! So are team lunches and beers as soon as we're allowed to have them again!</li>\n</ul>\n<p><strong>Looking forward to hearing from you!</strong></p>\n",
      "how_to_apply": "<p><a href=\"https://doneberlin.join.com/jobs/1967509-fullstack-developer-m-f-d-footprint-in-berlin?pid=357a3b4531918760973f&amp;oid=7b2bd1b9-6d24-4e96-9bfe-fb7fea6a4d6e&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=fullstack%2Bdeveloper%2Bm%2Bf%2Bd%2Bfootprint%2Bin%2Bberlin\">https://doneberlin.join.com/jobs/1967509-fullstack-developer-m-f-d-footprint-in-berlin?pid=357a3b4531918760973f&amp;oid=7b2bd1b9-6d24-4e96-9bfe-fb7fea6a4d6e&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=fullstack%2Bdeveloper%2Bm%2Bf%2Bd%2Bfootprint%2Bin%2Bberlin</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--591982ec4af55dc7aa33632d01b31c88aa030974/done-berlin-logo-l.jpg"
    },
    {
      "id": "8a68aad7-c6ae-4b42-a56a-f187f1850207",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/8a68aad7-c6ae-4b42-a56a-f187f1850207",
      "created_at": "Fri Mar 12 11:55:39 UTC 2021",
      "company": "ValueWorks GmbH",
      "company_url": "https://www.valueworks.ai",
      "location": "Remote",
      "title": "Front-end developer",
      "description": "<p>ValueWorks is a management platform to help executives and managers make data-driven management decisions. We enable them to manage and measure the performance of their business by integrating the data from different information systems (JIRA, Salesforce, LinkedIn,) to build KPIs and OKRs.</p>\n<p>We are looking for a front-end developer to build and implement our user interface. You will work with our small team consisting of developers, founders and a UX designer. We provide an opportunity to become full-stack by teaching you python and django.</p>\n<p><strong>Tasks</strong></p>\n<ul>\n<li>Strong knowledge of HTML, CSS &amp; Javascript</li>\n<li>Vue.js and Vuex experience (alternatively React)</li>\n<li>Ability to build responsive, cross-browser user interfaces from design prototype</li>\n<li>Ability to create simple, intuitive web interfaces for complex features.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>No special qualification is needed. Just experience and talent.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Bootstrap experience</li>\n<li>Eagerness to become a full stack developer</li>\n<li>Experience working with relational databases</li>\n<li>We are looking forward to your application.</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://valueworks.join.com/jobs/1990556-front-end-developer?pid=357a3b4531918760973f&amp;oid=b83c4b8b-8f91-493f-8bb7-5901344e9f8d&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=front-end%2Bdeveloper\">https://valueworks.join.com/jobs/1990556-front-end-developer?pid=357a3b4531918760973f&amp;oid=b83c4b8b-8f91-493f-8bb7-5901344e9f8d&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=front-end%2Bdeveloper</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7aa1d9010f1d849fde6c5634ee2a843cb50b4778/value-works-gmb-h-logo-xl.png"
    },
    {
      "id": "ae9b5e05-e2cc-4461-a07d-69dde55566eb",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/ae9b5e05-e2cc-4461-a07d-69dde55566eb",
      "created_at": "Fri Mar 12 10:34:34 UTC 2021",
      "company": "v-Office",
      "company_url": "https://intro.v-office.com/de/",
      "location": "Remote",
      "title": "Web-Developer (m,w,d)",
      "description": "<p>Wir, das Team von vOffice, tun alles dafür, um unseren Kunden die Arbeit zu erleichtern. Unsere Software macht die Verwaltung und Organisation von Ferienobjekten zum Kinderspiel. Von der Onlinebuchung auf unseren Websites bis zur Team-Einsatzplanung wird alles über unsere moderne Cloudsoftware abgewickelt. Als schnell wachsendes Unternehmen und Marktführer in Deutschland benötigen wir tatkräftige Unterstützung im Bereich Web-Entwicklung.</p>\n<p><strong>Aufgaben</strong></p>\n<p>Jeder unserer Kunden braucht eine tolle Webseite. Viele nutzen dafür unser in-house-Angebot, dass auf unserem custom CMS beruht. Du richtest darin neue Websites ein, d.h. Du integrierst die individuellen Anforderungen in die vorhandenen Templates. Du entwickelst die Templates weiter, damit jeder unserer Kunden das Passende findet. Und Du hilfst unseren Bestandskunden, ihre Websites zu verbessern und zu aktualisieren.</p>\n<p><strong>Qualifikation</strong></p>\n<ul>\n<li>Fundierte Kenntnisse in der Webseiten-Entwicklung: CSS (LESS/Post CSS), Javascript, webpack, Erfahrung mit Vue.js von Vorteil</li>\n<li>Autonome und strukturierte Arbeitsweise</li>\n<li>Zielorientierter Teamplayer, den nichts so schnell aus der Ruhe bringt</li>\n<li>Englisch (verhandlungssicher)</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Werde Teil eines sympathischen Teams in einem dynamischen Umfeld</li>\n<li>Viel Handlungsspielraum, kurze Abstimmungswege</li>\n<li>Ein flexibles, familienfreundliches Arbeitszeitmodell</li>\n<li>Ein modern ausgestatteter Arbeitsplatz mit Blick auf die Ostsee oder citynah in Hamburg-Altona</li>\n<li>Home-Office möglich, egal wo Du wohnst</li>\n</ul>\n<p><em>Das ist der richtige Job wenn Du Bock hast auf</em></p>\n<ul>\n<li>Start-up-Feeling</li>\n<li>Team-Work</li>\n<li>Gestalten und Gewinnen</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://v-office.join.com/jobs/1970469-web-developer-m-w-d?pid=357a3b4531918760973f&amp;oid=53e226e2-b7d9-4793-8c22-7ed2d2dfa8a3&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=web-developer%2Bm%2Bw%2Bd\">https://v-office.join.com/jobs/1970469-web-developer-m-w-d?pid=357a3b4531918760973f&amp;oid=53e226e2-b7d9-4793-8c22-7ed2d2dfa8a3&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=web-developer%2Bm%2Bw%2Bd</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3ljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bf22073c9b977970f4037000ce0183594ac5db4b/v-office-logo-xl.jpg"
    },
    {
      "id": "d42fd076-e1cb-482f-8329-b34ea3f1a634",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/d42fd076-e1cb-482f-8329-b34ea3f1a634",
      "created_at": "Fri Mar 12 10:01:07 UTC 2021",
      "company": "Nictiz",
      "company_url": "https://www.nictiz.nl/",
      "location": "Den Haag",
      "title": "Developer ART-DECOR",
      "description": "<p>Is het jouw uitdaging om als Developer (Front/Back-End) onze ART-Decor omgeving perfect op orde te krijgen en houden? Wil jij je steentje bijdragen in de standaardisatie in de zorg? Dan maken wij graag kennis met jou. Twijfel niet en solliciteer direct!</p>\n<p>Nictiz heeft voor haar locatie in Den Haag een vacature voor een</p>\n<p><strong>Developer ART-DECOR</strong></p>\n<p>Ter uitbreiding van het Toolingcentrum van Nictiz zijn wij op zoek naar ART-Decor DeveloperS (Front/Back-End) die meewerken aan de (door)ontwikkeling van onze ART-DECOR omgeving.</p>\n<p><strong>Wat ga je doen als Developer ART-DECOR?</strong>\nART-DECOR is een open source ontwikkelingstool, wat door Nictiz gebruikt wordt bij het opstellen, beheren en beschikbaar stellen van informatiestandaarden. ART-DECOR wordt intern en extern intensief gebruikt. Nictiz wil de verdere ontwikkeling van ART-DECOR met voorrang aanpakken.</p>\n<p>Als Front-End Developer wordt het jouw taak om te werken aan een noodzakelijke platformverbetering, maar ook het vergroten van de gebruiksvriendelijkheid en uitbreiding van functionaliteit. Deze verbeteringen moeten goed aansluiten op de eisen en wensen van gebruikers. Ook zal je een rol spelen bij het realiseren van Nictiz specifieke wensen.</p>\n<p>Als Back-End Developer wordt het jouw taak om te werken aan de doorontwikkeling van ons platform, waaronder API ontwikkeling.\nOnze back-end bestaat uit NoSQL database (eXist-db), XQuery, JSON/SML en OpenAPI (OAS).\nNaast het ontwikkelen, ben je ook verantwoordelijk voor het testen én documenteren van de ontwikkelde functionaliteit.</p>\n<p>Om tot de juiste oplossingen te komen, werken wij niet alleen als team samen, maar ook met andere belanghebbende, zoals de Internationale Expertgroep.\nVoor meer informatie <a href=\"https://www.nictiz.nl/standaardisatie/art-decor/\">https://www.nictiz.nl/standaardisatie/art-decor/</a></p>\n<p><strong>Wat breng je mee?</strong></p>\n<ul>\n<li>HBO opleiding op het gebied informatiekunde is een pre;</li>\n<li>Als Back-end developer: Ervaring met XQuery, Open API, Git, REST en JSON;</li>\n<li>Als Front-end: Ervaring met Vue.js, Git, REST en JSON;</li>\n<li>Je bent communicatief vaardig (Nederlands en Engels) en klantgericht;</li>\n<li>Je bent in staat zelfstandig te functioneren;</li>\n<li>Uitstekend analytisch vermogen.</li>\n</ul>\n<p>De volgende kennis is een pré, zeker geen must:</p>\n<ul>\n<li>Kennis van en ervaring met informatiestandaarden in de zorg;</li>\n<li>Kennis en ervaring met FHIR;</li>\n<li>Kennis en ervaring met terminologiestelsels zoals SNOMED en LOINC.</li>\n</ul>\n<p><strong>Wat biedt Nictiz jou?</strong></p>\n<ul>\n<li>Een mooi, marktconform salaris;</li>\n<li>Aantrekkelijke secundaire arbeidsvoorwaarden, zoals een premievrij pensioen, eindejaarsuitkering, korting op ziektekostenverzekering;</li>\n<li>Een jaarlijks persoonlijk opleidingsbudget van 5% van je bruto jaarsalaris;</li>\n<li>Een jaarcontract voor 32 – 40 uur met mogelijkheid tot verlenging en aansluitend uitzicht op vast dienstverband;</li>\n<li>Een gedreven en enthousiast team, dat samenwerking hoog in het vaandel heeft en vol ambitie zit;</li>\n<li>Een fijne werksfeer met ruimte voor reflectie.</li>\n</ul>\n<p><strong>Over Nictiz</strong>\nNictiz is de landelijke, onafhankelijke kennisorganisatie die zich inzet voor digitale informatie-uitwisseling in de zorg. Nictiz doet dit onder meer door het gebruiksgericht ontwikkelen en het beheren van informatiestandaarden in opdracht van en samen met de partijen in de zorg. Nictiz signaleert en adviseert partijen in de zorg over informatie-uitwisseling en over (toekomstige) nationale en internationale ontwikkelingen.</p>\n",
      "how_to_apply": "<p>We maken graag ruimte voor jouw expertise!</p>\n<p><strong>Meer informatie</strong>\nVoor meer informatie over de functie of de selectieprocedure kun je contact opnemen met onze recruiter, Audrey van der Linde, via 06 2120 5164 of <a href=\"werving@nictiz.nl\">werving@nictiz.nl</a>.</p>\n<p><strong>Solliciteren op de functie van Developer ART-DECOR</strong>\nGeen vragen meer, maar wil je direct solliciteren? Upload dan snel je Curriculum Vitae en motivatiebrief via onze <strong><a href=\"https://nictiz.zohorecruit.eu/jobs/Careers/31034000000823039/Developer-ART-DECOR?source=CareerSite&amp;utm_source=github&amp;utm_medium=referral&amp;utm_term=2021&amp;utm_content=181174&amp;utm_campaign=developer-art-decor\">sollicitatiepagina</a></strong>.</p>\n<p>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</p>\n<p><em>Trefwoorden: Developer, Front-end Developer, Back-end Developer, IT, ICT, Informatiekunde, HBO, vacature Den Haag</em></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d3fb9696e42749259b9ac102696614d649c01926/Logo%202021.jpg"
    },
    {
      "id": "8a221c8f-0722-483a-9c8b-94b76769873d",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/8a221c8f-0722-483a-9c8b-94b76769873d",
      "created_at": "Fri Mar 12 09:57:21 UTC 2021",
      "company": "BLVRD",
      "company_url": "http://www.blvrd.de/home-gh",
      "location": "Hannover (Germany)",
      "title": "Backend Developer (m/w/d) - Java (Spring Boot)",
      "description": "<p>BLVRD ist die erste Online-Plattform für lokale Mode. Mit unserer Cross-Platform-App revolutionieren wir die Art, wie Menschen lokal Mode shoppen und arbeiten hier bereits mit großen Namen aus der Branche zusammen. Unser Ziel ist es, dem lokalen Handel wieder auf die Beine zu helfen und Paketmüll durch Online-Retouren zu reduzieren.</p>\n<p>Gemeinsam mit dem Team steuerst du die Weiterentwicklung unseres Backends hin zu einer Plug&amp;Play-Lösung, um die Anbindung neuer Händler iterativ zu vereinfachen. Dabei bist du bei uns Teil eines crossfunktionalen Teams, in dem jeder liebt, was er tut und sein Bestes gibt - für das große Ganze.</p>\n<p>DEINE AUFGABEN</p>\n<ul>\n<li>Du entwickelst Services für den Import und das Mapping der Produkt- &amp; Bestandsdaten lokaler\nHändler</li>\n<li>Du entwickelst skalierbare Micro-Services, die schnell wachsende Nutzerzahlen unterstützen können</li>\n<li>Du unterstützt bei der Konzeption und Entwicklung unserer Full-Service Lösung zur Digitalisierung\ndes Modehandels (Produkt- &amp; Bestandsdatenaktualisierung)</li>\n<li>Du unterstützt bei der Konzeption &amp; Entwicklung unseres internen App-CMS</li>\n</ul>\n<p>DEINE SKILLS</p>\n<ul>\n<li>Du hast mindestens 2 Jahre Erfahrung mit Java-Entwicklung (Spring Boot)</li>\n<li>Du kennst dich mit Datenbanksystemen wie MongoDB und PostgreSQL aus</li>\n<li>Du siehst in Problemen keine Hindernisse, sondern Chancen für dich persönlich, dein Team und\nBLVRD</li>\n<li>Du triffst schnell, smarte Entscheidungen und wägst das Risiko intelligent ab</li>\n<li>Du verfügst über eine ausgeprägte ‘Hands-on’ Mentalität, du liebst es, mit anzupacken und Erfolge zu\nsehen</li>\n<li>Nice-To-Have: Erfahrung mit Firebase, GraphQL und/oder Elastic Search</li>\n</ul>\n<p>BENEFITS</p>\n<ul>\n<li>Die Möglichkeit, die erste SaaS-Plattform für lokale Einkaufserlebnisse mit aufzubauen</li>\n<li>Ein junges Team mit starkem Zusammenhalt und flachen Hierarchien</li>\n<li>Start-up-Mentalität: dynamische Atmosphäre und großartiger Teamspirit.</li>\n<li>Kreative Freiheit und den Raum, diese zu leben, ob remote oder bei uns im Office mit Blick über\nHannover.</li>\n<li>Exponentielle Lernkurve – BLVRD wächst rasant und das gleiche erwarten wir von dir. Du stehst nie\nstill, du wirst permanent gechallenged, lernst aus deinen Fehlern a la Fail Fast and Often.</li>\n<li>Ein top motiviertes Team, das dafür brennt, eine nachhaltige Alternative zum ,,Establishment“ der\nOnline-Pure-Player im Mode-Bereich zu bieten, ohne Paketmüll und Retouren.</li>\n</ul>\n<p>INTERESSE GEWECKT?\nDann steck deine Zeit nicht in ein Anschreiben, sondern schick uns deinen CV und Links zu deinen letzten Projekten an <a href=\"mailto:hello@blvrd.de\">hello@blvrd.de</a></p>\n",
      "how_to_apply": "<p>INTERESSE GEWECKT?\nDann steck deine Zeit nicht in ein Anschreiben, sondern schick uns deinen CV und Links zu deinen letzten Projekten an <a href=\"mailto:hello@blvrd.de\">hello@blvrd.de</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa09jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--80145599ed4c3ac326056a1f60c1a0c22bfcdb68/BLVRD%20Logo%20Schrift%202.png"
    },
    {
      "id": "9ae220e5-a889-493a-9523-0ecf39b89a03",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9ae220e5-a889-493a-9523-0ecf39b89a03",
      "created_at": "Fri Mar 12 09:15:59 UTC 2021",
      "company": "Torn Banner Studios",
      "company_url": "https://vonq.io/3ev8wVF",
      "location": "Toronto",
      "title": "Lead Programmer",
      "description": "<h2>Company Description</h2>\n<p>We're the studio behind the hit franchise Chivalry: Medieval Warfare. At Torn Banner we understand that long, hard hours are not conducive to being a happy, healthy person. Combine this idea with a flat studio structure and profit sharing and you've got ideals that promote a positive, low stress environment to help us create awesome games. As a small team of developers, each individual has a huge impact on the final product that we put out, so we put emphasis on being open with each other, giving/receiving critical feedback, and not letting an false sense of authority cloud our vision. The more eyes and input that we have from different disciplines and personality types, the better our releases will be.</p>\n<h2>Job Description</h2>\n<p>Torn Banner Studios is looking for a Lead Programmer to manage the programming team. The ideal candidate is passionate about providing high-level direction, supporting a team of engineers, and getting their hands dirty with day-to-day development.</p>\n<p>You are an accomplished engineer that enjoys collaborating closely with the engineering team to build a technically excellent game across multiple platforms.</p>\n<h2>Qualifications</h2>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Lead and manage a programming team at technical and personnel level</li>\n<li>Provide estimate time to complete programming task/objectives and be committed to meet them</li>\n<li>Help in setting up best practices for coding and conduct regular code reviews</li>\n<li>Encourage and help guide the creation of technical design documents</li>\n<li>Setup a process to review the game on a regular interval during development cycle and identify area of improvement</li>\n<li>Collaborate directors, designers and production to ensure efficient development practices</li>\n<li>Ensure that solid coding practices, technical briefs and code reviews are maintained</li>\n<li>Maintain regular internal communications and encourage a positive and ambitious team atmosphere</li>\n<li>Demonstrate good leadership, enthusiasm and sense of commitment</li>\n<li>Take responsibility for recruitment, on-boarding, development and professional training of the programming team</li>\n<li>Propose solutions to improve the development of projects in the studio</li>\n<li>Maintain a strong understanding of multiplayer FPS games</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Proficiency in C++</li>\n<li>At least 5 years professional video game programming experience</li>\n<li>A strong and efficient communicator with excellent management skills</li>\n<li>A bachelor's degree in Computer Science, Software Engineering, or equivalent.</li>\n<li>Previous leadership/mentorship experience, or leadership interest and potential</li>\n<li>A good knowledge of programming languages and software engineering practices</li>\n<li>Experience developing AAA titles on multiple platforms</li>\n<li>Experience with Unreal Engine 4 or other large engines</li>\n<li>Comfortable wandering around unexplored game design territory, and excited to help refine ideas i-into shippable features</li>\n</ul>\n<p><strong>Bonus</strong></p>\n<ul>\n<li>Previous experience as a Lead Programmer on a shipped game</li>\n<li>Previous experience in small/medium sized development studios</li>\n</ul>\n<h2>Additional Information</h2>\n<p><em>Portfolio and résumé required for any application.</em></p>\n<p>Benefits &amp; Perks</p>\n<ul>\n<li>Profit sharing</li>\n<li>4 weeks Paid vacation</li>\n<li>A no crunching policy</li>\n<li>Relocation assistance</li>\n<li>Flexible schedule</li>\n<li>Weekly happy hour</li>\n<li>Healthcare &amp; benefits</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://vonq.io/3ev8wVF\">Click here for the application form!</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalNjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--349a9542c9ff7207b95dfa4546cbccfd58273968/torn%20banner.jpg"
    },
    {
      "id": "2f4a4132-7625-4364-b22f-c5db175e8ede",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/2f4a4132-7625-4364-b22f-c5db175e8ede",
      "created_at": "Fri Mar 12 08:42:30 UTC 2021",
      "company": "Politie",
      "company_url": "http://www.politie.nl",
      "location": "Odijk",
      "title": "Lead software engineer",
      "description": "<p><strong>lead software engineer</strong></p>\n<p>Het doel van het Programma Vernieuwend Registreren? Een landelijk platform realiseren waar al onze applicaties voor agenten op straat samenkomen. Met als resultaat: nog effectievere opsporing en handhaving. Als lead software engineer bouw je vanuit Odijk mee aan dit platform en focus je op het refactoren, innoveren en upgraden van de applicaties. Zo draag je bij aan een veiliger Nederland.</p>\n<p><strong>Wat ga je doen?</strong>\nJe hebt een belangrijke rol in het tot stand brengen en up and running houden van het operationeel platform van de politie. Een flinke klus, want het platform telt ruim 50.000 gebruikers en combineert veel gegevens. Denk aan digitale informatie over aangiftes, executie en signalering, boetes, veroordelingen, straffen en daderinformatie. Mede dankzij jouw inzet kunnen agenten die gegevens snel en via hun mobiel verkrijgen. Zo verbeter je het opsporings- en handhavingsproces.</p>\n<p>Samen met je team pas je nieuwe technieken toe en ontwikkel en beheer je applicaties. Jullie zijn ook (mede)verantwoordelijk voor het ontwikkelen, realiseren, uitdragen en bewaken van de visie op het platform. Zo vormen je collega’s en jij de technische basis waarop ook andere IT-developmentteams software kunnen bouwen. Doen er zich complexe problemen voor? Dan lossen jullie die op. Daarbij maak je onder andere gebruik van reactive programming.</p>\n<p>De ene dag werk je aan generieke componenten en de andere dag buig je je over een complex framework. Daarnaast geef je inhoudelijke support aan collega-developers. Je ontwikkelt de domain-specific language waarmee de featureteams Resource Description Framework-data kunnen ophalen, aanmaken én manipuleren. Verder werk je met backend-engineers aan de communicatie tussen client en backend via REST-services en WebSockets. Je zorgt er te allen tijde voor dat je code onderhoudbaar en goed getest is, zodat anderen er optimaal gebruik van kunnen maken.</p>\n<p><strong>Waar ga je werken?</strong>\nJe werkt in het Productiehuis van de Dienst ICT. Hier ontwikkelen multidisciplinaire DevOps-teams snel en flexibel nieuwe functionaliteiten voor de operationele politiediensten. Binnen het Productiehuis maak jij deel uit van het Platformteam. Dit bestaat uit vijftien hardwerkende en gepassioneerde mensen van verschillende leeftijden. Zo is de jongste 33 en de oudste 64. Negen posities zijn extern opgevuld, maar we willen graag meer interne kandidaten verwelkomen om de kennis te borgen. Waar we heel blij van worden? Nieuwe technologieën benutten! Verder is het goed om te weten dat het weleens kan voorkomen dat je buiten kantoortijd wordt opgeroepen. Het werk van de politie gaat immers 24/7 door.</p>\n<p><strong>Wie ben jij?</strong>\nEen IT-professional met liefde voor het vak. Je bent nieuwsgierig en constant op zoek naar mogelijkheden om nieuwe technologieën in te zetten. Daarnaast houd je ervan om resultaten te boeken en stel je jezelf regelmatig de vraag: hoe kan dit nog beter? Jouw creatieve ideeën deel je graag. Bovendien ben je een echte teamspeler en pas je je gemakkelijk aan wanneer de situatie daarom vraagt. Verder heb je:</p>\n<ul>\n<li>een hbo-diploma in de richting van ICT;</li>\n<li>minimaal vier jaar relevante ervaring als core clientside-engineer;</li>\n<li>minimaal twee jaar relevante ervaring met TypeScript;</li>\n<li>kennis van Angular 2+, Node.js en RxJS;</li>\n<li>kennis van Gang of Four (GoF) en reactive programming design patterns.</li>\n</ul>\n<p><strong>Wat wij bieden</strong>\nDe standplaats is Odijk. Er is ruimte voor 1 fte. Het betreft een functie voor 36 uur per week. Omdat goede mensen belangrijk zijn binnen de politie investeren we in jouw toekomst. We bieden uitgebreide ontwikkelingsmogelijkheden en een vaste aanstelling, waarbij een proeftijd van één jaar van toepassing is.</p>\n<p>Verder kun je het volgende van ons verwachten:</p>\n<ul>\n<li>een bruto maandsalaris van minimaal € 3.502,- en maximaal € 5.228,- (schaal 11 Bbp) op basis van een 36-urige werkweek;</li>\n<li>8% vakantie- en 8,33% eindejaarsuitkering;</li>\n<li>goede pensioenregeling en betaald ouderschapsverlof (<a href=\"https://kombijde.politie.nl/vakgebieden/arbeidsvoorwaarden\">meer info over verlof, regelingen en mogelijkheden</a>).</li>\n</ul>\n<p>De formele functie binnen het functiegebouw van de politie is <a href=\"https://kombijde.politie.nl/binaries/content/assets/academie/lfnp/lfnp61.pdf\">bedrijfsvoeringspecialist C</a>, werkterrein informatie- en communicatietechnologie.</p>\n",
      "how_to_apply": "<p>Neem contact op met Donja Huidar, Recruiter ICT als je meer informatie over de functie wilt hebben via 06 - 18 63 45 09 of <a href=\"donja.huidar@politie.nl\">donja.huidar@politie.nl</a></p>\n<p>Solliciteer uiterlijk 24 maart 2021 via de <a href=\"https://kombijde.politie.nl/vacatures/lead-software-engineer_2633669.html?utm_source=adveronline&amp;utm_medium=paid&amp;utm_content=vacature-alert&amp;utm_campaign=niet-initieel-lead-software-engineer&amp;utm_term=44266\">sollicitatiebutton</a>.</p>\n<p><strong>Wat verder belangrijk is</strong>\n•\tEen veiligheidsonderzoek P maakt deel uit van de selectieprocedure.\n•\tZonder IT'ers zijn we nergens. Ben jij expert in IT? Lees alles over o.a. data science, legaal hacken of cybersecurity en test je digitale skills in de Cybercrime challenge op <a href=\"https://it.kombijdepolitie.nl/?_ga=2.153183736.194516751.1615447825-1788394226.1615447825\">it.kombijdepolitie.nl</a>\n•\tDe politie zet in op vernieuwing en cultuurverschillen binnen teams. Divers samengestelde teams presteren beter. Daarom werken we hard aan een open en veilige cultuur waarin divers talent tot bloei komt</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTZjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9488e22cbaa07d19ea02ddc2329a8421594f96e8/logo%202021%20blauw.jpg"
    },
    {
      "id": "3c8c0c1b-d7df-4dd6-93c1-bc556d97d06b",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/3c8c0c1b-d7df-4dd6-93c1-bc556d97d06b",
      "created_at": "Thu Mar 11 22:51:47 UTC 2021",
      "company": "ONENIGMA",
      "company_url": "http://www.onenigma.com",
      "location": "Remote (United States)",
      "title": "Android Software Engineer (Remote)",
      "description": "<p>Onenigma is a fully remote, flexible, ultra-casual, and forward-thinking software studio that works on new concepts, projects, and products we care about with people and companies we strongly believe in. Onenigma has worked with various companies over the years like AirBnB, Cognito, Udacity, Bloom, Tranche, Peapod, as well as many more to build new concepts and ideas. We always have liked to fly under the radar by building products used by millions around the world without seeking attention, because we simply really enjoy making cool and intuitive things.</p>\n<p>This position focuses on both Android and occasionally web stacks. We work with leaders in the cryptocurrency, finance, and emerging technology spaces to deliver high impact products that have served as the backbone for many industries. This position will expose you to a number of different products, fields, and concepts that require adaptive thinking. This position also allows for you to work on an idea or hobbyist project alongside company projects. We are a constantly evolving company, always looking to take unorthodox approaches to new ideas and ventures and love working with people who think the same way.</p>\n<p>You will:</p>\n<ul>\n<li>Work closely with designers and engineers to be solely responsible for maintaining existing and creating new Android libraries and applications</li>\n<li>Create cutting-edge front end user experiences that everyone actually​ enjoys using</li>\n<li>Learn new technologies and practices required to stay up to date with the latest developments and security requirements</li>\n</ul>\n<p>You have:</p>\n<ul>\n<li>2+ years of prior experience developing/releasing Android applications in Kotlin and Java</li>\n<li>Understanding of Android framework components and their lifecycles</li>\n<li>Prior experience working with product, design, and other developers to create strong products</li>\n<li>Experience with test-driven development</li>\n<li>Strong communication skills</li>\n<li>Ability to self-manage time and development targets</li>\n<li>Open-mindness and adaptability to shifting to new products or\npriorities</li>\n<li>Desire to improve on existing skills and learn new ones</li>\n</ul>\n<p>Bonus points:</p>\n<ul>\n<li>Some prior experience with Full-Stack Development</li>\n<li>Experience with React</li>\n<li>Strong sense of design, both big picture and nano details</li>\n<li>Prefer simple solutions over complicated ones</li>\n<li>Have a desire to work on products in a variety of different industries\nfrom cryptocurrency to insurance, and even identity verification\ntechnologies</li>\n<li>Enjoys participating in occasional banter about things like life,\nhobbies, and crypto</li>\n<li>Some history working in a fully remote environment</li>\n</ul>\n<p>Perks:</p>\n<ul>\n<li>Close knit, family-like work culture</li>\n<li>Fully and indefinitely remote</li>\n<li>Unlimited vacation days</li>\n<li>Completely flexible working hours and work schedule</li>\n<li>Top coverage health insurance</li>\n<li>Life insurance</li>\n<li>Dental insurance</li>\n<li>Vision insurance</li>\n<li>Visa sponsorship</li>\n</ul>\n<p>Onenigma is an equal opportunity employer and participates in the US Federal E-Verify program.</p>\n",
      "how_to_apply": "<p>Please email your resume to <a href=\"mailto:apply@onenigma.com\">apply@onenigma.com</a>!</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ae7b41a3a946274ba472e4cc0bfaf27a0792d2c0/Animated%20Logo-Round.png"
    },
    {
      "id": "d322291e-81a5-4eac-abd7-c53e9769e172",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/d322291e-81a5-4eac-abd7-c53e9769e172",
      "created_at": "Thu Mar 11 21:07:11 UTC 2021",
      "company": "Aryaka Networks",
      "company_url": "http://www.aryaka.com",
      "location": "San Mateo/US Remote",
      "title": "Full Stack Developer",
      "description": "<p>Who are we – Aryaka, the Cloud-First WAN company, brings agility, simplicity and a great experience to consuming the WAN-as-a-service. An optimized global network and innovative technology stack delivers the industry’s #1 managed SD-WAN service and sets the gold standard for application performance. Aryaka’s SmartServices platform offers connectivity, application acceleration, security, cloud networking and insights, leveraging global orchestration and provisioning. The company’s customers include hundreds of regional and global enterprises including several in the Fortune 100.</p>\n<p>You will have -\nBachelor's degree in Computer Science or similar\n5-8 years of experience as a full stack developer\nYou will definitely possess these technical skills –</p>\n<p>Experience developing web applications in modern frameworks (Vue/React)\nExcellent knowledge in Java (1.8)\nUnderstanding of functional programming\nWorking experience in Hibernate, Spring\nExperience in building REST based API\nWorking knowledge of modern CSS features, JavaScript (ES6) syntax and HTML\nCSS frameworks such as bootstrap\nGood understanding of SCSS\nKnowledge in version control systems (e.g., SVN, GIT)\nGood for you to have –</p>\n<p>Familiarity with TypeScript\nMessage queue\nGraphing libraries like D3js or similar\nHave working knowledge of network protocols.\nKnowledge in SD-WAN space\nBird’s eye view of your role –</p>\n<p>Build high quality web application using the modem frameworks like VUE/React.\nScale distributed applications, write code, and deliver with speediness and quality.\nOwn the front-end development and collaborate with User Experience Designers and Product Managers and build world-class UI experience.\nProduce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration\nParticipate in code and design reviews to maintain our high development standards\nDebug production issues across services and multiple levels of the stack\nCollaborate with cross-org teams across the company.</p>\n<p>What will you bring –\nAbility to work in a fast-paced technology environment\nDrive to solve problems and propose recommendations</p>\n<p>What are your performance objectives –</p>\n<p>Write well-crafted, well-tested, readable, maintainable code\nParticipate in code reviews to ensure code quality and distribute knowledge\nWork in an agile development environment, coordinating with other internal and external teams to help ensure proper workflows throughout the entire application experience\nWork closely with the UX and product team to understand the requirements\nHow will your lofty goals be translated into specific actions / short term goals –</p>\n<p>With the first 30 days, you will learn about Aryaka in depth and understand the technology and the codebase of the application</p>\n<p>Within the first 90 days, you will have started working on the product and churning out features</p>\n<p>What’s in it for you? (EVP – Employee Value Proposition) –</p>\n<p>Work for a global, fast-growing SD-WAN innovator\nBe a part of a company culture that embraces diversity and inclusivity\nAryaka was named one of the INC. magazines best places to work for 2020</p>\n",
      "how_to_apply": "<p><a href=\"https://app.jobvite.com/j?cj=o9hAefwY&amp;s=GitHub_Jobs\">https://app.jobvite.com/j?cj=o9hAefwY&amp;s=GitHub_Jobs</a></p>\n<p>or email resume directly: <a href=\"mailto:patti.lopez@aryaka.com\">patti.lopez@aryaka.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--be84511ba32d4c427aa7768ae635bfd1b38a010b/image001.png"
    },
    {
      "id": "98c56b9d-9e5d-4d81-976d-654fca160023",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/98c56b9d-9e5d-4d81-976d-654fca160023",
      "created_at": "Thu Mar 11 20:36:04 UTC 2021",
      "company": "Nearsure ",
      "company_url": "https://www.nearsure.net/",
      "location": "Latin America ",
      "title": "Java/Scala Developer ",
      "description": "<p>Who We Are</p>\n<p>We are a growing start-up with amazing opportunities!</p>\n<p>Nearsure was created to help US-based companies augment their software development teams efficiently. By being remote-first and connecting with developers across Latin America, we can access top tech talent while keeping a lean organizational structure.</p>\n<p>Our reach spans thousands of IT professionals, with skills in multiple industries and technologies. We have a fully distributed team working remotely from Argentina, Bolivia, Colombia, Costa Rica, Ecuador, Mexico, Peru and Uruguay and we want to keep expanding all over Latin America!</p>\n<p>Role Description</p>\n<p>We are looking for a Senior Java/Scala Developer to work from home for a challenging project in the US. You will be joining the team of a company who connects the world’s leading organizations with qualified suppliers, contractors, and vendors</p>\n<p>The successful candidate will collaborate in our client SaaS Analytics platform and will be responsible for developing and delivering new components and features for the platform</p>\n<p>This is a remote, full-time position with a 40-hours workload per week for Latin America only.</p>\n<p>Job Responsibilities:</p>\n<p>Work with product management and dev team to design, develop and deliver product features and enhancements\nDesign/develop customer workflows.  Ensure solution is scalable and can handle large data, complex analytics and multiple users\nAutomate testing and deployment of software so team can deliver enhancements to customers on a regular cadence</p>\n<p>Education/Experience:</p>\n<p>Bachelor Degree in Computer Science or equivalent\n3+ years of experience with modern languages such as Java/C#/JavaScript/Scala\nKnowledge of Scala/functional programming a significant plus\nExperience in cloud automation\nExperience in test driven development\nAbility to work effectively in a distributed, collaborative, agile environment and deliver solutions on a regular cadence</p>\n<p>What We Offer</p>\n<p>Work from home, with flexible working schedules\nCompetitive salary in USD\nPaid time off (annual leave, National holidays, sick time and parental leave)\nTake part in challenging projects for distributed companies in the US\nIntegrate a growing team with great opportunities for professional growth and a friendly, multicultural environment with a great company culture.\nA tailor-made benefits package focused on health, wellbeing, entertainment, training, and personal finances available for you to choose what you really care about</p>\n<p>We are a fully distributed, multicultural start-up looking for the best talent in Latin America. Don’t hesitate to apply if you feel you are a good fit for this position!</p>\n",
      "how_to_apply": "<p>Email: <a href=\"mailto:dayana.ramirez@nearsure.net\">dayana.ramirez@nearsure.net</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHVjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--59858438b9f123193ebea8e28e30bb2cdc00e83b/logo%20ns.jpg"
    },
    {
      "id": "903a33a6-1089-48c3-9618-0b1d6c2cb278",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/903a33a6-1089-48c3-9618-0b1d6c2cb278",
      "created_at": "Thu Mar 11 15:26:07 UTC 2021",
      "company": "Rewind",
      "company_url": "https://rewind.com/",
      "location": "Remote within Canada",
      "title": "Senior Full Stack Software Developer (Remote within Canada)",
      "description": "<p>Senior Full Stack Software Developer</p>\n<p>About Rewind</p>\n<p>Rewind is a service that protects the data that is driving your business, from a simple side hustle to a successful venture. Our focus is on backing up data that lives in the cloud – in apps like Shopify, BigCommerce, and QuickBooks Online. We invite you to read our startup story to learn where we came from and where we’re going. For a more technical view, check out our Behind the App feature on the BigCommerce Developers Blog.</p>\n<p>We care about honesty, we believe in learning from our mistakes, and we support each other as we grow.</p>\n<p>ABOUT THE JOB</p>\n<p>The development team at Rewind is made up of four small teams of 2 to 3 people; these people work together, collaboratively, to build new features and functions for our amazing customers.</p>\n<p>In broad terms, each member of the team is responsible for the following:</p>\n<ul>\n<li>Collaborating with other members of the development team to derive the best possible design to meet requirements</li>\n<li>Implementing, testing, documenting, and maintaining back-end systems for multiple high-traffic services</li>\n<li>Providing constructive feedback in the form of code and design reviews</li>\n<li>Looking for ways to improve our development and deployment processes</li>\n<li>Ensuring security and performance of our products</li>\n</ul>\n<p>Day to day, you will work alongside other members of the team to bring new features to our growing list of services. Rewind is a large system made up of several components that all interwork in harmony. Some ideas we have in the backlog that have not made their way into our services include user management, action auditing, anomaly detection, dynamic reporting, exporting, trend analysis, real-time data translation, copy…</p>\n<p>Developing reliable, securable, scalable, supportable code is a must. You will help put out some fires, especially the ones you accidentally created (we are big on accountability, you break it, you fix it), including incident response and remediation, but your main focus will be the reliability and robustness in all the things you help build. Less-flammable apps; fewer smouldering embers; automated fire suppression.</p>\n<p>Here are some real examples of the work we’ve done lately that might help you to get a better idea of what this job entails:</p>\n<ul>\n<li>Adoption of Shopify’s new versioned API - this one keeps us in business!</li>\n<li>Support for Shopify’s new bulk APIs; this cut our operating costs (fewer servers) and increased the speed of our backups.</li>\n<li>Rewind Copy for QuickBooks; #1 feature request for QuickBooks customers, move your data from here to there and make it easy.</li>\n<li>Rewind API (version 1); services that want to power data resiliency in their apps with Rewind can now do so.</li>\n<li>Hooking Hubspot into various areas of our product to capture customer events for sales/marketing.</li>\n<li>Addressing multiple code and database scaling challenges in the processing of daily backups for our American BigCommerce customers.</li>\n<li>Adding support for new entry level pricing plans that required creating limitations in product functionality.</li>\n<li>Implementing a new first time user experience features to <a href=\"https://app.rewind.io\">https://app.rewind.io</a>.</li>\n<li>Upgrading all applicable components from Rails 5 to Rails 6.</li>\n<li>Enhancements to our administrative interface (the one that support, sales, and marketing rely on) to bundle customers, change billing plans, and cancel subscriptions.</li>\n<li>Aggregating Webhooks with DynamoDB and SQS Delay Queues</li>\n</ul>\n<p>ABOUT YOU</p>\n<p>You are a perfect match for this role if you’re someone who possesses:</p>\n<ul>\n<li>Great troubleshooting and analytical skills, you’re an exceptional communicator, you have prior experience building or maintaining Ruby on Rails-based applications, and you have a curious mind for how things work and what makes them tick.</li>\n<li>You should enjoy making complicated situations simple and painless. You should be a stellar communicator, even when you have to communicate less-than-stellar news. You should have highly tuned senses of compassion and empathy and a drive to constantly help others.</li>\n<li>You must be proficient in REST and GraphQL APIs, JavaScript, HTML, CSS, SQL, Linux, and major browser development tools. You should be well-versed in AWS, source control management (preferably Git), Docker, and one of either Ruby or Python.</li>\n<li>You might have a CS degree. You might not. That’s not what we’re looking for. We care about what you can do and how you do it, not about how you got here. A strong track record of conscientious, thoughtful work speaks volumes.</li>\n</ul>\n<p>We strongly encourage candidates of all different backgrounds and identities to apply. Each new hire is an opportunity for us to bring in a different perspective, and we are always eager to further diversify our company. Rewind is committed to building an inclusive, supportive place for you to do the best and most rewarding work of your career.</p>\n<p>Experience comes in many forms, many skills are transferable, and passion goes a long way. If your background is close to what we’re looking for, please consider applying, even if you aren’t able to check every box above. We are dedicated to diversity and providing an inclusive workplace for all and especially encourage members of underrepresented groups to apply.</p>\n",
      "how_to_apply": "<p><a href=\"https://rewind.bamboohr.com/jobs/view.php?id=22&amp;source=aWQ9MTM%3D\">https://rewind.bamboohr.com/jobs/view.php?id=22&amp;source=aWQ9MTM%3D</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaE9jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--22d19ce2a66725ec5e968cefbb9d439d6721edfc/Rewind%20New%20Logo_Rewind%20New%20Logo.png"
    },
    {
      "id": "660d4512-cfdd-4c45-832d-4cd456b6ca37",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/660d4512-cfdd-4c45-832d-4cd456b6ca37",
      "created_at": "Thu Mar 11 15:18:54 UTC 2021",
      "company": "Kellen",
      "company_url": "https://www.kellencompany.com/",
      "location": "Atlanta, GA",
      "title": "Full-Stack Web Developer",
      "description": "<p>General Purpose of the Position</p>\n<p>Kellen is seeking a full-stack web developer who is an expert on user-facing and back-end technologies and best practices, including creating WordPress themes and plugins. Using a combination of programming skills (e.g., PHP, HTML5, CSS3, and JavaScript) and aesthetics (understanding element arrangements on the screen, the color and font choices, etc.) the Web Developer creates and maintains sites for Kellen and its clients.  This individual must be able to effectively translate design prototypes into fully functioning responsive websites.</p>\n<p>Essential Functions</p>\n<p>-Manages the design and implementation of responsive websites from initial concept, site -architecture, and user interface to finished deliverable.\n-Codes and implements WordPress sites from Photoshop layout through html/CSS to a custom theme, functions, and plugins.\n-Design and implement new features, enhancements, and content of existing websites.\n-Create and update re-usable code libraries to streamline WordPress development cycle.\n-Facilitate client WordPress training, site documentation and maintenance.\n-Design interfaces and graphics for presentations and mobile-delivered applications.\n-Assesses existing sites/systems for code quality and interactive appeal.\n-Estimate the level of effort of development sites or for individual site features and provides proposals to clients.\n-Manages trouble tickets, such as bugs or requests for site changes.\n-Manages client invoice/billing process.\n-Manages domain registrations and invoices/billings.\n-Assist with new business and client-renewal growth efforts; develops proposals and participates in pitch meetings.\n-Maintains Kellen’s corporate website and intranet.\n-Other duties that align with the mission and vision of the company.</p>\n<p>Qualifications:\nRequired:</p>\n<p>-2+ years of experience with PHP 7.2 or higher\n-2+ years of experience with C#/asp.net (.net 4.5+ and .net Core)\n-Familiarity with MVC development\n-Demonstrated ability with Git version control\n-Experience programming within CMS platforms (WordPress, Drupal, DNN, Kentico, etc.)\n-Experience with Responsive Design Frameworks such as Bootstrap, Foundation, etc.\n-Experience programming against web APIs\n-Javascript/JQuery/CSS/SASS\n-Excellent written and verbal communication skills\n-Ability to work with a remote team and effectively manage time\n-Must provide a portfolio of recent projects\n-Must provide code samples (C# and PHP)</p>\n<pre><code>   Preferred:\n</code></pre>\n<p>-Experience with React, Angular, NodeJS or similar Javascript frameworks\n-IIS 7+ web server administration\n-LAMP web server administration\n-Experience with member management systems (Impexium, MemberClicks, iMIS)\n-Experience with non-profit associations</p>\n<p><strong>Due to COVID-19, the position will be fully remote initially, but will transition to the Kellen Atlanta office once that office re-opens.  At that point, the developer will work from the office a minimum of 4 days per week, with the opportunity for one day of remote work per week.  After an initial review period, there may be opportunity to increase the number of remote work days.</strong></p>\n<p>Working at Kellen\nThis role is based in Kellen’s Atlanta office. Kellen employees enjoy competitive compensation and full benefits packages including 12 U.S. holidays plus generous accrued PTO, retirement plans with company match, medical/dental/vision insurance, tuition reimbursement, flexible work schedules, and much more. The successful candidate will join a collegial, diverse and friendly atmosphere of communications, management and public affairs professionals working hard to turn our client missions into reality.</p>\n<p>Travel Requirements\nTravel may be necessary, up to 20% of the time and may be by travel by air, car, or rail.</p>\n",
      "how_to_apply": "<p>Please email your resume and desired salary to <a href=\"mailto:mschuster@kellencompany.com\">mschuster@kellencompany.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e40c665113d391e3914b08f8393bcd50b7a641b8/Kellen%20logo.png"
    },
    {
      "id": "9eab3335-79db-4524-b91c-a65fb48916e5",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9eab3335-79db-4524-b91c-a65fb48916e5",
      "created_at": "Thu Mar 11 14:18:48 UTC 2021",
      "company": "FTL Labs Corp",
      "company_url": "http:",
      "location": "Amherst MA USA - Remote",
      "title": "Engineering Software Developer",
      "description": "<p>ABOUT THE POSITION:</p>\n<p>FTL Labs Corporation is seeking a full-time Engineering Software Developer with technical software development skills for desktop and Android platforms to address specific challenges relative to a contract program with the US Navy. Relevant skills include the following:</p>\n<p>C#, WPF, C++, SQL, Python\nMachine vision, image processing, and target recognition\n3D graphics, modeling, transforms, and visualization\nMathematical modelling and algorithms (MATLAB, R)\nMachine learning, neural nets, AI\nDatabase and cloud architectures\nVisualization and manipulation of large data sets\nPhotogrammetry, point clouds, and digitization of physical environments\nSelf-motivated and goal oriented\nFun and easy to work with in a dynamic team</p>\n<p>Bachelor's degree or its equivalent with a minimum of 5 years of experience. Due to the nature of our work for the U.S. Government, we are required to hire U.S. Citizens. This position will work on an exciting 12 to 18-month program with the US Navy that employs cutting-edge image acquisition, 3D modeling, and artificial intelligence to solve maintenance and readiness challenges. Remote work is an option.</p>\n<p>$62,000 to $95,000 Annually\n401K, Dental, Life, Medical\nFull-Time</p>\n<p>FTL Labs continues to work from home primarily during COVID restrictions and could be acceptable generally.</p>\n<p>FTL Labs is in the vibrant intellectual community of western Massachusetts, close to the University of Massachusetts flagship campus and Amherst College. Pay is commensurate with experience. We offer competitive compensation and benefits, including excellent health and dental coverage, short- and long-term disability, life insurance, profit-sharing, and 401k with employer contribution. During the COVID public health emergency all FTL employees are telecommuting, and we look forward to returning to our office in Amherst when we can ensure it will not endanger the health or safety of our staff.</p>\n<p>APPLICATION INSTRUCTIONS:</p>\n<p>Please email your resume and 3 references (at least 2 professional contacts) to <a href=\"mailto:kristie@ftllabscorp.com\">kristie@ftllabscorp.com</a> and <a href=\"mailto:mike@ftllabscorp.com\">mike@ftllabscorp.com</a>.</p>\n<p>ABOUT FTL LABS:</p>\n<p>FTL Labs Corporation is a tight-knit association of Ph.D. scientists and seasoned engineers who work to develop next-generation software and technology products to solve problems for government and industrial clients. FTL personnel have participated in Phase I, Phase II, and Phase III Small Business Innovation Research (SBIR) programs through the National Science Foundation, Department of Defense, and NASA, and we strive to transition these technologies to the market. We frequently collaborate with both academic and industry leaders, such as UMass Amherst, Northrop Grumman and Sikorsky. Our work demonstrates innovative thinking in a team setting across a wide range of fields and specialties,  including:</p>\n<ul>\n<li>Machine learning, neural nets, and artificial intelligence</li>\n<li>Expertise in optics, ultrasound, image analysis, robotics, and life sciences</li>\n<li>Big data analysis, virtual and augmented reality</li>\n<li>Custom software solutions</li>\n</ul>\n<p>FTL Labs is an affirmative action-equal opportunity employer; veterans are encouraged to apply.</p>\n<p>We comply with all applicable federal, state and local laws regarding recruitment and hiring. All qualified applicants are considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other category protected by applicable federal, state, or local laws.</p>\n<p>If you are a creative self-starter, technically innovative, and have excellent writing skills, we want to hear from you!</p>\n",
      "how_to_apply": "<p>Please email your resume and 3 references (at least 2 professional contacts) to <a href=\"mailto:kristie@ftllabscorp.com\">kristie@ftllabscorp.com</a> and <a href=\"mailto:mike@ftllabscorp.com\">mike@ftllabscorp.com</a>.</p>\n",
      "company_logo": null
    },
    {
      "id": "f3fd85f2-c142-424b-9a9f-eb7eac864279",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/f3fd85f2-c142-424b-9a9f-eb7eac864279",
      "created_at": "Thu Mar 11 13:45:59 UTC 2021",
      "company": "Farmy AG",
      "company_url": "https://www.farmy.ch",
      "location": "Barcelona",
      "title": "Junior Android Developer (Kotlin, Java)",
      "description": "<p>We are happy to invite you to join our Android development team at the Farmy IT Department headquaters in Barcelona, Spain.</p>\n<p>Farmy develops and runs a transparent and regional food retail platform which connects customers with farmers’ product supplies directly. When you place an order with Farmy, you get fresh food, which on the same day was collected at the farmyard, right to your doorstep or your favorite cafe – a thing, no conventional retail chain can give you. Our customers love eating healthy and fresh food, and with over 10,000 products on sale in our catalog, we do try to satisfy their appetite with every update.</p>\n<p>Our company is growing rapidly, after five successful years on the Swiss market, preparing for expansion and we’re hiring.</p>\n<p><strong>Tasks</strong></p>\n<ul>\n<li>Maintenance and development of user and enterprise Android applications</li>\n<li>Participation in user experience design</li>\n<li>Implementation of tests</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Written and spoken English</li>\n<li>Kotlin, Java and JVM knowledge</li>\n<li>Experience with Android SDK</li>\n<li>Familiarity with Android app building blocks</li>\n<li>Have published at least one original Android app</li>\n<li>Experience working with remote data via REST and JSON.</li>\n<li>Practical knowledge of the general mobile best practices, architecture, trends, and emerging technologies</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>A great learning curve from day 1 on which will go beyond just Android</li>\n<li>One day a week work from home (we're 100% remote for the duration of the state of emergency)</li>\n<li>Free gym abo</li>\n<li>An annual budget for books and courses</li>\n<li>Work at a company which puts excellence and customer satisfaction at the first place</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://farmy.join.com/jobs/1949438-junior-android-developer-kotlin-java?pid=24ab8afa01f084c85dce&amp;oid=3495185f-255e-4dc0-98e2-efc9f26b82bc&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=junior%2Bandroid%2Bdeveloper%2Bkotlin%2Bjava\">https://farmy.join.com/jobs/1949438-junior-android-developer-kotlin-java?pid=24ab8afa01f084c85dce&amp;oid=3495185f-255e-4dc0-98e2-efc9f26b82bc&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=junior%2Bandroid%2Bdeveloper%2Bkotlin%2Bjava</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzZjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d98041604c97bd121c5eec213c474328b6d7c589/farmy.png"
    },
    {
      "id": "dd0d94c7-9d31-476c-9fa5-add91f6d4ef1",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/dd0d94c7-9d31-476c-9fa5-add91f6d4ef1",
      "created_at": "Thu Mar 11 10:52:02 UTC 2021",
      "company": "Smart Pricer GmbH ",
      "company_url": null,
      "location": "Berlin",
      "title": "Senior Full Stack Developer - (m/f/d) ",
      "description": "<p>Smart Pricer is the leading ticket pricing company in Europe. We offer pricing services in the areas of sports, entertainment and ski resorts and are proud to work with partners such as FC Bayern Munich, DFB, Hertha BSC, Sölden ski resort, Zermatt Bergbahnen and many more. Our work is characterized by entrepreneurial thinking, effective transaction management and innovative solutions. We owe our success as one of the world's leading specialists in our field not least to a distinctly team-oriented approach.</p>\n<p>Together we want to grow further and are therefore looking for a</p>\n<p>Senior Full Stack Developer - (m/f/d)</p>\n<p>to support us as soon as possible.</p>\n<p>With us, you are part of a committed and motivated team that rethinks the way pricing is done with a lot of enthusiasm and drive from Berlin. If you want to take on responsibility from day one and drive our mission forward with your own ideas, then your application is just right with us.</p>\n<p>Your Responsibilities:</p>\n<ul>\n<li>Within the first three months, you will familiarize yourself with our existing services (you have   access to documentations and team members)</li>\n<li>You will lead and own the development of our back-end pricing services incl. the design and deployment of APIs to run our services</li>\n<li>Your responsibilities will range - from rapidly building prototypes in product discovery phase, to delivering reliable quality products in delivery phase, to developing our tech architecture further ensuring functionality, scalability, reliability and security (a hands-on mind-set and strategic oversight are essential for this)</li>\n<li>You will define the technical requirements of the company in detail and set up all required processes</li>\n<li>In 6-9 month time you will start to build and manage a small technical team of A-players (including software engineers, data scientists)</li>\n<li>Together with the founders you and your team will continuously iterate our product by developing hypotheses, validating them (e.g. through user research and tests) and shipping new features</li>\n<li>You own the operative KPIs tech and will be the voice of tech in all strategic decisions</li>\n<li>You oversee the monitoring of our live pricing services</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Software Developer with a degree in a technical related field such as Computer Science, Bio/Informations or similar</li>\n<li>You have at least 3 years experience working in Software Development</li>\n<li>You are skilled in several backend languages (Go, Ruby) and in working with and deploying cloud services in a Unix environment</li>\n<li>Optionally you have some frontend experience in TypeScript and CoffeeScript as well as some data analytics background in Python</li>\n<li>You combine a strong hands-on-attitude (and are happy to develop and maintain code yourself) with strategic thinking and an entrepreneurial mindset</li>\n<li>You have a high focus on customer needs and contribute your best knowledge and experience about technology, products and processes</li>\n<li>You are interested in pricing, data mining, ML</li>\n<li>You are characterized by a sovereign appearance as well as good presentation and communication skills</li>\n<li>Your are fluent in English and German</li>\n</ul>\n<p>What We Offer:</p>\n<ul>\n<li>A friendly and respectful team with a family work culture</li>\n<li>A great workplace in Berlin Mitte with a part-time remote work option</li>\n<li>The chance to take over a large area of expertise very quickly and to make a steep entry into a management position</li>\n<li>An attractive compensation package</li>\n<li>Flexible working hours</li>\n<li>A secure employment relationship</li>\n<li>Meaning - our work has direct impact on sports and entertainment pricing across all of Europe</li>\n</ul>\n",
      "how_to_apply": "<p>We are happy to receiving your application by e-mail, stating your desired salary and earliest possible starting date, at: <a href=\"mailto:miriam.weber@smart-pricer.com\">miriam.weber@smart-pricer.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2ljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--42ba9c34dbd16b17bce10dd2e9fff25d2dd68507/Smart%20Pricer%20Logo.jpg"
    },
    {
      "id": "ae6276b5-d919-40a9-97b7-270ee8d95205",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/ae6276b5-d919-40a9-97b7-270ee8d95205",
      "created_at": "Wed Mar 10 22:31:41 UTC 2021",
      "company": "DISH",
      "company_url": "http:",
      "location": "Denver, CO",
      "title": "Senior API Developer",
      "description": "<p>DISH is a Fortune 250 company with more than $14 billion in annual revenue that continues to redefine the communications industry. Our legacy is innovation and a willingness to challenge the status quo, including reinventing ourselves. We disrupted the pay-TV industry in the mid-90s with the launch of the DISH satellite TV service, taking on some of the largest U.S. corporations in the process, and grew to be the fourth-largest pay-TV provider. We are doing it again with the first live, internet-delivered TV service – Sling TV – that bucks traditional pay-TV norms and gives consumers a truly new way to access and watch television.</p>\n<p>Now we have our sights set on upending the wireless industry and unseating the entrenched incumbent carriers.</p>\n<p>We are driven by curiosity, pride, adventure, and a desire to win – it’s in our DNA. We’re looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story.</p>\n<p>Opportunity is here. We are DISH.</p>\n<p>Primary responsibilities fall into the following categories:</p>\n<p>Design and develop API specifications using OpenAPI Specifications/YAML that is scalable and provide greater security on data.\nGood understanding of security protocols (e.g. OAuth, SAML)\nCreate build and deployment pipelines for APIs using appropriate tools to implement Continuous integration and continuous deployment.\nSupport end-end management of the APIs over its entire lifecycle\nWork with various application teams to understand their business needs and requirements for the API implementation\nEnsure API documentation is created and remains up to date\nEnsure code and design quality with appropriate logging, monitoring, tracing, and security standards in place\nHelp troubleshoot and resolve issues related to the API platform, API accessibility and API deployments\nCreate build and deployment pipelines for APIs using appropriate tools to implement Continuous integration and continuous deployment.\nA successful Senior API Developer will have:</p>\n<p>More than 6 years of experience in development, and implementation of enterprise-wide solutions based on Java Technologies (Java, J2EE, Webservices)\nAt least 3-5 years of hands on experience with design, development and implementation of Spring Boot, Spring Cloud, Spring Integration or Node.JS based Microservices\nExperience in Deploying Microservices (spring-boot, node's) on Docker, Kubernetes, etc.\nDemonstrated knowledge of test-driven development practices and experience with any of the version control tools such as GitLab, and Continuous Integrations with various CI/CD tools\nPerform root cause analysis for Production issues and come up with solutions that will prevent them from happening in the future\nGovernance, Event Driven Architecture, message-based architectures, and caching strategies and frameworks.\nParticipate and contribute in grooming technical user stories impacting integration Excellent analytical, oral, written communication and presentation skills with ability to interact with global delivery technical teams.\nExperience in Agile methodologies - Kanban or SCRUM\nCompensation: $86,400.00/Yr. - $120,200.00/Yr.</p>\n<p>From versatile health perks to new career opportunities, check out our benefits on our careers website.</p>\n<p>Employment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test.</p>\n<p>DISH endeavors to make <a href=\"http://careers.dish.com\">http://careers.dish.com</a> accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact <a href=\"mailto:accessibility@dish.com\">accessibility@dish.com</a>. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.</p>\n<p>We pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.</p>\n<p>Consistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.</p>\n",
      "how_to_apply": "<p>Apply Online at <a href=\"https://jobs.dish.com/jobs/53378?lang=en-us&amp;iis=&amp;iisn=&amp;utm_source=GitHub&amp;utm_medium=jobboard&amp;utm_campaign=Wireless&amp;utm_content=SrAPIDev+Denver\">https://jobs.dish.com/jobs/53378?lang=en-us&amp;iis=&amp;iisn=&amp;utm_source=GitHub&amp;utm_medium=jobboard&amp;utm_campaign=Wireless&amp;utm_content=SrAPIDev+Denver</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0NjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--13f4d37cd6d7c83bcb5f3f342fdc23e705a7a961/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"
    },
    {
      "id": "242d7658-0a4a-4d12-895f-f70a6eb88e10",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/242d7658-0a4a-4d12-895f-f70a6eb88e10",
      "created_at": "Wed Mar 10 20:49:25 UTC 2021",
      "company": "BlueVine",
      "company_url": "https://www.bluevine.com/careers/",
      "location": "Redwood City, CA",
      "title": "Senior Python Developer",
      "description": "<p>BlueVine is a high-growth fintech company empowering small businesses with innovative banking. By combining industry-leading technology and security with our team's expertise and care, we've helped 200,000+ businesses, funding more than $9 billion since 2013.</p>\n<p>Small businesses deserve accessible and modern financial services, and traditional banks have underserved them for too long. We're hiring problem solvers and collaborators to join our meaningful mission.</p>\n<p>Headquartered in Redwood City, CA, we've recently raised $102.5M and are backed by top investors, including Menlo Ventures, Lightspeed Ventures, Citi Ventures, SVB Financial, Nationwide Insurance, and M12.</p>\n<p>Our Redwood City engineering team is building BlueVine’s new banking product that is driving our next phase of growth. The market we’re going after is huge, and we’re just getting started.</p>\n<p>We're looking for a Senior Full Stack Engineer flexible enough to develop features from the front (beautiful UX) to the back (scalable and robust components and integrations). If you're drawn to engineering challenges and have a strong desire to make a big impact as part of a small, agile team, in an exciting space, we’d love to talk to you.</p>\n<p>WHAT YOU'LL DO:</p>\n<p>Fully own and independently drive the engineering development of complex features\nDesign and build state-of-the-art responsive banking applications\nProvide leadership and mentorship to teammates\nWork closely with, and incorporate feedback from product managers and other stakeholders in the company\nBe part of a fast-paced and highly-flexible team with the comfort of making decisions using your best judgement\nDevelop projects through their entire life cycle\nWHAT WE LOOK FOR:</p>\n<p>5+ years of combined back and front end experience building fast, reliable, web and/or mobile applications (preferably with Python backends)\nExperience with Web frameworks (e.g., Angular, React, or Vue) and/or mobile development (e.g., Native, Native Script, React)\nExperience with source control management systems, preferably Git\nExperience with AWS, GPC, or Azure\nB.S. in Computer Science or a related field\nNice to have:</p>\n<p>Experience with AWS, cloud deployments, DevOps, and web security\nBENEFITS &amp; PERKS:</p>\n<p>Receive over $1,000 annually for a wellness benefit of your choice\nMonthly WFH Stipend\nGenerous PTO and holidays\nExcellent health coverage and life insurance benefits\nGenerous, paid parental leave which covers up to 15 weeks\n401K with an immediate 3% company match\nOnce we Return to Office:</p>\n<p>Commuter benefits - CalTrain passes for SF employees and a monthly parking allowance\nWeekly catered lunches\nUnlimited snacks in fully stocked kitchens\nPet-friendly HQ</p>\n",
      "how_to_apply": "<p>Apply via link below;\n<a href=\"https://boards.greenhouse.io/bluevine/jobs/4189284003\">https://boards.greenhouse.io/bluevine/jobs/4189284003</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmFiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ff732d86bdcc83ff9e68b0dbe72163020869f06e/bluevine-leaf-rgb.png"
    },
    {
      "id": "85f49b29-5845-4154-bf1a-5bf842419f1e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/85f49b29-5845-4154-bf1a-5bf842419f1e",
      "created_at": "Wed Mar 10 15:56:16 UTC 2021",
      "company": "Wolfe.com LLC",
      "company_url": "http://wolfe.com",
      "location": "Pittsburgh Pa",
      "title": "Senior DevOps Engineer",
      "description": "<p>We’re looking for a strong engineer to:</p>\n<ul>\n<li>Own the AWS infrastructure of our 3 core properties, including Dockerized ECS and more standard EC2 based systems, while working with a small team</li>\n<li>Liason with our development teams, information security personnel, and card printing facility personnel to satisfy their various requirements</li>\n<li>Understand and act as a backup for the infrastructure of a small manufacturing facility</li>\n</ul>\n<p>Wolfe:\nWolfe, LLC is a successful e-commerce company in Pittsburgh, PA.  We are a high-performance fintech and online e-commerce company with a specialization on the $250 billion gift card market.  We formerly owned GiftCards.com and grew the largest online gift card site in the world before selling it in 2016.  We are re-building again under the new brands PerfectGift.com, GiftCardGranny.com and GiftYa.com and improving on what we built in the past.\nAll team members embody our cherished core values of integrity, drive, teamwork and caring.  Our achievements include the first coupon website in 1995 which sold to a public company in 2000 when we were delivering 20 million-page views per month at the peak of the dot-com era.  We then built Direct Response Technologies – grew to 70 employees and sold to Digital River in 2006.  We spun off Jambo Media with our tech team and sold it to Undertone in 2012.  We next built GiftCards.com to 100 employees and in 2016 sold it to (then NASDAQ:HAWK) Blackhawk Network.\nOur in-house and contact center teams are searching for the next top performing leader to help deliver world-class service for our consumer and corporate clients. We deliver an extremely attractive client value proposition in an industry of very few competitors.\nCompany and Executive Team Recognitions:</p>\n<ul>\n<li>2011 Best places to work in Pittsburgh Finalist</li>\n<li>2011 Ernst &amp; Young Entrepreneur of the Year Award Winner</li>\n<li>2011 CFO of the Year Finalist</li>\n<li>2011 CIO of the Year Finalist</li>\n<li>2013 Governors Impact Award Winner</li>\n<li>2014 Entreprenuer.com Nationwide Entrepreneur of the Year Finalist</li>\n<li>2015 CEO of the Year Winner Pittsburgh Technology Council</li>\n<li>2015 Create Award Winner for Marketing</li>\n<li>2015 Business Times Diamond Award Winner</li>\n<li>2015 Business Ethics Award Winner</li>\n<li>2017 Outstanding Entrepreneur Award Winner by the Pittsburgh Venture Capital Association</li>\n<li>2019 Carnegie Science Award Recipient, Entrepreneur Category</li>\n<li>2020 Top 10 Best Places to Work by Pittsburgh Business Times</li>\n</ul>\n<p>The Opportunity\nWolfe’s infrastructure is hosted in AWS and is made up of several Dockerized and EC2 based services. We support multiple API layers, administration and partner portals, websites, native apps, and more. Additionally, we have a PCI certified card plastics printing facility located in Green Tree, PA.\nDuties</p>\n<ul>\n<li>Handle the management and ongoing maintenance requirements of multiple AWS accounts along as part of a small team</li>\n<li>Working with the property developers to migrate current EC2 workloads to ECS Fargate</li>\n<li>Setting and implementing infrastructure standards</li>\n<li>Documentation, CI/CD, and monitoring</li>\n<li>On call rotation</li>\n<li>You’ll also be acting as a backup for the card printing facility infrastructure. This infrastructure is a PCI Card Production compliant network, utilizing similar technologies to our AWS properties.\no\tPlease note: This position is NOT geared toward general IT/Help Desk\nRequirements</li>\n<li>3-5 years working with AWS, AWS Solutions Architect is a plus</li>\n<li>3 years working with Linux</li>\n<li>1 year docker experience\nTelosGifting Technology Stack\nThis is what powers our various properties. You don’t need direct experience in everything, but you’ll be working next to all of these technologies:</li>\n<li>AWS ECS, EC2, RDS</li>\n<li>MySQL, Redis, Rabbit</li>\n<li>Cloudflare</li>\n<li>Sumologic</li>\n<li>PHP, Symfony</li>\n<li>Bitbucket Pipelines</li>\n<li>Ansible, Terraform</li>\n</ul>\n<p>Ideal Skillset</p>\n<ul>\n<li>Proven ability to plan projects, work independently, and liaison with technical and non-technical personnel</li>\n<li>Experience with containerization, application monitoring, and performance evaluation</li>\n<li>Experience with any modern web development framework (Rail/Django/Symfony/etc) is a plus</li>\n<li>Basic security certifications and PCI experience are a plus\nCompensation &amp; Benefits/Perks</li>\n</ul>\n<p>Compensation includes a competitive base salary, incentives, plus participation in company sale proceeds (10-15% in total go to employees on sale or profit).\nWolfe, LLC is committed to providing its employees with a benefits package providing flexibility that ensures a healthy life/work balance.  The great benefits and perks, include:</p>\n<ul>\n<li>Medical, Prescription, Vision and Dental</li>\n<li>Generous Paid Time-Off policy</li>\n<li>Profit-sharing (Incentive Stock Plan) our employees have earned over $16m through this program since 2006</li>\n<li>11 holidays</li>\n<li>Tuition Reimbursement</li>\n<li>Employee Recognition Program</li>\n<li>Charitable Donation to a Charity of YOUR Choice yearly ($250)</li>\n<li>Refer Friends, and if we hire them you get awarded (up to $1,000)</li>\n<li>Family Picnic, Holiday Party, and other employee outings</li>\n<li>On-site dry-cleaning pick-up service</li>\n<li>Flex-time Scheduling and a Telecommute Policy</li>\n<li>No cubicles, everyone gets a desk</li>\n<li>Private Health Advisory Policy for Employee and Dependents</li>\n<li>Brown bag sessions to keep you informed on the company/industry</li>\n</ul>\n<p>If this position excites you, we urge you to apply!\nWolfe, LLC is an Equal Opportunity Employer.\nWolfe, LLC does not sponsor individuals for the purpose of obtaining H-1 Visas.</p>\n",
      "how_to_apply": "<p><a href=\"mailto:jobs@wolfe.com\">jobs@wolfe.com</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkdiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ad77badc79a2c42a15179df02e3b0387c666128f/wolfe.png"
    },
    {
      "id": "fbbecb42-2cb7-434c-b80b-0a9e906d1484",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/fbbecb42-2cb7-434c-b80b-0a9e906d1484",
      "created_at": "Wed Mar 10 14:21:40 UTC 2021",
      "company": "Prisma",
      "company_url": "http://www.prisma.io",
      "location": "Remote",
      "title": "VP of Engineering",
      "description": "<p>At Prisma we are building the data layer for modern applications. If you are fascinated by the software that power large technology companies such as Twitter, Airbnb and Facebook but want the challenges, freedom and ownership of a young startup, then Prisma might be the right place for you.</p>\n<p>During the course of the past year our bottom-up adoption strategy has started to produce very exciting results. We have seen highly encouraging levels of developer adoption and community growth, setting us on the path to become the dominant NodeJS ORM within 12 months.</p>\n<p>These results and feedback from our community enable us to start the next phase of our journey - building a commercial proof and strategy for Prisma. We have tens of thousands of developers currently using Prisma, with hundreds of thousands of NPM downloads per week. Some of these are large enterprises such as Accenture, Tryg, Algolia, Rapha and Microsoft.</p>\n<p>To help us with the above we are looking to bolster our engineering leadership at Prisma by hiring a VP of Engineering to lead our engineering teams through this transition and beyond.</p>\n<h3>What would you do at Prisma?</h3>\n<p>The VP of Engineering will be responsible for managing the engineering teams, with all managers and teams reporting to them.</p>\n<p>Your responsibilities as the VP of Engineering includes:</p>\n<ul>\n<li>Take key responsibility for engineering teams to incrementally build and deliver value to users and customers.</li>\n<li>Collaborate closely with major functions (product, marketing, design, operations) in the company to ensure engineering teams are working on the right things for the right reasons.</li>\n<li>Work with the CEO to maintain and evolve the technical vision and strategy and the team structures to support them.</li>\n<li>Create and exemplifies a healthy and inclusive and inclusive work environment for engineering teams to work and participate in.</li>\n<li>Actively work to identify and remove bottlenecks within the organisation within Engineering and beyond.</li>\n<li>Key technical focus of the role is debugging organisations and processes and to find solutions to make engineering teams more productive, effective, or unblocks them.</li>\n<li>Build and retain a diverse engineering team.</li>\n<li>Create hiring plans in line with organisational needs and budgets.</li>\n<li>Focus the engineering teams on delivering features in line with Prisma's business, product, and engineering strategy.</li>\n<li>Establish, maintains and advocates the engineering culture within the engineering organisation and across Prisma.</li>\n<li>Ensures that technical and architectural decisions across the engineering organisation are done within the frameworks and by bridging the technical with the business needs of the organisation.</li>\n<li>Implement feedback, review, and promotion processes across the engineering organisations to help all people in their teams advance in their career and in accordance with the company framework.</li>\n</ul>\n<h3>What are the requirements?</h3>\n<ul>\n<li>5+ Years in Senior Engineering Management positions, comfortable with working in and building a remote-first team.</li>\n<li>Deeply passionate about investing in people and growing them to become the best versions of themselves.</li>\n<li>Successful track-record of building, retaining, and scaling an engineering team in a start-up or fast growing organisation.</li>\n<li>Strong technical experience in modern technology stacks (our language is Rust but learning on the job is perfectly fine).</li>\n<li>Experience working in a Developer Tools company would be a benefit, but not a hard requirement.</li>\n</ul>\n<h3>What's it like to work at Prisma?</h3>\n<p>You're likely to be a great fit for the team if you ...</p>\n<ul>\n<li>\n<strong>... have an ownership mindset.</strong> As part of a young startup and as the VP of Engineering, you'll have an outsize impact on decisions and the way things are executed. This will include influence over the direction of the company, hiring plans, budget and more.</li>\n<li>\n<strong>... stay nimble.</strong> As a growing startup, the team and strategy evolves quickly. Be ready to re-calibrate often and stay flexible.</li>\n<li>\n<strong>... be kind and collaborative.</strong> Come in ready to share your ideas and listen to feedback.</li>\n</ul>\n<h3>What's in it for you?</h3>\n<ul>\n<li>Opportunity for large global impact working on one of the fastest growing open-source tools and help guide the team on it's new commercial journey.</li>\n<li>Have the opportunity to own Engineering at Prisma and build out the team to take the department and company forward.</li>\n<li>Work in full-distributed, remote-first organisation where work-life balance is celebrated and promoted.</li>\n<li>We provide a <strong>Competitive Base Salary</strong> in line with industry standards for similar positions.</li>\n<li>As an early-stage startup we also provide competitive <strong>Stock-Option Grants.</strong>\n</li>\n<li>\n<strong>24 Days paid vacation</strong> per year.</li>\n<li>[US] Health, Dental, Vision + 401k Matching</li>\n<li>\n<strong>Generous Tech Budget</strong> to make sure you have all the hardware that you need.</li>\n</ul>\n<h3>Remote Work</h3>\n<p>We are a remote-first organisation with an office based in Berlin, Germany. Whether you would like to work remotely, or from the office in Berlin is up to you! We are open to discussing relocation assistance if you would like to join us in Berlin.</p>\n<p>Although we are a fully remote and distributed team, for operational reasons we can currently only consider candidates that currently live, or intend to move to the timezone GMT -8 to GMT +3.</p>\n<p><em>Note on COVID-19:</em> The above opportunity to move to Berlin is temporarily suspended until we believe that travel is safe again.</p>\n<h3>What is our hiring process like?</h3>\n<ul>\n<li>\n<em>Introductory Call</em> with someone from the Talent Acquisition team.</li>\n<li>\n<em>First Interview</em> with the VP of Product</li>\n<li>\n<em>Second Interview with the</em> VP of Design</li>\n<li>\n<em>Round of Interviews</em> with some of the Engineers at Prisma that you will be working with.</li>\n<li>\n<em>Round of Interviews with the</em> Leadership Team</li>\n<li>\n<em>Final Interview</em> with the CEO.</li>\n<li><em>Offer</em></li>\n</ul>\n<p>The above serves as a basic outline, we might choose to add or remove steps based on the information that we gather during the process.</p>\n<p>If you believe that this is the right position for you then please send your resume along with any supporting documentation or information to us via the link provided on this page. We typically respond within 7 business days.</p>\n\n<p><em>Prisma is an equal opportunity employer and does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity, age, marital status, veteran status, or disability status.</em></p>\n",
      "how_to_apply": "<p>Please visit the job page and apply: <a href=\"https://grnh.se/7a75739f2us\">https://grnh.se/7a75739f2us</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTZiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d57d176d931d2b968a2328557ed8b31b4a00346c/Square%20Logo%20Small%20Prisma.png"
    },
    {
      "id": "35de12a3-33bb-494a-abee-e35217e246b7",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/35de12a3-33bb-494a-abee-e35217e246b7",
      "created_at": "Wed Mar 10 09:56:56 UTC 2021",
      "company": "SYNAOS GmbH",
      "company_url": "https://synaos.com/",
      "location": "Hannover",
      "title": "(Senior) Backend Developer (m/f/d)",
      "description": "<p>SYNAOS is a software start-up founded in 2018 in Hanover. We develop an ecosystem for the orchestration of intralogistics with a focus on autonomous, mobile robotics.</p>\n<p><strong>We offer</strong></p>\n<ul>\n<li>Fast growing, top financed start-up with highly motivated and extremely ambitious colleagues</li>\n<li>Challenging tasks in developing our software platform with cutting-edge AI optimization methods and modern, scalable cloud technologies for autonomous robotics applications</li>\n<li>Pioneering work in intralogistics for the factory and logistics centre of the future</li>\n<li>With Volkswagen a DAX group as a first customer</li>\n<li>Creative working environment with short decision-making processes (founders in the same office)</li>\n<li>Bright, newly designed offices in the heart of Hannover and good coffee from a sieving machine :)</li>\n<li>Choice of hardware and operating system</li>\n<li>Unlimited employment contracts and 30 vacation days</li>\n<li>Flexible working hours with home office</li>\n<li>Competitive salaries and a development budget of 1.200 Euro per year</li>\n</ul>\n<p><strong>Your mission</strong></p>\n<ul>\n<li>Creation of an enterprise-capable and integrated SYNAOS ecosystem based on Java to control production and logistics</li>\n<li>Integration of different technologies and systems in the backend environment</li>\n<li>Implementation of agile software development (cooperation in SCRUM-teams, description of technical tasks and realization of user stories, automatic testing)</li>\n<li>Use of technologies and tools like IntelliJ, GitLab, Jira, Java, Spring Boot, Kafka, Maven, REST, Messaging, PostgreSQL, Docker, AWS</li>\n<li>Enthusiastic team orientation and good communication with developers, product owners and users of the software</li>\n</ul>\n<p><strong>Your Values</strong></p>\n<ul>\n<li>Structured working (clean code)</li>\n<li>Open-minded for new technologies</li>\n<li>Customer focus</li>\n<li>Teamwork</li>\n</ul>\n<p><strong>What you bring</strong></p>\n<p>Abilities</p>\n<ul>\n<li>Several years of experience in backend development, Java Enterprise environment or several years of professional experience in another object-oriented programming language</li>\n<li>Programming and recording in English</li>\n<li>Experience in developing software in a team</li>\n</ul>\n<p>Personality</p>\n<ul>\n<li>Reliability, Independence</li>\n<li>Solution orientation</li>\n<li>„Get things done“ attitude</li>\n</ul>\n<p>Attitude, values</p>\n<ul>\n<li>Communication and capacity for teamwork</li>\n<li>Understanding software as craftmanship</li>\n<li>Structured working method</li>\n</ul>\n<p>Contact person:</p>\n<p>SYNAOS GmbH\nFrank Löffler\n+49 172 7617662\n<a href=\"mailto:join-us@synaos.com\">join-us@synaos.com</a></p>\n<p><img src=\"https://camo.githubusercontent.com/bc7582304a923aaed5f57a6382fa234856019ceb/68747470733a2f2f742e676f686972696e672e636f6d2f682f32363763393035386564666439356439356164356233626539393438376661613930306635353630613739373437386432613731633838616437346161616436\"></p>\n",
      "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/f64e42e383577c5f71d53130e6b2273cc493ed782dc72140377c76d89b2cd0ed\">application form</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXFiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--945d567a97e1387089a82789249c415e8735a528/SYNAOS%20GmbH.jpg"
    },
    {
      "id": "03f4b538-8cd2-44f9-b07d-9bad6021eba4",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/03f4b538-8cd2-44f9-b07d-9bad6021eba4",
      "created_at": "Wed Mar 10 09:44:07 UTC 2021",
      "company": "Price Intelligence GmbH",
      "company_url": "https://priceintelligence.net",
      "location": "Remote",
      "title": "Team Lead Development (M/W/D)​ E-Commerce-SaaS-Solution",
      "description": "<p>Reinvent Retail Business with us!</p>\n<p>Tag für Tag erfinden wir bei priceintelligence Retail Business neu, mit der Power von Künstlicher Intelligenz, Automatisierung und vor allem Daten. Um unsere Ziele zu erreichen, suchen wir Kollegen, die uns genau dabei helfen. Denkst du, dass du zu uns perfekt passt? Dann werde Teil unseres Teams...</p>\n<p><strong>Das erwartet dich bei uns:</strong></p>\n<ul>\n<li>Du übernimmst die fachliche und disziplinarische Führung eines 11-köpfigen Teams, bestehendaus erfahrenen Java-Entwicklern</li>\n<li>Du steuerst die Aktivitäten rund um die Implementierung der Enterprise-SaaS-Lösungpriceintellingence und stimmst die Weiterentwicklungspläne mit unterschiedlichen Stakeholdern wie Product Owner, Kunden, Vertrieb sowie Geschäftsführung in Bezug auf die Lösungsarchitektur ab</li>\n<li>Du verantwortest die strategische und langfristige Planung unserer Technologie-Stacks</li>\n<li>Du gibst strategischen Input zur Produktweiterentwicklung</li>\n<li>Du untersützt Onboarding-Projekte für Neukunden in Bezug auf die technische Integration</li>\n</ul>\n<p><strong>Das bringst du mit:</strong></p>\n<ul>\n<li>Du hast mindestens 5 Jahre Berufserfahrung als Developer</li>\n<li>Du bringst mindestens 1 bis 2 Jahre Erfahrungen in der Leitung eines Temas mit</li>\n<li>Du besitzt Kenntnisse in modernen SaaS-/Cloud-Architekturen und Entwicklungswerkzeuge, wie Java, Java Script, Hibernate, NoSQL, MQ</li>\n<li>Idealerweise hast du auch schon erste Erfahrungen und Knowhow im Bereich SaaS, E-Commerce und Machine Learning / Data Science / Data Analytics</li>\n<li>Du hast Erfahrung mit großen Datenmengen und deren Transfer</li>\n<li>Zu deinen Stärken zählt ein hohes Qualitäts- und Verantwortungsbewusstsein</li>\n<li>Du bist offen, kommunikativ und ein echter Teamplayer</li>\n<li>Sehr gute Deutsch- und gute Englischkenntnisse runden dein Profil ab</li>\n</ul>\n<p><strong>Das bieten wir dir:</strong></p>\n<ul>\n<li>Ein erfolgreiches und hoch motiviertes internationales Team</li>\n<li>Großartige, zukunftsweisende Projekte bei internationalen und bekannten Kunden im Enterprise Segment</li>\n<li>Exzellente Weiterentwicklungsmöglichkeiten in einem schnell wachsenden, modernem Unternehmen mit tollen Konditionen und mit der Möglichkeit zukünftig eine tragende Rolle im Management- oder auch Gesellschafter-Team einzunehmen</li>\n<li>Zusammenarbeit mit Experten in einer flachen Hierarchie und kurze Kommunikationswege</li>\n<li>Persönlicher Freiraum und die Möglichkeit Verantwortung zu übernehmen, deine eigenen Ideen zu teilen und umzusetzen</li>\n<li>Work-Life-Balance, flexible Arbeitszeitmodelle und variable, Remote-Arbeitsorte\nEinfach mehr als nur ein Job!</li>\n</ul>\n<p>Du verlierst nie das Detail aus dem Auge? Hast immer das Große und Ganze im Blick? Du beherrschst die Sprache der Softwareentwickler? Du bist auf der Suche nach einem jungen, agilen und dynamischen Arbeitsumfeld, das du innovativ mitgestalten möchtest? Dann bist du bei uns genau richtig! Starte durch mit priceintelligence und bewirb dich jetzt!</p>\n",
      "how_to_apply": "<p><a href=\"https://priceintelligence.join.com/jobs/1964922-team-lead-development-m-w-d-e-commerce-saas-solution?pid=357a3b4531918760973f&amp;oid=fe47f14d-ae44-49dd-947a-6d8bc6b023bd&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=team%2Blead%2Bdevelopment%2Bm%2Bw%2Bd%2Be-commerce-saas-solution\">https://priceintelligence.join.com/jobs/1964922-team-lead-development-m-w-d-e-commerce-saas-solution?pid=357a3b4531918760973f&amp;oid=fe47f14d-ae44-49dd-947a-6d8bc6b023bd&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=team%2Blead%2Bdevelopment%2Bm%2Bw%2Bd%2Be-commerce-saas-solution</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdWliIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f483fa601ced49443e816247be425def85b87a5d/priceintelligence.jpg"
    },
    {
      "id": "95ad4dcc-2d1c-481e-b6f2-930d5eda70f4",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/95ad4dcc-2d1c-481e-b6f2-930d5eda70f4",
      "created_at": "Tue Mar 09 23:45:39 UTC 2021",
      "company": "DISH",
      "company_url": "http:",
      "location": "Englewood, CO",
      "title": "Software Developer in Test (SDET)",
      "description": "<p>At DISH, our technology teams challenge the status quo and reimagine capabilities across industries. From product development to software design to big data and beyond, our people play vital roles in connecting consumers with the products and platforms of tomorrow.</p>\n<p>#LI-HT1</p>\n<p>High-level job responsibilities:</p>\n<p>DISH Wireless is looking for a Software Developer Engineer in Test to support its products and services through agile software development in DGC, CO. In this role:</p>\n<p>Developing innovative approaches, techniques, and solutions in the areas of Automation, Performance Engineering, Continuous Testing, Continuous Delivery, Service Virtualization, Shift Left, BDD, TDD, etc.\nAnalyzing how systems are being tested manually and identifying opportunities to reduce that time and effort through Automation</p>\n<p>Day-to-day job responsibilities</p>\n<p>Designing and creating robust automated test scripts and software to address business and technical use cases.\nMaintaining, supporting and extending our existing automation framework and automation suite, and development of greenfield testing frameworks.\nCollaborating with Software Engineering Leaders, Project Managers, Product Managers, and others to ensure smooth integration of Quality Engineering solutions into the SDLC (Agile preferred)\nResearching and staying up to date on the latest tools, technologies, trends, and approaches within the QE space and incorporating the ones that make sense.\nParticipating in troubleshooting and triaging of issues with different teams to drive towards root cause identification and resolution\nParticipating in design and code reviews, refactor code as needed to meet evolving design standards, participate in or lead engineering process improvements.\nHigh-level qualifications:</p>\n<p>A strong passion for quality, high level of attention to detail, and the proven ability to solve complex technical challenges\nExtensive experience applying Quality Engineering techniques across the SDLC to improve the quality of systems and enable the ability to deliver quality at speed.\nA Bachelor’s degree in Computer Science, Information Technology, or equivalent\nWireless communications industry experience (T-mobile, Verizon, AT&amp;T, Cricket etc.) ideal but not required</p>\n<p>Specific qualifications:</p>\n<p>A minimum of 4 years of diverse experience designing, developing, and implementing Test Automation solutions across a variety of platforms and applications.\nExperience with CI/CD pipeline engineering and maintenance using tools like: Gitlab CI, Jenkins, Cirlce CI, Travis CI, etc.\nExperience testing REST APIs\nExperience testing an exterprise product catalog is a plus\nExperience with XML and JSON\nAWS experience\nKnowledge of Agile progress and best practices (Kanban, Scrum)\nCompensation: $85,905.00/Yr. - $136,190.00/Yr.</p>\n<p>From versatile health perks to new career opportunities, check out our benefits on our careers website.</p>\n<p>Employment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test.</p>\n<p>DISH endeavors to make <a href=\"http://careers.dish.com\">http://careers.dish.com</a> accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact <a href=\"mailto:accessibility@dish.com\">accessibility@dish.com</a>. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.</p>\n<p>We pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.</p>\n<p>Consistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.</p>\n",
      "how_to_apply": "<p>Apply online at <a href=\"https://jobs.dish.com/jobs/54059?lang=en-us&amp;iis=&amp;iisn=&amp;utm_source=GitHub&amp;utm_medium=jobboard&amp;utm_campaign=Wireless&amp;utm_content=SD+Test\">https://jobs.dish.com/jobs/54059?lang=en-us&amp;iis=&amp;iisn=&amp;utm_source=GitHub&amp;utm_medium=jobboard&amp;utm_campaign=Wireless&amp;utm_content=SD+Test</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUdiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4b176a61bbeaf1b81cedaed55ac3eff5abc3138e/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"
    },
    {
      "id": "ab56aad0-a749-4eb4-850c-0c05c54dbe8f",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/ab56aad0-a749-4eb4-850c-0c05c54dbe8f",
      "created_at": "Tue Mar 09 23:42:32 UTC 2021",
      "company": "DISH",
      "company_url": "http:",
      "location": "Englewood, CO",
      "title": "Data Analyst - Retail Wireless",
      "description": "<p>DISH is a Fortune 250 company with more than $14 billion in annual revenue that continues to redefine the communications industry. Our legacy is innovation and a willingness to challenge the status quo, including reinventing ourselves. We disrupted the pay-TV industry in the mid-90s with the launch of the DISH satellite TV service, taking on some of the largest U.S. corporations in the process, and grew to be the fourth-largest pay-TV provider. We are doing it again with the first live, internet-delivered TV service – Sling TV – that bucks traditional pay-TV norms and gives consumers a truly new way to access and watch television.</p>\n<p>Now we have our sights set on upending the wireless industry and unseating the entrenched incumbent carriers. We are driven by curiosity, pride, adventure, and a desire to win – it’s in our DNA. We’re looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story.</p>\n<p>Opportunity is here.</p>\n<p>We are DISH.</p>\n<p>The DISH Wireless organization is looking for a Senior IT Data Analyst/ETL Developer to deliver large, complex data migration projects.  The candidate must have the ability to work in a fast paced and evolving environment where initial requirements are vague and evolving.  The ability to quickly understand the project goals and impacted systems and to independently seek out subject matter experts to define requirements and devise solutions will be critical.</p>\n<p>Responsibilities</p>\n<p>Work with various business and technical people to understand the systems, data sources, business goals, technical goals, timelines, and financial impacts of multiple data conversion projects.\nPerform deep analysis of the data in source and target systems in order to document detailed data mapping requirements.  This will involve analyzing data quality, data availability, and defining data transformations.\nUtilize ETL tools such as Informatica or other similar tools to perform data analysis and to code complex data migrations.  Focus on creating re-usable components to be leveraged on future conversions.\nDevelop detailed metrics related to all data migrations to report conversion progress and error rates.\nWork well in a team environment where knowledge and re-usable components are proactively shared.\nUtilize procedural programming language or scripting language skills to code the required data transformations.\n#LI-AJ1</p>\n<p>Required Skills</p>\n<p>Strong SQL skills are critical.\nExtensive experience working with relational database systems such as Oracle and SQL Server.\nExperience using an ETL tool such as Informatica or similar.\nExperience with a procedural programming language or scripting language.\nMust be very proficient with Microsoft excel.\nStrong organizational skills and the ability to communicate effectively (both in writing and verbally) to interact effectively with IT, business, and leadership is required. Strong collaboration and facilitation skills are extremely helpful.\nBachelor Degree in Computer Science, Information Systems Management, Engineering, or BS in related technical field, or equivalent amount of education and experience.\nAbility to parse files in various formats.</p>\n<p>Preferred Skills</p>\n<p>Experience working in the Wireless industry\nExperience with Informatica\nExperience with Cloud based systems such as Salesforce.com\n3-5 years of experience performing large scale data migrations</p>\n<p>Compensation: $85,905.00/Yr. - $136,190.00/Yr.</p>\n<p>From versatile health perks to new career opportunities, this role provides all the benefits you need to be</p>\n<p>successful. Check them out on our careers website.</p>\n<p>Successful completion of a pre-employment screen, to include a drug test, criminal background check and Motor Vehicle Record.</p>\n<p>DISH endeavors to make <a href=\"http://careers.dish.com\">http://careers.dish.com</a> accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact <a href=\"mailto:accessibility@dish.com\">accessibility@dish.com</a>. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.</p>\n<p>We pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.</p>\n<p>Consistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.</p>\n",
      "how_to_apply": "<p>Apply online - <a href=\"https://jobs.dish.com/jobs/53961?lang=en-us&amp;iis=&amp;iisn=&amp;utm_source=GitHub&amp;utm_medium=jobboard&amp;utm_campaign=Wireless&amp;utm_content=DA-Retail\">https://jobs.dish.com/jobs/53961?lang=en-us&amp;iis=&amp;iisn=&amp;utm_source=GitHub&amp;utm_medium=jobboard&amp;utm_campaign=Wireless&amp;utm_content=DA-Retail</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdCtiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fd41dda8e0c17055d38085e22ff6263b14ec7989/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"
    },
    {
      "id": "3bbc3285-1407-4092-ade0-c6353f5b12e6",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/3bbc3285-1407-4092-ade0-c6353f5b12e6",
      "created_at": "Tue Mar 09 23:39:04 UTC 2021",
      "company": "DISH",
      "company_url": "http:",
      "location": "Denver, CO",
      "title": "Senior Magento Developer",
      "description": "<p>DISH is transforming the future of connectivity. We’re doing it by building the country’s first virtualized, standalone 5G wireless network from scratch. The foundation of a connected world, it’s a network free of the limitations of the past, and flexible enough to satisfy all the social, economic and transformative needs of the changing world. Equipped with Boost Mobile and its 9 million customers as the newest part of the DISH brand, we’re setting our sights on competing in the prepaid and postpaid retail wireless market as the nation’s fourth facilities-based mobile carrier.</p>\n<p>We are driven by curiosity, pride, adventure, and a desire to win – it’s in our DNA. We’re looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story.</p>\n<p>Opportunity is here. We are DISH.</p>\n<p>This Magento Lead Developer will be working within the Retail Wireless team in our Dish Grand Central office located in Denver, CO. You will be working in a collaborative and fast-paced environment spanning the Retail Wireless team and broader Dish organizations.</p>\n<p>Your primary responsibilities will include:</p>\n<p>Develop Magento solutions that execute on our ambitious wireless vision.\nApprove and collaborate on development life cycle deliverables including wireframes, base styles, development / code, QA issues and resolution.\nReview developer code and project delivery to maintain and improve quality control and adherence to standards.\nCollaborate, contribute and review backend API standards with our backend teams.\nWork with other technical leads on platform technical design and architecture.\nPerform root cause analysis of production issues and implement recommendations.</p>\n<p>#LI-AJ1</p>\n<p>A successful Magento Technical Lead will have:</p>\n<p>Bachelor’s Degree in Computer Science or equivalent experience\n5+ years of experience in building solutions with Magento and or Magento 2.\n5+ years of experience with PHP and MySQL\nExperience working with modern front-end technology, CMS, mobile apps, e-commerce platforms and toolsets such as React, React Native, responsive frameworks, and single page applications\nStrong passion for producing elegant, maintainable, and reusable code\nAbility to effectively communicate across all departments in the organization from technical staff to executive stakeholders\nExperience working in an Agile environment and managing multiple dependencies and projects\nOptimized web server configurations and have experience scaling web applications for millions of users\nEnjoy participating in product development discovery and high level estimates and sizing.\nPreferred Skills\nYou will stand out if you have:\nMagento certification is a bonus\nInternet, telecom, cable, or satellite OSS/BSS business\nAdditional working experience with and or integrating other Adobe products with Magento.\nExperience managing small development teams\nCompensation: $86,400.00/Yr. - $120,200.00/Yr.</p>\n<p>From versatile health perks to new career opportunities, check out our benefits on our careers website.</p>\n<p>Employment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test.</p>\n<p>DISH endeavors to make <a href=\"http://careers.dish.com\">http://careers.dish.com</a> accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact <a href=\"mailto:accessibility@dish.com\">accessibility@dish.com</a>. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.</p>\n<p>We pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.</p>\n<p>Consistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.</p>\n",
      "how_to_apply": "<p>Apply Online at: <a href=\"https://jobs.dish.com/jobs/53639?lang=en-us&amp;iis=&amp;iisn=&amp;utm_source=GitHub&amp;utm_medium=jobboard&amp;utm_campaign=Wireless&amp;utm_content=SMD+Denver\">https://jobs.dish.com/jobs/53639?lang=en-us&amp;iis=&amp;iisn=&amp;utm_source=GitHub&amp;utm_medium=jobboard&amp;utm_campaign=Wireless&amp;utm_content=SMD+Denver</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDJiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--aa9aa6d269060ca9374f406ea081814874ac9e17/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"
    },
    {
      "id": "bbdb156d-19e5-43da-81c5-c19a5f4223b9",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/bbdb156d-19e5-43da-81c5-c19a5f4223b9",
      "created_at": "Tue Mar 09 19:10:53 UTC 2021",
      "company": "Nanny Nina",
      "company_url": "http://nannynina.com/",
      "location": "Amsterdam Netherlands",
      "title": "senior full-stack developer in Amsterdam ✨💻📱🤓🏆🥇🦸‍♂️🚲🧀",
      "description": "<p>Are you one of the best in what you do? Looking for a challenging job and willing to relocate to the Netherlands (Amsterdam)? We are currently looking for a top notch Full-stack engineer with at least 2 years of working experience, preferably more.</p>\n<p>Req: Laravel framework: Php,Javascript, Css, HTML,Vue, (switching to either tailwind or React).\nWe have a platform including app wrap, no native app, 1 codebase</p>\n<p>We are looking for somebody that would like to apply for a +-32/40 hour week job. But don’t worry about your freedom. We truly cherish entrepreneurship, freedom and working independently!! \nRelocating to the Netherlands within the first year you work with us is a requirement.\nBut we love 1 person to stay with us, so you are part of the team and can improve your work, constantly learning.  </p>\n<p>We will expand internationally this year, so we are looking for 2developers who can help us refactor code, and will build clean, well set-up features according to the UX/UI designs.  We are looking for somebody nearby Amsterdam. You work 2 days at the light and spacious office in Haarlem. Preferably you work more days at the office, but minimum 2 days. </p>\n<p>As our full-stack develop, you are part of a diverse team. You will be working collaboratively with Digital marketeers a Product Owner, 2 great Developers and Customer Succes to develop the full user experience. With energy, ambition and an lean clean code, you guide our users to and through the most smooth flows</p>\n<p> We are a fast growing, ambitious tech start-up, based with office in Haarlem perhaps you have seen as at the Dragons Den pitch, a show to gain investors in the Netherlands: <a href=\"https://www.npostart.nl/dragons-den/19-04-2020/POW_04630483\">https://www.npostart.nl/dragons-den/19-04-2020/POW_04630483</a> (At 36:25 for us) </p>\n<p>Are you or do you know someone with...\n✨ a passion for great products and code\n👀  a great eye for detail and structure\n🕵️‍♂️  a curious and ambitious mindset, eager to learn?</p>\n<p>  If you are curious and would like to apply, please fill in this assignment below . We want to make sure you are a great match with the team, and the best in what you do! \nLyla ( <a href=\"mailto:lylakok@nannynina.nl\">lylakok@nannynina.nl</a>  ) +31658752910</p>\n<p>Form to apply\n<a href=\"https://forms.gle/aMCDXfCtwiLFZN5x6\">https://forms.gle/aMCDXfCtwiLFZN5x6</a></p>\n",
      "how_to_apply": "<p>If you would like to apply, please fill in this assignment below . We want to make sure you are a great match with the team, and the best in what you do! \nLyla ( <a href=\"mailto:lylakok@nannynina.nl\">lylakok@nannynina.nl</a>  ) +31658752910</p>\n<p>Form:\n<a href=\"https://forms.gle/aMCDXfCtwiLFZN5x6\">https://forms.gle/aMCDXfCtwiLFZN5x6</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFNiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--377181418c713cf1bf8cf6d072baa9a3de444069/logo_rond_groen_RGB.png"
    },
    {
      "id": "6e8e7cf0-8e88-4ac7-8793-fa00e5b269c7",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6e8e7cf0-8e88-4ac7-8793-fa00e5b269c7",
      "created_at": "Tue Mar 09 17:43:07 UTC 2021",
      "company": "Agiloft Inc",
      "company_url": "http://www.agiloft.com",
      "location": "Czech Republic, Ukraine, Hungary, Russia",
      "title": "Junior EJB Developer (Remote)",
      "description": "<p><strong>THRIVE WITH AGILOFT</strong></p>\n<p>Are you a Java Developer who is successful, motivated, smart, energetic, and looking for a rewarding position in a growing, profitable, and dynamic company?</p>\n<p>Agiloft is looking for junior developers that thrive working in a fast-paced organization with interesting business challenges requiring smart solutions.</p>\n<p><strong>WHY JOIN AGILOFT?</strong></p>\n<ul>\n<li>\n<p>Agiloft was named the market leader in every category in the <a href=\"https://www.agiloft.com/flash/Gartner_critical_capabilities_for_CLM.pdf\">Gartner Critical Capabilities</a> for CLM report, and a market leader in the Gartner Magic Quadrant.</p>\n</li>\n<li>\n<p>Contract Lifecycle Management (CLM) is one of the fastest-growing areas of enterprise sales, with a TAM projected to climb from $2B to $7B in the next 5 years.</p>\n</li>\n<li>\n<p>The Agiloft Contract and Commerce Lifecycle Platform has won over a dozen awards, including the <a href=\"https://www.agiloft.com/awards.htm\">Editor's Choice award</a> from PC Mag, for the past five years in a row.</p>\n</li>\n<li>\n<p>Agiloft has a highly differentiated value proposition which is uniquely appealing to enterprises: pre-built applications with a deeply configurable, no-code platform for integrated Business Process Management throughout an organization.</p>\n</li>\n<li>\n<p>Agiloft is pioneering the applied use of Artificial Intelligence to enable next-generation business commerce at organizations ranging from small enterprises to U.S. government agencies and Fortune 100 companies.</p>\n</li>\n<li>\n<p>Agiloft is the only company in the industry with the confidence to provide an unconditional satisfaction guarantee, and you too will be successful with Agiloft.</p>\n</li>\n</ul>\n<p>As the leader in the CCLM market, Agiloft is winning many Enterprise deals and looking to hire the best talent to meet this demand with a competitive compensation plan that rewards overachievement.</p>\n<p><strong>Position Overview</strong></p>\n<p>The Java Developer creates user information solutions by developing, implementing, and maintaining Java-based components and interfaces. The Java Developer contributes to the entire development lifecycle, writes well-designed, testable, and efficient code and comprehensive unit tests.</p>\n<p>The Junior Java Developer assists the development team with all aspects of software design and coding. The Junior Java Developer's primary role is to learn the codebase, attend design meetings, write basic code, fix bugs, and assist the Development Manager in all software development-related tasks.</p>\n<p><strong>Job Responsibilities</strong></p>\n<ul>\n<li>Assisting the Development Manager with all aspects of software design and coding</li>\n<li>Learning the codebase and improving coding skills</li>\n<li>Writing the maintaining code</li>\n<li>Working on bug fixes</li>\n<li>Monitoring the technical performance of internal systems</li>\n<li>Responding to requests from the development team</li>\n<li>Writing reports and documentation</li>\n<li>Implementing unit tests</li>\n</ul>\n<p><strong>Required Qualifications</strong></p>\n<ul>\n<li>Computer Science degree or equivalent</li>\n<li>At least one year of post-graduate experience in Java development with J2EE</li>\n<li>Experience with J2EE, Tomcat, JBoss, and relational databases such as MySQL, MSSQL, Oracle</li>\n<li>Experience working on large software projects</li>\n<li>Deep understanding of OO programming principles and commitment to clean, efficient, well-documented code</li>\n</ul>\n<p><strong>Essential Skills</strong></p>\n<ul>\n<li>Ability to learn new software and technologies quickly</li>\n<li>Knowledge in Java development with J2EE, JBoss, and relational databases</li>\n</ul>\n<p><strong>BENEFITS AND PERKS</strong></p>\n<ul>\n<li>Competitive salary</li>\n<li>Referral bonuses</li>\n<li>Flexible work schedules</li>\n<li>Professional development and career growth opportunities</li>\n<li>Awesome team members</li>\n</ul>\n<p><strong>To Apply</strong>:</p>\n<p>To complete an application for immediate consideration visit:<a href=\"https://tinyurl.com/v8m9f6cd\">www.agiloft.jobs/JrJavaDev</a></p>\n",
      "how_to_apply": "<p>To complete an application for immediate consideration visit:<a href=\"https://tinyurl.com/v8m9f6cd\">www.agiloft.jobs/JrJavaDev</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEtiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3e66cf27794f2ba34d4a16bd60194bee5fb6e506/Agiloft%20Logo%20plain%20(Indeed).png"
    },
    {
      "id": "1af1762c-5e0b-4378-893c-de1a84d7ff93",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/1af1762c-5e0b-4378-893c-de1a84d7ff93",
      "created_at": "Tue Mar 09 14:38:55 UTC 2021",
      "company": "Hrmony GmbH",
      "company_url": "https://www.digitale-essensmarken.de",
      "location": "Remote",
      "title": "Frontend Architect (m/w/d)",
      "description": "<p>Wir suchen Dich als <strong>Frontend Architect (m/w/d)</strong>, um unser Produktportfolio zu vereinheitlichen und zu erweitern. Du übernimmst in dieser Rolle die Weiterentwicklung der Frontend-Architektur verschiedener Web-Anwendungen und des gemeinsamen API Layers.</p>\n<p>Du entwickelst performante und robuste Features im Frontend mit Fokus auf Server Side Rendering und Progressive Enhancement. Du erstellst Coding Guidelines und Style Guides, UI Pattern Libraries und dokumentierst skalierbare und wiederholbare Development Workflows, die anderen Teammitgliedern als Arbeitsgrundlage dienen. Zusammen mit Backend Development, UI Design und Product Management erarbeitest Du regelmäßig gemeinsame Lösungen und trägst mit Deiner fachlichen Expertise wesentlich zum nachhaltigen Erfolg bei.</p>\n<p><strong>Aufgaben</strong></p>\n<ul>\n<li>Weiterentwicklung und Konzeption der Frontend-Architektur und des API Gateway Layers</li>\n<li>Konzeption und Dokumentation von RESTful Hypermedia APIs (HTML und JSON-basiert)</li>\n<li>Weiterentwicklung des Authentifizierungs-Layers</li>\n<li>Weiterentwicklung einer PWA mit Service Worker</li>\n<li>Implementierung von Produkt-Features und Bibliotheken im Frontend, die unter Anwendung von Server Side Rendering und Progressive Enhancement die Möglichkeiten von modernen Browsern nutzen</li>\n<li>Entwicklung und Dokumentation von ganzheitlichen Development-Prozessen unter Einbeziehung von - Coding Standards, Developer Experience, Testing, Deployment und Asset Delivery</li>\n<li>Befähigung und Onboarding von Frontend Developern</li>\n<li>Kontinuierliche Zusammenarbeit im Enwicklungs-Team und mit dem Product Management</li>\n</ul>\n<p><strong>Qualifikation</strong></p>\n<ul>\n<li>Mindestens fünf Jahre Erfahrung in relevanten Positionen (z.B. Senior Frontend Developer)</li>\n<li>Tiefes Verständnis der Web Platform und ihrer Standards</li>\n<li>Sehr gute Fähigkeiten in modernem HTML, CSS und frontend-seitigem JavaScript</li>\n<li>Erfahrung mit Service Worker und Progressive Web Apps (PWA)</li>\n<li>Verständnis von HTTP, Caching-Strategien und Authentifizierungsmechanismen</li>\n<li>Ein Bewusstsein für gängige Security-Risiken von Web-Anwendungen (OWASP Top 10 Web Application Security Risks) und Gegenmaßnahmen</li>\n<li>Erfahrung in der Nutzung und im besten Fall in der Implementierung von RESTful APIs</li>\n<li>Sehr gute Kenntnisse in TypeScript und gängigen Build-Tools</li>\n<li>Vertrautheit mit Progressive Enhancement und Accessibility</li>\n<li>Hilfreich: bereits Erfahrung mit dem AWS Ökosystem, im besonderen AWS API Gateway, AWS Lambda, AWS CloudFront und AWS Cloud Formation bzw. AWS CDK</li>\n<li>Ein gutes Auge für UX und UI Design</li>\n<li>Erfahrung in agilen Arbeitsumfeldern, selbständige Arbeitsweise und Hands-on Mentalität</li>\n<li>Hervorragende Kommunikationsfähigkeiten</li>\n<li>Ausgezeichnete Problemlösungskompetenz und die Fähigkeit, verschiedene Sichtweisen und “Flughöhen” einzunehmen</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Wir bieten Dir eine Remote-Position in einem hybriden Team.</li>\n<li>An der Schnittstelle zwischen Frontend und Backend hast Du die Möglichkeit, mitzugestalten und Dich fachlich weiterzuentwickeln.</li>\n<li>Wir pflegen ein offenes und vertrauensvolles Miteinander und legen viel Wert auf Zusammenhalt.</li>\n<li>Dein Arbeitsequipment (Apple/Lenovo) suchst Du Dir selbst aus.</li>\n<li>Du erhältst ein attraktives Jahresgehalt zwischen 70.000 und 80.000 EUR nach Qualifikation.</li>\n<li>Dir steht ein jährliches Budget für individuelle Schulungs- und Weiterbildungsmaßnahmen zur Verfügung.</li>\n<li>Wir bieten Dir weitere Benefits, wie Firmenfahrrad und regelmäßige Teamevents.</li>\n<li>Und natürlich darfst Du unsere Digitalen Essensmarken gleich persönlich ausprobieren.</li>\n<li>Lust auf Hrmony? Super, wir freuen uns auf Deine Bewerbung.</li>\n</ul>\n<p><strong>Bewirb Dich jetzt und werde Teil von Hrmony!</strong></p>\n",
      "how_to_apply": "<p><a href=\"https://hrmony.join.com/jobs/1967098-frontend-architect-m-w-d?pid=357a3b4531918760973f&amp;oid=262ae62d-a9c4-4e72-a9ec-8dbc5ddbec12&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=frontend%2Barchitect%2Bm%2Bw%2Bd\">https://hrmony.join.com/jobs/1967098-frontend-architect-m-w-d?pid=357a3b4531918760973f&amp;oid=262ae62d-a9c4-4e72-a9ec-8dbc5ddbec12&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=frontend%2Barchitect%2Bm%2Bw%2Bd</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3ViIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a8f41eae7994d1e87009dd825ffc26c91dbc3839/Bildschirmfoto%202021-03-09%20um%2013.56.48.png"
    }
  ]